{
  "id": "FIREFLIES_1148499",
  "semantic_identifier": "1148499 - Marinerock Outdoor Gear - sales_pitch - Discussion with Dustin Dean",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-03-26 00:00:00",
  "metadata": {
    "meeting_date": "2025-03-26 00:00:00",
    "duration_min": "17"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-03"
      ],
      "year_month": "2025-03",
      "meeting_title": "1148499 - Marinerock Outdoor Gear - sales_pitch - Discussion with Dustin Dean",
      "organizer_email": "james_choi@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "James Choi: Hi Dustin—James Choi here. Thanks for taking a few minutes. Did I catch you at an okay time?",
      "link": "https://www.onyx.app/9158769-1"
    },
    {
      "text": "Dustin Dean: Yeah, I’ve got a few minutes. What’s up?",
      "link": "https://www.onyx.app/9158769-2"
    },
    {
      "text": "James Choi: Great. I’ll be quick. I’m reaching out because we’ve been talking with a lot of sales leaders who are tired of end-of-quarter forecast surprises—where the CRM says “commit,” but reality says “not happening.” We built something called Sales_Accelerator that sits on top of Salesforce or HubSpot and turns your pipeline signals into an explainable forecast and clear “what to do next” guidance. Curious—how are you forecasting today at Marinerock Outdoor Gear?",
      "link": "https://www.onyx.app/9158769-3"
    },
    {
      "text": "Dustin Dean: Mostly Salesforce, but we still end up doing a spreadsheet rollup for leadership. It’s… not fun. And accuracy depends on who updated what.",
      "link": "https://www.onyx.app/9158769-4"
    },
    {
      "text": "James Choi: That’s exactly the pattern we see. The core thing Sales_Accelerator does is combine your CRM stage data with actual activity signals—emails, calls, meetings—plus cycle-time benchmarks to tell you what’s real. Instead of “we feel good,” it gives you a commit / best-case / pipeline view with drivers you can point to, like: stage age, last touch, whether a next meeting is scheduled, and engagement trend.",
      "link": "https://www.onyx.app/9158769-5"
    },
    {
      "text": "Dustin Dean: Okay. We do look at stage age, but it’s manual. And “next meeting scheduled” is a constant battle.",
      "link": "https://www.onyx.app/9158769-6"
    },
    {
      "text": "James Choi: Right—and the manual part is where it breaks down. One feature we lean on heavily is our sales_forecast module. It flags slippage risk automatically. For example, if a deal is marked commit but it’s older than your typical cycle-time for that stage, hasn’t had a meaningful touch in X days, and there’s no next meeting on the calendar—Sales_Accelerator highlights it as “weakening,” and it tells you why. That lets your VP Sales run a targeted deal review instead of spending an hour debating whose gut is right.",
      "link": "https://www.onyx.app/9158769-7"
    },
    {
      "text": "Dustin Dean: That would be helpful. We do deal reviews, but it’s often a lot of storytelling.",
      "link": "https://www.onyx.app/9158769-8"
    },
    {
      "text": "James Choi: Exactly. And the goal isn’t to replace the rep’s context—it’s to give a consistent system so the conversation starts with facts. You can drill from pipeline-level forecast down to the opportunity and see, “This is slipping because the stage is aging and activity dropped,” or “This looks solid because there’s been steady engagement and a next step is locked.”",
      "link": "https://www.onyx.app/9158769-9"
    },
    {
      "text": "Dustin Dean: How hard is this to set up? We don’t want another tool that requires a huge admin project.",
      "link": "https://www.onyx.app/9158769-10"
    },
    {
      "text": "James Choi: Totally fair. It’s designed as an execution layer on top of your existing CRM, so it’s not asking you to rebuild your process. Typically we connect to Salesforce/HubSpot, map your stages, and pull in activity signals. From there, Sales_Accelerator starts producing the forecast views and diagnostics—stage conversion, slippage trends, and segment-level breakdowns by rep or source. The point is to get you out of spreadsheets and into a forecast you can explain to leadership.",
      "link": "https://www.onyx.app/9158769-11"
    },
    {
      "text": "Dustin Dean: You mentioned “explainable.” What does that look like in practice?",
      "link": "https://www.onyx.app/9158769-12"
    },
    {
      "text": "James Choi: Great question. Every forecast rollup has the underlying drivers visible—think “why we believe this is commit.” You can see the impact of stage age, last touch, next meeting scheduled, engagement signals, and historical win rate for similar deals. So if your leadership asks “why did commit drop this week,” you can answer without hunting through notes or chasing reps.",
      "link": "https://www.onyx.app/9158769-13"
    },
    {
      "text": "Dustin Dean: That would save time. Our leadership always wants to know what changed and why.",
      "link": "https://www.onyx.app/9158769-14"
    },
    {
      "text": "James Choi: Exactly. And you can do scenario planning too. For instance: “If we add 20 new SQLs in our top segment, what’s the expected impact on the quarter?” The forecast uses your historical conversion and cycle-time benchmarks so you’re not guessing. It’s especially useful when you’re deciding whether you need more pipeline coverage or you should focus on progressing what you already have.",
      "link": "https://www.onyx.app/9158769-15"
    },
    {
      "text": "Dustin Dean: Interesting. We’ve been trying to get more disciplined about pipeline math instead of just pushing for “more deals.”",
      "link": "https://www.onyx.app/9158769-16"
    },
    {
      "text": "James Choi: That discipline is where teams see the biggest change. And the use case I think is most relevant to you: a VP Sales improving quarter-end accuracy by replacing manual spreadsheet rollups with an explainable forecast that highlights which commit deals are actually weakening—like “stage age + no next meeting + low engagement”—and then running targeted deal reviews on just those deals.",
      "link": "https://www.onyx.app/9158769-17"
    },
    {
      "text": "Dustin Dean: That’s basically our pain. We spend a lot of time chasing updates, and then we still get surprised.",
      "link": "https://www.onyx.app/9158769-18"
    },
    {
      "text": "James Choi: Makes sense. Quick check—how often are you updating your forecast and running reviews today? Weekly? Twice a week near EOM?",
      "link": "https://www.onyx.app/9158769-19"
    },
    {
      "text": "Dustin Dean: Weekly, then it becomes more frequent near the end. And it’s a scramble.",
      "link": "https://www.onyx.app/9158769-20"
    },
    {
      "text": "James Choi: Got it. Sales_Accelerator is built to reduce that scramble by keeping the risk signals continuously updated—so you’re not discovering on Friday that half your commit deals have no next step. It’s more of a proactive “here are the deals at risk and what’s driving it” view, so your reviews can be shorter and more focused.",
      "link": "https://www.onyx.app/9158769-21"
    },
    {
      "text": "Dustin Dean: Sounds good, but I’m wondering—does it just tell you “bad” or does it actually help you act?",
      "link": "https://www.onyx.app/9158769-22"
    },
    {
      "text": "James Choi: Great point. We’re not trying to be just another dashboard. When a deal is at risk, it doesn’t just flag it—it pushes a recommended next action, like “schedule next meeting,” “re-engage stakeholder,” or “confirm timeline,” based on the pattern it’s seeing. But for this first conversation, the simplest win is forecast accuracy and removing spreadsheet rollups—because that’s measurable quickly.",
      "link": "https://www.onyx.app/9158769-23"
    },
    {
      "text": "Dustin Dean: Yeah, if we can kill the spreadsheet, people will be happy.",
      "link": "https://www.onyx.app/9158769-24"
    },
    {
      "text": "James Choi: Exactly. To make this concrete, what I’d suggest is a deeper session where we look at your current forecast workflow, your CRM stages, and what signals you track today. Then we can show you what Sales_Accelerator would flag as weakening in your commit, and what the forecast would look like by segment and rep. Does that sound worth a longer working session?",
      "link": "https://www.onyx.app/9158769-25"
    },
    {
      "text": "Dustin Dean: Yeah, I’d be open to that. I’d want our ops lead involved too.",
      "link": "https://www.onyx.app/9158769-26"
    },
    {
      "text": "James Choi: Perfect. If you can bring your sales ops lead and maybe whoever owns forecasting, I’ll bring a quick demo focused on sales_forecast—commit/best-case views, slippage diagnostics, and the explainable drivers. We’ll keep it practical: your stages, your cycle times, and how you’d replace the spreadsheet.",
      "link": "https://www.onyx.app/9158769-27"
    },
    {
      "text": "Dustin Dean: That works. How long are you thinking?",
      "link": "https://www.onyx.app/9158769-28"
    },
    {
      "text": "James Choi: Typically 30 minutes. If we’re getting into more detail, we can extend to 45, but we can start with 30. Are you free Thursday morning or Friday afternoon?",
      "link": "https://www.onyx.app/9158769-29"
    },
    {
      "text": "Dustin Dean: Thursday morning could work. Around 10?",
      "link": "https://www.onyx.app/9158769-30"
    },
    {
      "text": "James Choi: Thursday at 10 works on my end. I’ll send a calendar invite for 10:00–10:30 and include a short pre-read—just a couple questions about your CRM and how you define commit. Sound good?",
      "link": "https://www.onyx.app/9158769-31"
    },
    {
      "text": "Dustin Dean: Yeah, send it over. I’ll loop in our ops lead.",
      "link": "https://www.onyx.app/9158769-32"
    },
    {
      "text": "James Choi: Great. Thanks, Dustin—appreciate the time today. I’ll get that invite out and we’ll focus the next session on eliminating the spreadsheet and improving forecast accuracy with clear risk signals.",
      "link": "https://www.onyx.app/9158769-33"
    },
    {
      "text": "Dustin Dean: Sounds good. Talk Thursday.",
      "link": "https://www.onyx.app/9158769-34"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "james_choi@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "dustin_dean@marinerock_outdoor_gear.onyx.app"
    }
  ]
}