{
  "id": "FIREFLIES_5536128",
  "semantic_identifier": "5536128 - Unitypeak Nonprofits - sales_pitch - Discussion with Fernando Chapman",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-03-30 00:00:00",
  "metadata": {
    "meeting_date": "2025-03-30 00:00:00",
    "duration_min": "23"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-03"
      ],
      "year_month": "2025-03",
      "meeting_title": "5536128 - Unitypeak Nonprofits - sales_pitch - Discussion with Fernando Chapman",
      "organizer_email": "megan_foster@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Megan Foster: Hi Fernando—Megan Foster here. Thanks for taking a few minutes today. I work with revenue teams that live in Salesforce or HubSpot but want a cleaner way to turn what they already know about accounts into the next best actions, and also tighten forecasting so quarter-end isn’t a surprise. How are things going at Unitypeak Nonprofits?",
      "link": "https://www.onyx.app/6638533-1"
    },
    {
      "text": "Fernando Chapman: Hey Megan—doing well, thanks. We’re in the middle of planning for the next quarter, so honestly forecasting and pipeline health are top of mind.",
      "link": "https://www.onyx.app/6638533-2"
    },
    {
      "text": "Megan Foster: Perfect timing then. I’ll keep this quick. The product is called Sales_Accelerator—think of it as a sales execution layer that sits on top of your CRM. It doesn’t replace Salesforce; it pulls in your existing stages plus activity signals—emails, calls, meetings—and then explains what’s driving your forecast and flags deals that are drifting. The big value is: more accurate commit numbers and clear guidance on what to do next on each opportunity.",
      "link": "https://www.onyx.app/6638533-3"
    },
    {
      "text": "Fernando Chapman: We’ve tried a couple forecasting add-ons before. They usually end up being “another dashboard” that reps don’t use. What’s different here?",
      "link": "https://www.onyx.app/6638533-4"
    },
    {
      "text": "Megan Foster: Totally fair. Two things that tend to change adoption. First, the forecast isn’t just a number—it’s explainable. For each opportunity it shows drivers like stage age, last touch, whether a next meeting is scheduled, and historical win rate for similar deals. So a manager can say, “This is in commit, but it’s 21 days stale with no next meeting—why?”  \nSecond, it’s action-oriented: reps get “best next action” prompts tied to those drivers, like “book next meeting,” “send follow-up sequence,” or “re-engage champion,” rather than passively looking at charts.",
      "link": "https://www.onyx.app/6638533-5"
    },
    {
      "text": "Fernando Chapman: Okay. How does it handle different segments? We have a mix—smaller nonprofits with faster cycles, and larger orgs that move slow and have more stakeholders.",
      "link": "https://www.onyx.app/6638533-6"
    },
    {
      "text": "Megan Foster: That’s exactly where it helps. Sales_Accelerator can forecast by segment, rep, and source, and it tracks stage conversion and slippage diagnostics. So you’ll see, for example, “Enterprise nonprofit segment is slipping in security review” or “Mid-market is stuck between discovery and demo.” Then sales ops can test a process fix—like pulling a security checklist earlier—and monitor whether conversion improves over the next few weeks.",
      "link": "https://www.onyx.app/6638533-7"
    },
    {
      "text": "Fernando Chapman: The bottleneck visibility is interesting. Right now we do that manually in spreadsheets, and it’s… not fun. But reps will ask, “Where is this coming from?”",
      "link": "https://www.onyx.app/6638533-8"
    },
    {
      "text": "Megan Foster: Yep—and that’s why the “drivers” piece matters. It’s not a black box. If the forecast changes, it will show why: stage age creeping up, fewer touches than your benchmark, no meeting on the calendar, or a lower historical win rate for deals that look like this one. That way your sales leaders can coach with evidence, and reps feel it’s fair because it’s based on the same activity and CRM data they already use.",
      "link": "https://www.onyx.app/6638533-9"
    },
    {
      "text": "Fernando Chapman: We’re also trying to reduce end-of-quarter fire drills. Any tool claims it helps that.",
      "link": "https://www.onyx.app/6638533-10"
    },
    {
      "text": "Megan Foster: For sure. Where we typically see impact is early warning. You get alerts when deals are at risk—like “stalled in stage beyond benchmark,” “last touch exceeded threshold,” or “pushed close date twice.” Instead of finding out in week 12, you see it in week 6 and can re-allocate time or build coverage. That translates into fewer surprises and a more realistic commit.",
      "link": "https://www.onyx.app/6638533-11"
    },
    {
      "text": "Fernando Chapman: Makes sense. We also care about accountability—managers need to know what changed week to week.",
      "link": "https://www.onyx.app/6638533-12"
    },
    {
      "text": "Megan Foster: Exactly. Sales_Accelerator gives you commit / best-case / pipeline views, and then breakouts by rep and segment. On top of that, it’s good for scenario planning. For example: “If we add 20 SQLs in our top segment, what’s the expected impact on pipeline and commit?” It uses your historical conversion and cycle-time benchmarks, so you can sanity-check growth plans with real data.",
      "link": "https://www.onyx.app/6638533-13"
    },
    {
      "text": "Fernando Chapman: Scenario planning would help. Our leadership always asks, “What happens if we hire two more SDRs?” and we end up guessing.",
      "link": "https://www.onyx.app/6638533-14"
    },
    {
      "text": "Megan Foster: Right—and the nice part is it’s grounded in your funnel reality, not generic benchmarks. Another quick example tied to your earlier point about segments: you can model “If we improve conversion from discovery to demo by 5% in enterprise nonprofits, what happens to forecasted revenue?” That’s a concrete way for sales ops to prioritize improvements.",
      "link": "https://www.onyx.app/6638533-15"
    },
    {
      "text": "Fernando Chapman: What does implementation look like? I don’t want a six-month project.",
      "link": "https://www.onyx.app/6638533-16"
    },
    {
      "text": "Megan Foster: Totally. Typically it’s lightweight because we’re sitting on top of the CRM. We connect Salesforce or HubSpot, pull stages and historical opportunity data, and connect activity signals. Then we calibrate benchmarks—cycle time by stage, touch thresholds, and basic segments. Many teams see value in a few weeks, not months, because the first win is visibility: what’s stuck, what’s slipping, and which deals need attention now.",
      "link": "https://www.onyx.app/6638533-17"
    },
    {
      "text": "Fernando Chapman: And it won’t disrupt how reps work day to day?",
      "link": "https://www.onyx.app/6638533-18"
    },
    {
      "text": "Megan Foster: That’s the goal—minimal disruption. Reps still live in the CRM, but Sales_Accelerator surfaces prioritized actions and risks without making them re-enter data. Managers and ops get the forecasting and diagnostics layer that’s usually missing in the CRM alone.",
      "link": "https://www.onyx.app/6638533-19"
    },
    {
      "text": "Fernando Chapman: Okay. This is definitely in our problem area. What would you need from us to see if this fits?",
      "link": "https://www.onyx.app/6638533-20"
    },
    {
      "text": "Megan Foster: Great question. For a proper evaluation, I’d suggest a 30–45 minute working session with you and whoever owns forecasting—maybe sales ops or a frontline manager. We’ll map your stages, define two or three key segments, and I’ll show you how the drivers and slippage diagnostics would look using a sample view. If you’re open to it, we can also identify one bottleneck you suspect—like late-stage approvals—and walk through how we’d test a process fix and monitor improvement.",
      "link": "https://www.onyx.app/6638533-21"
    },
    {
      "text": "Fernando Chapman: That sounds reasonable. I can loop in our sales ops manager—she’s been pushing for better pipeline diagnostics.",
      "link": "https://www.onyx.app/6638533-22"
    },
    {
      "text": "Megan Foster: Perfect. How about we schedule that for early next week? I can send an agenda: forecasting drivers, stage conversion/slippage by segment and rep, and a quick look at scenario planning. Then we’ll confirm success criteria—like reducing stale opportunities in commit and improving forecast accuracy.",
      "link": "https://www.onyx.app/6638533-23"
    },
    {
      "text": "Fernando Chapman: Monday or Tuesday afternoon could work. Send me a couple options and I’ll bring her in.",
      "link": "https://www.onyx.app/6638533-24"
    },
    {
      "text": "Megan Foster: Will do. Last quick check: are you on Salesforce today, and do you track calls/emails through a tool like Outreach or directly in the CRM?",
      "link": "https://www.onyx.app/6638533-25"
    },
    {
      "text": "Fernando Chapman: We’re on Salesforce. Activity is a mix—some logged in Salesforce, some through Outreach.",
      "link": "https://www.onyx.app/6638533-26"
    },
    {
      "text": "Megan Foster: Great—that’s common and workable. I’ll email two time slots and a short prep list—nothing heavy. Appreciate the time, Fernando. Looking forward to digging in with you and your ops lead.",
      "link": "https://www.onyx.app/6638533-27"
    },
    {
      "text": "Fernando Chapman: Thanks Megan. This sounds promising—send it over and we’ll get it on the calendar.",
      "link": "https://www.onyx.app/6638533-28"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "megan_foster@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "fernando_chapman@unitypeak_nonprofits.onyx.app"
    }
  ]
}