{
  "id": "FIREFLIES_7435001",
  "semantic_identifier": "7435001 - Keystone Atlas Partners - sales_pitch - Discussion with Mason Davis",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-03-15 00:00:00",
  "metadata": {
    "meeting_date": "2025-03-15 00:00:00",
    "duration_min": "37"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-03"
      ],
      "year_month": "2025-03",
      "meeting_title": "7435001 - Keystone Atlas Partners - sales_pitch - Discussion with Mason Davis",
      "organizer_email": "irene_shen@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Irene Shen: Hi Mason—this is Irene Shen. Thanks for taking a few minutes. I’ll keep it brief: I’m calling because we’ve been helping AEs prevent deals from stalling by turning CRM activity into very specific “what to do next” guidance, and I thought it could map well to how Keystone Atlas Partners runs pipeline.",
      "link": "https://www.onyx.app/6235252-1"
    },
    {
      "text": "Mason Davis: Hey Irene. Sure, I’ve got a few minutes. What exactly are you selling?",
      "link": "https://www.onyx.app/6235252-2"
    },
    {
      "text": "Irene Shen: The product is called Sales_Accelerator. It sits on top of Salesforce or HubSpot—so it’s not another CRM—and it focuses on deal execution. The core is: it forecasts outcomes, flags risk early, and, most importantly for reps, it recommends the next best follow-up on each opportunity based on what’s actually happened and who’s involved.",
      "link": "https://www.onyx.app/6235252-3"
    },
    {
      "text": "Mason Davis: We already have forecasting and dashboards. What’s different about it?",
      "link": "https://www.onyx.app/6235252-4"
    },
    {
      "text": "Irene Shen: Totally fair. Most dashboards tell you what happened. Sales_Accelerator tells a rep what to do next—inside the CRM—so deals keep moving. For example, one feature we lead with is sales follow-up recommendations: it looks at stage, stakeholder coverage, whether there’s a mutual action plan, and recent activity. Then it suggests the next step and can draft the actual follow-up, like a recap email with next steps and due dates.",
      "link": "https://www.onyx.app/6235252-5"
    },
    {
      "text": "Mason Davis: Drafting emails sounds like another AI writing tool. We’ve tried those and adoption wasn’t great.",
      "link": "https://www.onyx.app/6235252-6"
    },
    {
      "text": "Irene Shen: Yeah, generic “AI email writer” usually fails because it’s not connected to the deal context or your approved messaging. The difference here is the recommendation is triggered by real deal signals—like, “meeting happened, but no follow-up was logged,” or “only one contact engaged for three weeks,” or “mutual plan incomplete for this stage.” And the content it drafts is anchored to your positioning, not random. If you already use something like Customer_Analyzer for fit scores and positioning blocks, Sales_Accelerator consumes that—so reps get tailored proof points and objection responses that are consistent with what you’ve approved.",
      "link": "https://www.onyx.app/6235252-7"
    },
    {
      "text": "Mason Davis: We don’t use Customer_Analyzer today. Does that matter?",
      "link": "https://www.onyx.app/6235252-8"
    },
    {
      "text": "Irene Shen: Not required. Sales_Accelerator still works off your CRM data and activity signals. Customer_Analyzer just strengthens the tailoring layer if you have it—fit scoring, positioning blocks, that kind of thing. But even without it, the immediate value is: fewer stalls, tighter follow-up, and more consistent progression across reps without forcing a rigid methodology.",
      "link": "https://www.onyx.app/6235252-9"
    },
    {
      "text": "Mason Davis: Okay. Tell me what “recommend the next action” looks like day-to-day. Reps don’t want another place to check.",
      "link": "https://www.onyx.app/6235252-10"
    },
    {
      "text": "Irene Shen: Exactly—so we don’t make them. It shows up as a lightweight task queue right in the opportunity view or via a browser extension. Think of it like: open an opp, and you see “Next best action: send recap + confirm stakeholders + propose mutual action plan.” One click generates the recap email, one click creates the mutual action plan checklist with reminders, and it nudges multi-threading when there’s only one active contact.",
      "link": "https://www.onyx.app/6235252-11"
    },
    {
      "text": "Mason Davis: Multi-threading is a big one for us—deals die because we can’t get to the economic buyer. How does your tool know that?",
      "link": "https://www.onyx.app/6235252-12"
    },
    {
      "text": "Irene Shen: We look at stakeholder engagement and activity patterns. If an opportunity has only one contact with recent engagement, or if key roles are missing for that stage—like no finance or no exec sponsor—we flag it and recommend a multi-threading action. That might include suggested outreach targets based on your account data, plus a sequence suggestion: email + LinkedIn touch + call cadence, spread over a few days, so it’s actionable rather than just “you should multi-thread.”",
      "link": "https://www.onyx.app/6235252-13"
    },
    {
      "text": "Mason Davis: And you said it can do a mutual action plan?",
      "link": "https://www.onyx.app/6235252-14"
    },
    {
      "text": "Irene Shen: Yes. After discovery, a super common stall is: everyone leaves the call feeling good, but there’s no written plan, no dates, and no clear stakeholders. In our AE use case, Sales_Accelerator drafts the discovery recap email, inserts two tailored proof points aligned to the account context, and then generates a mutual action plan checklist—things like “Security review,” “ROI validation,” “Stakeholder meeting,” with proposed due dates. It also reminds the rep if those items aren’t moving, so the deal doesn’t silently slip.",
      "link": "https://www.onyx.app/6235252-15"
    },
    {
      "text": "Mason Davis: Our managers will ask: does it actually improve forecasting accuracy, or is it just coaching?",
      "link": "https://www.onyx.app/6235252-16"
    },
    {
      "text": "Irene Shen: It’s both, but the reason forecasting improves is because we measure concrete progress signals—not just stage. When mutual plans aren’t complete, or activity drops, or stakeholder coverage is thin, those are early warning signals. Managers get a view of at-risk deals with the specific reason and the recommended intervention—so it’s not a vague “red/yellow/green.” It’s “No follow-up after last meeting” or “Single-threaded, no exec contact,” and here’s the best next step.",
      "link": "https://www.onyx.app/6235252-17"
    },
    {
      "text": "Mason Davis: I like the specificity. My concern is adoption—reps hate “process.”",
      "link": "https://www.onyx.app/6235252-18"
    },
    {
      "text": "Irene Shen: Completely. Our approach is: don’t add fields, don’t force reps to learn a new methodology. We standardize the high-performing behaviors by making the next action the easiest action. When the tool auto-suggests the recap and next steps right after a meeting, reps save time and look more professional. Adoption usually comes from that immediate payoff, not from compliance.",
      "link": "https://www.onyx.app/6235252-19"
    },
    {
      "text": "Mason Davis: How heavy is the implementation? We’re not looking for a big systems project.",
      "link": "https://www.onyx.app/6235252-20"
    },
    {
      "text": "Irene Shen: It’s designed to be light. Since it sits on top of Salesforce/HubSpot, we connect to your existing objects and activity data. We typically start with a narrow scope—one team or one pipeline segment—and focus on the follow-up recommendations first. That way you can see if it reduces stalls and shortens cycle time before expanding.",
      "link": "https://www.onyx.app/6235252-21"
    },
    {
      "text": "Mason Davis: What would you need from us to evaluate it?",
      "link": "https://www.onyx.app/6235252-22"
    },
    {
      "text": "Irene Shen: For an initial evaluation, I’d suggest a 30-minute working session with you and whoever owns sales ops or enablement—just to map your stages, what “good” looks like per stage, and where deals tend to get stuck. Then we can show you a demo using your terminology—recap email, mutual action plan, multi-threading prompts—so it’s not theoretical.",
      "link": "https://www.onyx.app/6235252-23"
    },
    {
      "text": "Mason Davis: I can loop in our sales ops lead. But I want to make sure this isn’t just going to spam my team with alerts.",
      "link": "https://www.onyx.app/6235252-24"
    },
    {
      "text": "Irene Shen: Great point. The goal isn’t alert fatigue. Recommendations are prioritized and contextual—only surfaced when there’s a meaningful gap, like “meeting occurred without follow-up,” “no next meeting scheduled,” “stakeholder coverage incomplete,” or “mutual plan overdue.” And you can tune thresholds by stage so it matches your motion.",
      "link": "https://www.onyx.app/6235252-25"
    },
    {
      "text": "Mason Davis: Got it. If it can help with follow-up discipline without being overbearing, that would be valuable. We’ve had a few late-stage deals drift recently.",
      "link": "https://www.onyx.app/6235252-26"
    },
    {
      "text": "Irene Shen: That’s exactly where this helps—late-stage drift is usually visible in the signals before it hits the forecast. If you’re open to it, let’s schedule that deeper session. I can bring a quick demo focused on one flow: post-discovery follow-up—recap email, proof points, mutual action plan, and the multi-threading recommendation when stakeholder coverage is thin.",
      "link": "https://www.onyx.app/6235252-27"
    },
    {
      "text": "Mason Davis: Yeah, let’s do it. Next week would be best. Tuesday or Wednesday afternoon?",
      "link": "https://www.onyx.app/6235252-28"
    },
    {
      "text": "Irene Shen: Wednesday afternoon works. How about 2:00 PM your time for 30 minutes? And if you can invite your sales ops lead, we’ll make it practical—stage mapping, example recommendations, and what tuning would look like.",
      "link": "https://www.onyx.app/6235252-29"
    },
    {
      "text": "Mason Davis: 2:00 PM Wednesday is good. I’ll add our sales ops lead to the invite.",
      "link": "https://www.onyx.app/6235252-30"
    },
    {
      "text": "Irene Shen: Perfect. I’ll send a calendar hold and a short agenda. Thanks, Mason—looking forward to showing you how Sales_Accelerator keeps deals from stalling without adding overhead.",
      "link": "https://www.onyx.app/6235252-31"
    },
    {
      "text": "Mason Davis: Sounds good. Talk next week, Irene.",
      "link": "https://www.onyx.app/6235252-32"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "irene_shen@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mason_davis@keystone_atlas_partners.onyx.app"
    }
  ]
}