{
  "id": "FIREFLIES_9151429",
  "semantic_identifier": "9151429 - Blueharbor Dynamics - sales_pitch - Discussion with Nikhil Verma",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-03-21 00:00:00",
  "metadata": {
    "meeting_date": "2025-03-21 00:00:00",
    "duration_min": "45"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-03"
      ],
      "year_month": "2025-03",
      "meeting_title": "9151429 - Blueharbor Dynamics - sales_pitch - Discussion with Nikhil Verma",
      "organizer_email": "camila_vega@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Camila Vega: Hi Nikhil—Camila Vega here. Thanks for taking a few minutes. I’ll keep this quick: I’m calling because we built Customer_Analyzer to help product and go-to-market teams get crisp on who their best customers are and what to build and say to win more of them. Curious—are you currently trying to tighten your ICP or make roadmap decisions based on which segments are actually healthiest?",
      "link": "https://www.onyx.app/7262916-1"
    },
    {
      "text": "Nikhil Verma: Hey Camila, yeah, that’s definitely on our list. We’ve been debating which segment to lean into this year, and roadmap requests are all over the place.",
      "link": "https://www.onyx.app/7262916-2"
    },
    {
      "text": "Camila Vega: That’s exactly the scenario Customer_Analyzer is designed for. The core piece I wanted to highlight is our fit estimation: we ingest signals you already have—CRM fields, onboarding survey responses, product usage events, support tickets, even interview notes—and we output a fit score from 0 to 100 at the account and segment level. Then we show the driver breakdown so you can see why a segment scores high or low, like adoption patterns, support burden, or time-to-value.",
      "link": "https://www.onyx.app/7262916-3"
    },
    {
      "text": "Nikhil Verma: We do have a lot of that data, but it’s scattered. We’ve tried building dashboards, and it turns into a data project that never ends.",
      "link": "https://www.onyx.app/7262916-4"
    },
    {
      "text": "Camila Vega: Totally—dashboards tell you what happened, but they don’t usually answer “who should we bet on” or “what’s the best segment for the next two quarters.” With fit estimation, you can compare segments directly—like SMB versus mid-market—and see not just revenue, but who retains, expands, and adopts quickly. Then it recommends an ICP profile based on observed outcomes, not just gut feel.",
      "link": "https://www.onyx.app/7262916-5"
    },
    {
      "text": "Nikhil Verma: When you say “recommended ICP,” what does that actually look like? Like a persona?",
      "link": "https://www.onyx.app/7262916-6"
    },
    {
      "text": "Camila Vega: It’s more actionable than a persona doc. You get an ICP profile defined by the fit drivers you choose—industry, size, technographics, severity of the problem you solve, willingness to pay, adoption/usage patterns, churn risk signals—and it’s tied to what your best customers actually do in product and in support. So instead of “we think mid-market fintech is good,” you’ll see “accounts with X stack + Y onboarding behavior + low support burden + fast time-to-value are consistently high fit,” and you can quantify it.",
      "link": "https://www.onyx.app/7262916-7"
    },
    {
      "text": "Nikhil Verma: That would help. Our biggest issue is roadmap planning—everyone brings anecdotes from their favorite customers.",
      "link": "https://www.onyx.app/7262916-8"
    },
    {
      "text": "Camila Vega: Perfect use case. For product planning, teams use Customer_Analyzer to identify high-fit customers with unmet needs—so you can separate “loud requests” from “requests coming from customers who look like your best long-term cohort.” It’s a way to make roadmap bets with evidence: focus on problems that show up in high-fit segments, not just whoever is shouting the most.",
      "link": "https://www.onyx.app/7262916-9"
    },
    {
      "text": "Nikhil Verma: How do you handle situations where usage looks good but support is a mess? We’ve got a segment like that—active users, but tons of tickets.",
      "link": "https://www.onyx.app/7262916-10"
    },
    {
      "text": "Camila Vega: That’s where the driver breakdown is really helpful. Support burden is one of the fit drivers we see matter a lot. You might find the fit score is dragged down by ticket volume or specific ticket themes, even if usage is high. And because it’s at both account and segment level, you can see whether it’s a few outliers or a segment pattern—then decide if it’s a product investment or a segment you should deprioritize.",
      "link": "https://www.onyx.app/7262916-11"
    },
    {
      "text": "Nikhil Verma: Interesting. We’ve argued about that exact thing—whether it’s “bad customers” or “our product is missing something.”",
      "link": "https://www.onyx.app/7262916-12"
    },
    {
      "text": "Camila Vega: Exactly. The point isn’t to label customers as “bad”—it’s to make the tradeoffs explicit. If a segment is high revenue but consistently slow time-to-value and high support burden, the model will surface that. Then you can decide: invest to improve onboarding and reduce tickets, or focus acquisition on the segment that’s already succeeding with your current strengths.",
      "link": "https://www.onyx.app/7262916-13"
    },
    {
      "text": "Nikhil Verma: What does implementation look like? I’m wary of anything that takes months.",
      "link": "https://www.onyx.app/7262916-14"
    },
    {
      "text": "Camila Vega: Fair. The quick version: we start with the data you already have. Most teams connect CRM plus product events and at least one qualitative source—like onboarding surveys or support tickets. Then we work with you to define a handful of fit drivers that reflect your reality. You don’t need 50 fields; you need the 6–10 signals that correlate with retention, expansion, and smooth adoption. From there, you’ll get initial segment comparisons and a first pass ICP recommendation pretty quickly, and you can iterate.",
      "link": "https://www.onyx.app/7262916-15"
    },
    {
      "text": "Nikhil Verma: Who typically owns it? Product ops? Rev ops?",
      "link": "https://www.onyx.app/7262916-16"
    },
    {
      "text": "Camila Vega: Usually a product ops or growth/product analytics lead partners with rev ops on the CRM side. But it’s meant to be shared—product uses it for roadmap planning, marketing uses it for targeting and messaging, and sales uses it for qualification. The fit score creates a common language across teams.",
      "link": "https://www.onyx.app/7262916-17"
    },
    {
      "text": "Nikhil Verma: We’ve struggled with alignment, so that’s appealing. But I’d need to see how “fit” is calculated. We’ve been burned by black-box scoring before.",
      "link": "https://www.onyx.app/7262916-18"
    },
    {
      "text": "Camila Vega: Completely reasonable. It’s not a black box—you select or define the drivers, and the output includes the breakdown: “here’s the score, and here’s what contributed.” If churn risk signals are pulling a segment down, you’ll see it. If time-to-value is boosting another segment, you’ll see that. The whole idea is transparency so the team trusts the result.",
      "link": "https://www.onyx.app/7262916-19"
    },
    {
      "text": "Nikhil Verma: Okay. If we did this, what would you recommend as a first question to answer?",
      "link": "https://www.onyx.app/7262916-20"
    },
    {
      "text": "Camila Vega: For Blueharbor Dynamics, I’d start with: “Which segment should we prioritize for the next two quarters given our current product strengths?” Then we’d compare your current segments across fit score and key drivers—adoption patterns, support burden, and time-to-value are typically the fastest to reveal differences. From that, product planning becomes less about anecdotes and more about measurable cohorts.",
      "link": "https://www.onyx.app/7262916-21"
    },
    {
      "text": "Nikhil Verma: That’s basically the question we’re trying to answer right now.",
      "link": "https://www.onyx.app/7262916-22"
    },
    {
      "text": "Camila Vega: Great. What I’d suggest is a longer working session—maybe 30 minutes—where you and I map your current segments and the signals you already track, and I can show you what the fit score output and driver breakdown looks like in practice. Then we can decide if it’s worth a deeper evaluation. Would next week work?",
      "link": "https://www.onyx.app/7262916-23"
    },
    {
      "text": "Nikhil Verma: Yeah, I’m open to that. Early next week is best.",
      "link": "https://www.onyx.app/7262916-24"
    },
    {
      "text": "Camila Vega: Perfect—how’s Tuesday at 10:30am your time? If that’s tight, I can do Monday afternoon as well.",
      "link": "https://www.onyx.app/7262916-25"
    },
    {
      "text": "Nikhil Verma: Tuesday at 10:30 works. Send an invite and include what you need from us beforehand.",
      "link": "https://www.onyx.app/7262916-26"
    },
    {
      "text": "Camila Vega: Will do. I’ll send a calendar invite for Tuesday 10:30 with a short checklist—mostly what systems you use for CRM and product events, and what segments you’re debating. Thanks, Nikhil—looking forward to it.",
      "link": "https://www.onyx.app/7262916-27"
    },
    {
      "text": "Nikhil Verma: Sounds good. Thanks, Camila.",
      "link": "https://www.onyx.app/7262916-28"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "camila_vega@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "nikhil_verma@blueharbor_dynamics.onyx.app"
    }
  ]
}