{
  "id": "FIREFLIES_6964154",
  "semantic_identifier": "6964154 - Firefly Meridian Labs - buy - Discussion with Thomas Gray",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2026-04-03 00:00:00",
  "metadata": {
    "meeting_date": "2026-04-03 00:00:00",
    "duration_min": "44"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2026-04"
      ],
      "year_month": "2026-04",
      "meeting_title": "6964154 - Firefly Meridian Labs - buy - Discussion with Thomas Gray",
      "organizer_email": "camila_vega@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Camila Vega: Hi Thomas—good to see you again. Since this is call three, I wanted to use today to confirm we’re aligned on the outcomes, address the data-quality concern you raised, and—if everything checks out—land on the plan and timing to get Customer_Analyzer kicked off. Does that work?",
      "link": "https://www.onyx.app/2364082-1"
    },
    {
      "text": "Thomas Gray: Yep, that’s exactly what I want. We’re interested; we just need to be sure it’ll work with the state of our CRM and product data, and then I can move it forward.",
      "link": "https://www.onyx.app/2364082-2"
    },
    {
      "text": "Camila Vega: Perfect. Let me anchor on the two pieces you’ve cared most about: first, the fit estimation—getting a fit score by account and by segment with a clear “why” breakdown. Second, the segment comparisons so your team can prioritize which industries to target next quarter using retention and support burden signals. Is that still the core use case for Firefly Meridian Labs?",
      "link": "https://www.onyx.app/2364082-3"
    },
    {
      "text": "Thomas Gray: Yes. We have opinions internally, but we don’t have a consistent way to prove which industries are actually good for us. And support burden is a big one—we’ve got a couple segments that just eat time.",
      "link": "https://www.onyx.app/2364082-4"
    },
    {
      "text": "Camila Vega: That’s exactly where Customer_Analyzer tends to pay off fastest. The fit estimation isn’t just a number; it’s a 0–100 score plus the driver breakdown—so you can see, for example, “industry X scores high because time-to-value is short and adoption is strong,” versus “industry Y looks attractive on ACV but churn risk signals and support burden drag it down.” Then the segment comparison view makes that obvious across SMB vs mid-market, or across industries, with a recommended ICP profile based on your observed outcomes—retention, expansion, conversion.",
      "link": "https://www.onyx.app/2364082-5"
    },
    {
      "text": "Thomas Gray: The “why” matters to me. If it just spits out a score, my team will argue with it. If we can see what’s driving it, it’s easier to get alignment.",
      "link": "https://www.onyx.app/2364082-6"
    },
    {
      "text": "Camila Vega: Exactly. And that’s what makes it usable for marketing, sales, and product at the same time—because everyone can debate the drivers instead of debating anecdotes. Now, you also flagged a real concern last time: missing fields, inconsistent tagging, and some sparse usage data. That can reduce scoring accuracy if we pretend the data is perfect—so we don’t.",
      "link": "https://www.onyx.app/2364082-7"
    },
    {
      "text": "Thomas Gray: Right. Our CRM fields aren’t always filled in, and our onboarding survey completion is inconsistent. Product events are decent, but not for every feature.",
      "link": "https://www.onyx.app/2364082-8"
    },
    {
      "text": "Camila Vega: Totally normal. Here’s how we handle it in practice. Step one is we start with the signals you already trust most: retention outcomes, support ticket volume or categories, and the usage events that are most reliably captured. We can still include firmographics—industry, size—because those are usually present even when other fields are messy. Step two, for any missing fields, we don’t “invent” data; we treat them as unknowns and weight drivers accordingly so the model doesn’t overconfidently penalize or reward a segment. Step three, we show you coverage—so you’ll literally see where scoring confidence is high versus where you have data gaps.",
      "link": "https://www.onyx.app/2364082-9"
    },
    {
      "text": "Thomas Gray: That last part is good. I don’t want a black box. How fast would we know if our data is too messy?",
      "link": "https://www.onyx.app/2364082-10"
    },
    {
      "text": "Camila Vega: Within the first two weeks you’ll know. Week one is connecting sources and running an initial pass; week two is calibrating drivers and validating that the results line up with reality—like “do the accounts we believe are strong actually score strong, and if not, why?” If the gap is data coverage, we’ll identify the top three missing fields or inconsistent tags that would meaningfully improve the scoring. It becomes a short, pragmatic data checklist, not a months-long cleanup project.",
      "link": "https://www.onyx.app/2364082-11"
    },
    {
      "text": "Thomas Gray: Okay. And the output—how do teams use it day-to-day? My worry is we buy it, it’s interesting for a month, and then it fades.",
      "link": "https://www.onyx.app/2364082-12"
    },
    {
      "text": "Camila Vega: Fair. The customers who keep using it tie it to quarterly planning and pipeline review. For your use case—prioritizing industries next quarter—the workflow is: you look at segment comparisons that combine retention outcomes and support burden. You pick, say, two “lean-in” industries and one “deprioritize” industry. Then you use the driver breakdown to turn it into messaging: what value props land, what proof points matter, what objections you should handle proactively. It gives marketing the narrative, gives sales the “who we win with” guidance, and gives product a clearer view of which customers succeed with the current strengths.",
      "link": "https://www.onyx.app/2364082-13"
    },
    {
      "text": "Thomas Gray: That would help. Right now, marketing is pushing into one industry because it’s trendy, and support is begging us to stop selling to another because it’s chaos.",
      "link": "https://www.onyx.app/2364082-14"
    },
    {
      "text": "Camila Vega: Customer_Analyzer is built for exactly that tension. It turns those arguments into shared evidence: “this segment retains well and has low support burden—focus,” versus “this segment churns and generates tickets—be careful.” And because it’s at both account and segment level, you’re not forced into one-size-fits-all; you can still find the sub-segment within an industry that’s actually a good fit.",
      "link": "https://www.onyx.app/2364082-15"
    },
    {
      "text": "Thomas Gray: Makes sense. What do you need from me to get the pilot moving? And how do you define success so I can justify the purchase?",
      "link": "https://www.onyx.app/2364082-16"
    },
    {
      "text": "Camila Vega: Great question. For success criteria, I’d propose three measurable outcomes over the first 30–45 days:  \n1) You have fit scores and driver breakdowns for your top accounts plus at least 3–5 meaningful segments (industries or size bands).  \n2) You’ve identified the two industries to prioritize next quarter, backed by retention and support burden signals, and you’ve aligned marketing and sales on the recommended ICP profile.  \n3) You have a positioning pack for those priority segments—value propositions, differentiators, proof points, and a short objection-handling sheet—pulled from the insights so it’s immediately usable.",
      "link": "https://www.onyx.app/2364082-17"
    },
    {
      "text": "Thomas Gray: That’s reasonable. If we can walk into QBR with that and everyone buys in, it’s a win.",
      "link": "https://www.onyx.app/2364082-18"
    },
    {
      "text": "Camila Vega: Exactly. On what I need from you: an internal champion to own the data connections—often RevOps or someone on your analytics side—and someone from Support Ops if you want the support burden signals to be accurate. But you personally don’t need to do the wiring; you just need to sponsor access and confirm the segments you care about comparing.",
      "link": "https://www.onyx.app/2364082-19"
    },
    {
      "text": "Thomas Gray: I can pull in RevOps. Support Ops might be a little slower, but we can start with ticket counts and categories.",
      "link": "https://www.onyx.app/2364082-20"
    },
    {
      "text": "Camila Vega: That works. Starting simple is fine—ticket volume and top categories are usually enough to see the pattern. Now, since we’re trying to get this over the line today: what’s left that would stop you from moving forward with Customer_Analyzer?",
      "link": "https://www.onyx.app/2364082-21"
    },
    {
      "text": "Thomas Gray: Two things. One—pricing and term. Two—my concern that we’ll spend time integrating and then realize the results aren’t trusted because of the data gaps.",
      "link": "https://www.onyx.app/2364082-22"
    },
    {
      "text": "Camila Vega: On trust: that’s why we bake in coverage and confidence, and why we calibrate against known outcomes in week two. If the system says a historically strong segment is weak, we’ll know quickly whether that’s a real signal or a data artifact—and we’ll show you the drivers so you can validate it. Also, because it’s driver-based, you can start with a smaller set of drivers you trust—firmographics, retention, support—and expand as your usage instrumentation improves.",
      "link": "https://www.onyx.app/2364082-23"
    },
    {
      "text": "Thomas Gray: That addresses it enough for me, assuming the initial results aren’t wildly off.",
      "link": "https://www.onyx.app/2364082-24"
    },
    {
      "text": "Camila Vega: And if they are, that’s still valuable—it usually reveals either a data issue we can fix quickly, or a genuine mismatch that’s been hiding behind assumptions. Either way, you learn fast. On pricing and term—based on what we discussed last time for your team size and the number of connected sources, I can hold the proposal at the same level we sent: annual subscription, with onboarding included, and an opt-out clause tied to those success criteria within the first 45 days. If we don’t deliver the three outcomes we just outlined, you can exit. Would that remove the risk enough to sign?",
      "link": "https://www.onyx.app/2364082-25"
    },
    {
      "text": "Thomas Gray: The opt-out tied to success criteria helps a lot. I’d need procurement to review, but conceptually, yes—that makes it easier.",
      "link": "https://www.onyx.app/2364082-26"
    },
    {
      "text": "Camila Vega: Good. If you’re comfortable, the clean next step is: I send the order form today with those success criteria written into the kickoff plan and the opt-out language, and you introduce me to your RevOps lead so we can schedule the technical kickoff for early next week. Can you do that?",
      "link": "https://www.onyx.app/2364082-27"
    },
    {
      "text": "Thomas Gray: Yes. Send it over. I’ll loop in RevOps this afternoon and we can aim for kickoff next Tuesday.",
      "link": "https://www.onyx.app/2364082-28"
    },
    {
      "text": "Camila Vega: Perfect. Last quick check: for the segment prioritization, do you already have 4–6 industries you want to evaluate, or do you want us to discover them from the data first?",
      "link": "https://www.onyx.app/2364082-29"
    },
    {
      "text": "Thomas Gray: Let’s start with the six we’re already selling into—then if the tool shows an unexpected bright spot, we can add it.",
      "link": "https://www.onyx.app/2364082-30"
    },
    {
      "text": "Camila Vega: Great. I’ll include that in the kickoff agenda: score and compare those six industries, with retention and support burden as primary drivers, then review the recommended ICP profile. I’ll send the paperwork right after this call. Anything else you need from me to make internal approval smooth?",
      "link": "https://www.onyx.app/2364082-31"
    },
    {
      "text": "Thomas Gray: Just a one-pager I can forward—outcomes, timeline, and what data you need. If you send that with the order form, I can get it moving quickly.",
      "link": "https://www.onyx.app/2364082-32"
    },
    {
      "text": "Camila Vega: Done. You’ll have the order form and the one-pager within the hour. Thanks, Thomas—excited to get Firefly Meridian Labs to a clearer ICP and a more focused industry plan next quarter.",
      "link": "https://www.onyx.app/2364082-33"
    },
    {
      "text": "Thomas Gray: Thanks, Camila. Looking forward to it.",
      "link": "https://www.onyx.app/2364082-34"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "camila_vega@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "thomas_gray@firefly_meridian_labs.onyx.app"
    }
  ]
}