{
  "id": "FIREFLIES_7682683",
  "semantic_identifier": "7682683 - Deepwell Aurora Drilling - buy - Discussion with Adam Medina",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2026-04-15 00:00:00",
  "metadata": {
    "meeting_date": "2026-04-15 00:00:00",
    "duration_min": "17"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2026-04"
      ],
      "year_month": "2026-04",
      "meeting_title": "7682683 - Deepwell Aurora Drilling - buy - Discussion with Adam Medina",
      "organizer_email": "irene_shen@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Irene Shen: Adam, good to see you again. Since this is our third call, I’d love to use today to confirm the last couple of open items and, if everything lines up, agree on next steps to get Sales_Accelerator purchased and implemented. Does that work?",
      "link": "https://www.onyx.app/6818611-1"
    },
    {
      "text": "Adam Medina: Yeah, that works. We’re pretty close. I just want to make sure it’s going to help our inbound follow-up and not become another tool reps ignore.",
      "link": "https://www.onyx.app/6818611-2"
    },
    {
      "text": "Irene Shen: Totally fair. Let me anchor on the one use case you’ve emphasized: inbound speed-to-lead for the growth team. Sales_Accelerator’s sales initiation recommendations will prioritize high-fit inbound leads, propose the best first-response message, and then track whether faster first-touch is actually correlating with higher win rate. The goal is: fewer “hot leads” languishing in the queue, and more consistent outreach that matches your ICP and positioning.",
      "link": "https://www.onyx.app/6818611-3"
    },
    {
      "text": "Adam Medina: The prioritization part is what we want. Right now, it’s basically first-in-first-out unless someone manually eyeballs the lead.",
      "link": "https://www.onyx.app/6818611-4"
    },
    {
      "text": "Irene Shen: Exactly. In your CRM, you already have account and lead data, plus engagement signals—form fills, page visits, email opens if you’re capturing those. Sales_Accelerator sits on top of that and then consumes Customer_Analyzer’s fit scores and positioning blocks. So when an inbound comes in, it doesn’t just say “high priority,” it explains why—fit drivers, segment, trigger events—and it gives a recommended first-touch: email copy, LinkedIn opener, and a call talk track.",
      "link": "https://www.onyx.app/6818611-5"
    },
    {
      "text": "Adam Medina: That sounds good in theory. But one concern we raised last time: recommendations can get generic. We’ve seen “AI emails” that read like everyone else’s.",
      "link": "https://www.onyx.app/6818611-6"
    },
    {
      "text": "Irene Shen: I’m glad you’re calling that out, because it’s the main risk if the inputs aren’t maintained. The recommendations only stay sharp if Customer_Analyzer’s positioning blocks are current and the segment mapping between the two systems is consistent. The way we mitigate that is two-fold: first, we map your segments once and validate with you—like “Mid-market drilling ops” versus “enterprise procurement-led”—so the system isn’t guessing. Second, we set a lightweight cadence to keep positioning blocks updated—monthly or quarterly depending on how quickly your messaging evolves. That prevents the “generic drift.”",
      "link": "https://www.onyx.app/6818611-7"
    },
    {
      "text": "Adam Medina: Okay. If we do that mapping correctly, how custom can the actual message be? Our inbound replies need to be pretty specific—people ask about safety, uptime, and regulatory stuff.",
      "link": "https://www.onyx.app/6818611-8"
    },
    {
      "text": "Irene Shen: That’s where the positioning blocks matter. For a safety-focused segment, the initiation playbook can be configured to lead with safety proof points and specific objection handlers—like compliance concerns—rather than a generic “we help you grow.” And because the playbook links back to the rationale, reps can see: “This lead is high-fit because X and Y; lead with angle Z; here are the two proof points.” It’s not just a blob of text.",
      "link": "https://www.onyx.app/6818611-9"
    },
    {
      "text": "Adam Medina: I like the explainability. Reps won’t trust it if it’s a black box.",
      "link": "https://www.onyx.app/6818611-10"
    },
    {
      "text": "Irene Shen: Right—and managers won’t coach to it. Which brings me to the second feature I want to keep simple today: customizable initiation playbooks that are consistent across SDRs and AEs. You can standardize first-touch email, call talk track, and meeting agenda for each segment, while still letting reps personalize the first line or add context. That consistency is what improves speed-to-lead without sacrificing quality.",
      "link": "https://www.onyx.app/6818611-11"
    },
    {
      "text": "Adam Medina: What does implementation look like? We’re on HubSpot, and we do have Customer_Analyzer already feeding fit scores.",
      "link": "https://www.onyx.app/6818611-12"
    },
    {
      "text": "Irene Shen: Perfect. Since you already have Customer_Analyzer, we’re not duplicating that work. Implementation is essentially: connect to HubSpot, confirm the objects we’re using—leads, companies, deals—then validate the segment mapping and pull in the fit scores and positioning blocks. After that, we build 2–3 initiation playbooks for your highest-volume inbound segments. Your team can start with inbound only, and expand to outbound later if you want.",
      "link": "https://www.onyx.app/6818611-13"
    },
    {
      "text": "Adam Medina: Timeline?",
      "link": "https://www.onyx.app/6818611-14"
    },
    {
      "text": "Irene Shen: For a focused inbound rollout: two weeks to get the integration and mapping right, then one week to finalize playbooks and QA the recommendations with a few real inbound examples. So you can realistically be live in about three weeks, assuming we can get an admin and one rev ops person for a few short sessions.",
      "link": "https://www.onyx.app/6818611-15"
    },
    {
      "text": "Adam Medina: That’s reasonable. How do you measure whether it’s working?",
      "link": "https://www.onyx.app/6818611-16"
    },
    {
      "text": "Irene Shen: We keep it tight around your stated goal. Three metrics: speed-to-lead (time to first-touch), meeting creation rate from inbound, and win rate by fit tier. Sales_Accelerator tracks whether faster first-touch correlates with higher win rate, so you can decide if you want to enforce SLAs or just monitor trends. And because the recommendation is tied to the fit score and segment, you can see where messaging is landing—or not.",
      "link": "https://www.onyx.app/6818611-17"
    },
    {
      "text": "Adam Medina: Got it. Pricing and contract terms—we’re still aligned on what you sent over?",
      "link": "https://www.onyx.app/6818611-18"
    },
    {
      "text": "Irene Shen: Yes. The proposal we discussed: Sales_Accelerator for your growth team seats, annual term, with implementation included. No additional charge for the Customer_Analyzer integration since you already have it. If you’re comfortable today, the next step would be I send the order form, you route it through procurement, and we schedule the kickoff.",
      "link": "https://www.onyx.app/6818611-19"
    },
    {
      "text": "Adam Medina: My last question is around adoption. If it’s another dashboard, it won’t stick. How do reps actually use it day to day?",
      "link": "https://www.onyx.app/6818611-20"
    },
    {
      "text": "Irene Shen: They don’t have to leave HubSpot. The recommendations show up in their workflow: “Next-best lead to contact,” “suggested first response,” and the playbook talk track. The whole point is execution—what to do next—rather than another analytics surface. And for managers, you can see whether the team is following the initiation playbook and whether that’s impacting meetings and wins.",
      "link": "https://www.onyx.app/6818611-21"
    },
    {
      "text": "Adam Medina: That makes sense. And the risk you mentioned—positioning blocks staying current—how do we operationalize that without making it a huge lift?",
      "link": "https://www.onyx.app/6818611-22"
    },
    {
      "text": "Irene Shen: We set it up as a simple governance step. For example: once a month, your rev ops or growth lead reviews the top two segments’ positioning blocks in Customer_Analyzer, updates any proof points or objection handlers that changed, and we sync. If nothing changed, it’s a 10-minute check. If you’re launching a new campaign or entering a new region, we do a quick update. The key is: keep segment mapping stable, and treat positioning as a living asset.",
      "link": "https://www.onyx.app/6818611-23"
    },
    {
      "text": "Adam Medina: Okay. I think we’re in a good spot. I can get this approved if procurement doesn’t throw a curveball.",
      "link": "https://www.onyx.app/6818611-24"
    },
    {
      "text": "Irene Shen: Great. To make that easy, can I confirm your buying process? Who needs to sign, and what’s the typical turnaround once you submit?",
      "link": "https://www.onyx.app/6818611-25"
    },
    {
      "text": "Adam Medina: It’s me, then our VP of Revenue, then procurement for the papering. Usually a week, sometimes two.",
      "link": "https://www.onyx.app/6818611-26"
    },
    {
      "text": "Irene Shen: Perfect. Here’s what I’ll do right after this call: I’ll send the order form and a one-page summary that highlights the inbound speed-to-lead use case, the two key features—initiation recommendations and customizable playbooks—and the implementation plan with the segment mapping and positioning upkeep so procurement sees we’ve addressed the “generic recommendations” risk. If you can introduce me to your VP of Revenue over email today, we’ll keep momentum.",
      "link": "https://www.onyx.app/6818611-27"
    },
    {
      "text": "Adam Medina: I can do that. Send me the docs and I’ll forward with a note.",
      "link": "https://www.onyx.app/6818611-28"
    },
    {
      "text": "Irene Shen: Awesome. And assuming we get signature within the next two weeks, are you aiming to be live before next month’s inbound campaign?",
      "link": "https://www.onyx.app/6818611-29"
    },
    {
      "text": "Adam Medina: Yes, ideally. We’ve got a push coming and we don’t want leads slipping again.",
      "link": "https://www.onyx.app/6818611-30"
    },
    {
      "text": "Irene Shen: Then we’ll hold kickoff time on the calendar. I’ll propose two options for next week—30 minutes—with your HubSpot admin and whoever owns Customer_Analyzer messaging on your side. Sound good?",
      "link": "https://www.onyx.app/6818611-31"
    },
    {
      "text": "Adam Medina: Sounds good. Let’s do it.",
      "link": "https://www.onyx.app/6818611-32"
    },
    {
      "text": "Irene Shen: Great—thanks, Adam. I’ll send the order form and summary within the hour, and I’ll include the kickoff holds. If anything comes up in procurement—security questions, data flow—I’ll jump on a quick call and get it handled.",
      "link": "https://www.onyx.app/6818611-33"
    },
    {
      "text": "Adam Medina: Appreciate it. Looking forward to getting this in place.",
      "link": "https://www.onyx.app/6818611-34"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "irene_shen@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "adam_medina@deepwell_aurora_drilling.onyx.app"
    }
  ]
}