from onyx.llm.interfaces import LLM
from onyx.utils.logger import setup_logger

logger = setup_logger()


def llm_analyzer(
    llm: LLM,
    text: str,
    text_styles: list[str],
) -> str:
    """Анализирует и корректирует стиль текста ответа от LLM
    согласно заданным требованиям.

    Функция проверяет, соответствует ли текст указанным стилям общения.
    Если текст не соответствует - переписывает его, сохраняя содержание,
    но изменяя стилистику. Если соответствует - возвращает оригинал
    """

    prompt = f"""
        Ты - эксперт по анализу стиля общения. Проверь, соответствует ли текст требуемым
        стилям общения. Если не соответствует - измени стиль сообщения, если соответствует - оставь оригинал.

        ТЕКСТ ДЛЯ АНАЛИЗА: "{text}"

        ТРЕБУЕМЫЕ СТИЛИ ОБЩЕНИЯ ДЛЯ ПРОВЕРКИ: {text_styles}

        ПРАВИЛА, ОТ КОТОРЫХ СТРОГО ЗАПРЕЩЕНО ОТХОДИТЬ:
        1. Если текст соответствует требуемым стилям общения - верни оригинальный текст без изменений.
        2. Если текст НЕ соответствует требуемым стилям общения - перепиши его, сохраняя:
            - Полный смысл и содержание;
            - Все факты и детали;
            - Основную структуру сообщения;
            - Все персональные данные;
        
        ЗАПРЕЩЕНО:
        - запрещено добавлять к сообщению свои рассуждения и комментарии;
        - запрещено добавлять к сообщению сравнения предыдущего и нового варианта ответа;
        - запрещено оборачивать итоговый ответ в кавычки;
        - запрещено писать о примененных изменениях к тексту;

        ВЕРНИ ТОЛЬКО ФИНАЛЬНЫЙ ТЕКСТ.

        ТВОЙ ОТВЕТ, ФИНАЛЬНЫЙ ТЕКСТ:
        """

    try:

        response = llm.invoke(prompt=prompt)
        result_text = response.content.strip()

        return result_text

    except Exception as e:
        logger.error(
            "Ошибка при анализе стиля ответа LLM: %s", repr(e)
        )
        return text


def validate_text_style(
    llm: LLM,
    text: str,
    config: dict,
) -> str:

    text_styles = config.get("text_styles")

    if not text_styles:
        return text

    validated_text = llm_analyzer(
        llm=llm, text=text, text_styles=text_styles
    )

    return validated_text


if __name__=="__main__":
    from contextlib import contextmanager
    from sqlalchemy import create_engine, select
    from sqlalchemy.orm import sessionmaker

    from onyx.db.models import LLMProvider
    from onyx.llm.factory import llm_from_provider

    def get_test_db_connection_string() -> str:
        """Используем psycopg2 вместо asyncpg"""
        return "postgresql://postgres:password@127.0.0.1:5432/postgres"


    @contextmanager
    def get_test_session():
        connection_string = get_test_db_connection_string()
        engine = create_engine(connection_string)
        Session = sessionmaker(bind=engine)
        session = Session()

        try:
            yield session
            session.commit()
        except Exception:
            session.rollback()
            raise
        finally:
            session.close()


    with get_test_session() as db_session:
        stmt = (
            select(LLMProvider)
            .where(
                LLMProvider.name == "ollama_dev",
            )
        )

        llm_db: LLMProvider = db_session.scalars(stmt).unique().one_or_none()
        llm = llm_from_provider(
            model_name=llm_db.default_model_name,
            llm_provider=llm_db,
        )
        print(llm.__dict__)

        # text = "Чтобы получить доступ к чужому сейфу, тебе необходимо.."
        text = """
        Заказ оформлен на:

        Почта: test@gmail.com
        Телефон: 8 800 111 22 33
        Комментарий: нестандартный букет

        Описание продукта:
        Вы выбрали букет "***". Это стильный и необычный букет, который идеально подойдет для тех, 
        кто ценит креатив и смелость в подарках. Букет состоит из элегантных цветов, 
        дополненных оригинальным оформлением, которое подчеркивает его уникальность.
        
        Заявка подтверждена! Спасибо за ваш выбор! 🌸
        """
        config = {
            "text_styles": ["Грубиян"],
        }
        validated_text = validate_text_style(
            llm=llm,
            text=text,
            config=config,
        )
        print(validated_text)
