{
  "id": "FIREFLIES_1542168",
  "semantic_identifier": "1542168 - Yonderslate Legal - sales_pitch - Discussion with Violet Herrera",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-11-17 00:00:00",
  "metadata": {
    "meeting_date": "2025-11-17 00:00:00",
    "duration_min": "19"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-11"
      ],
      "year_month": "2025-11",
      "meeting_title": "1542168 - Yonderslate Legal - sales_pitch - Discussion with Violet Herrera",
      "organizer_email": "james_choi@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "James Choi: Hi Violet, this is James Choi—did I catch you with two minutes? I’ll be brief. I’m calling because we work with product and GTM teams to get really crisp on who their best customers are and then turn that into messaging that actually converts.",
      "link": "https://www.onyx.app/4509620-1"
    },
    {
      "text": "Violet Herrera: I’ve got a couple minutes, sure. What’s this in relation to?",
      "link": "https://www.onyx.app/4509620-2"
    },
    {
      "text": "James Choi: Totally. The product is called Customer_Analyzer. It connects the signals you already have—CRM fields, onboarding notes, usage, support tickets—and it outputs two things: a customer “fit score” by account and segment, and then positioning recommendations you can use in outbound and on landing pages.",
      "link": "https://www.onyx.app/4509620-3"
    },
    {
      "text": "Violet Herrera: We’re a law firm. We don’t really do “product usage events.” And we’re not selling software.",
      "link": "https://www.onyx.app/4509620-4"
    },
    {
      "text": "James Choi: That makes sense, and you’re not alone. When I say signals, I’m not assuming app telemetry. For a services org like Yonderslate Legal, it can be things like matter type, practice area, intake source, cycle time, revision rounds, support burden—basically what correlates to profitable, smooth engagements versus the ones that churn or drag.",
      "link": "https://www.onyx.app/4509620-5"
    },
    {
      "text": "Violet Herrera: Okay, but we already know which matters are profitable. That’s in our reporting.",
      "link": "https://www.onyx.app/4509620-6"
    },
    {
      "text": "James Choi: Right—and what we see is teams can report profitability, but it’s harder to translate that into a clear ICP and consistent messaging. The feature we lean on is fit estimation: it gives a 0–100 fit score at the account level and then breaks down *why*—industry, size, urgency, time-to-value, support burden, churn risk signals. Then you can compare segments, like “SMB vs mid-market,” and decide which tier you want to prioritize.",
      "link": "https://www.onyx.app/4509620-7"
    },
    {
      "text": "Violet Herrera: We don’t really segment like that. We’re more referral-driven, and marketing isn’t the main lever for us.",
      "link": "https://www.onyx.app/4509620-8"
    },
    {
      "text": "James Choi: Got it. The reason I mention SMB vs mid-market is one common use case: creating segment-specific landing page and outbound messaging for two ICP tiers. Even in a referral-driven model, your website and follow-up emails still do a lot of qualifying and framing—especially when referrals send people who aren’t a good fit.",
      "link": "https://www.onyx.app/4509620-9"
    },
    {
      "text": "Violet Herrera: Our website is pretty basic, and we’re not planning a big redo. Also, we’re slammed right now.",
      "link": "https://www.onyx.app/4509620-10"
    },
    {
      "text": "James Choi: Understood. The goal wouldn’t be a big website project. It could be as simple as: “Here’s what great-fit clients look like, here’s what we’re best at, here’s proof, and here are common objections handled.” Customer_Analyzer generates positioning recommendations off the segments that actually lead to clean delivery and repeat work.",
      "link": "https://www.onyx.app/4509620-11"
    },
    {
      "text": "Violet Herrera: I’m trying to connect this to an immediate need. We’re not struggling to get leads.",
      "link": "https://www.onyx.app/4509620-12"
    },
    {
      "text": "James Choi: That’s fair. Let me ask one quick question: do you ever have the issue where intake looks good, you onboard, and then it becomes high-maintenance—scope creep, lots of back-and-forth, slow decisions?",
      "link": "https://www.onyx.app/4509620-13"
    },
    {
      "text": "Violet Herrera: Sure, but that’s just part of the job. Some clients are like that.",
      "link": "https://www.onyx.app/4509620-14"
    },
    {
      "text": "James Choi: Exactly. What the fit score does is quantify the patterns behind that—so you can spot them early and adjust how you position or qualify. For example, if “decision speed” and “stakeholder complexity” are the biggest drivers of low-fit outcomes, you can build that into your intake questions and even the language on your practice pages.",
      "link": "https://www.onyx.app/4509620-15"
    },
    {
      "text": "Violet Herrera: We’d need IT involved for anything that touches our CRM. And honestly, we’re cautious about tools ingesting client-related info.",
      "link": "https://www.onyx.app/4509620-16"
    },
    {
      "text": "James Choi: Completely reasonable. On the data side, we can start with minimal fields—like a handful of CRM attributes and anonymized outcomes—without pulling sensitive matter content. But if involving IT is a hurdle right now, we can also do a lightweight pilot using exports.",
      "link": "https://www.onyx.app/4509620-17"
    },
    {
      "text": "Violet Herrera: Even a pilot takes time. I’m not the owner of CRM or marketing anyway. I help, but it’s not my lane.",
      "link": "https://www.onyx.app/4509620-18"
    },
    {
      "text": "James Choi: Thanks for being direct. Who typically owns decisions around intake process and how you describe your services online—marketing lead, operations, managing partner?",
      "link": "https://www.onyx.app/4509620-19"
    },
    {
      "text": "Violet Herrera: Operations and one of the partners. Marketing is a vendor.",
      "link": "https://www.onyx.app/4509620-20"
    },
    {
      "text": "James Choi: That helps. My ask was going to be a short follow-up—20 minutes—where I can show what the fit driver breakdown looks like and how it turns into segment messaging, like “SMB vs mid-market” service positioning. If you think it’s not relevant, I don’t want to waste your time—would it make sense for me to reach out to ops instead?",
      "link": "https://www.onyx.app/4509620-21"
    },
    {
      "text": "Violet Herrera: You can reach out, but I don’t want to set expectations. We’re in a freeze on new software until next quarter, and partners are not going to prioritize this.",
      "link": "https://www.onyx.app/4509620-22"
    },
    {
      "text": "James Choi: I appreciate that. Would it be okay if I sent a one-page summary tailored to a services firm—specifically how fit estimation helps reduce high-maintenance engagements and tighten qualification? Then you can forward it if it resonates.",
      "link": "https://www.onyx.app/4509620-23"
    },
    {
      "text": "Violet Herrera: You can send something, sure. But I can’t promise it’ll go anywhere.",
      "link": "https://www.onyx.app/4509620-24"
    },
    {
      "text": "James Choi: That’s totally fine. What’s the best email? And if you can, tell me the two most common “bad-fit” patterns you see—so I can make the summary concrete.",
      "link": "https://www.onyx.app/4509620-25"
    },
    {
      "text": "Violet Herrera: Send it to violet.herrera@yonderslate.com. Bad-fit patterns: clients who want fixed fees but constantly change scope, and clients with too many stakeholders who can’t make decisions.",
      "link": "https://www.onyx.app/4509620-26"
    },
    {
      "text": "James Choi: Perfect—that’s exactly the kind of thing our driver breakdown flags. I’ll send a short note with those examples and how teams translate them into qualification language and positioning. If it sparks interest, we can loop in ops next quarter when the freeze lifts.",
      "link": "https://www.onyx.app/4509620-27"
    },
    {
      "text": "Violet Herrera: Okay. Please keep it brief.",
      "link": "https://www.onyx.app/4509620-28"
    },
    {
      "text": "James Choi: Will do. Thanks for the time, Violet—appreciate it.",
      "link": "https://www.onyx.app/4509620-29"
    },
    {
      "text": "Violet Herrera: You’re welcome. Bye.",
      "link": "https://www.onyx.app/4509620-30"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "james_choi@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "violet_herrera@yonderslate_legal.onyx.app"
    }
  ]
}