{
  "id": "FIREFLIES_1638347",
  "semantic_identifier": "1638347 - Vertexhollow Design - sales_call - Discussion with Henry Willis",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-11-22 00:00:00",
  "metadata": {
    "meeting_date": "2025-11-22 00:00:00",
    "duration_min": "31"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-11"
      ],
      "year_month": "2025-11",
      "meeting_title": "1638347 - Vertexhollow Design - sales_call - Discussion with Henry Willis",
      "organizer_email": "camila_vega@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Camila Vega: Hi Henry—good to see you again. Last time you mentioned you were feeling the pain of repeat issues coming in through Zendesk and Intercom, and it was hard to explain “what’s actually the top thing to fix” across Support, Product, and Sales. I wanted to focus today on Issue_Tracker, specifically how we dedupe into clusters and then prioritize those clusters with an explainable score tied to revenue and deal risk. Does that still map to what you’re trying to solve at Vertexhollow Design?",
      "link": "https://www.onyx.app/8750619-1"
    },
    {
      "text": "Henry Willis: Yeah, broadly. The volume is growing, and we keep having the same conversations across teams. But we’re also wary of adding another layer that becomes yet another system of record.",
      "link": "https://www.onyx.app/8750619-2"
    },
    {
      "text": "Camila Vega: Totally fair. We’re not trying to replace Zendesk or Jira. Issue_Tracker sits between them—pulls in tickets and conversations, groups them into “issue objects” (theme + evidence + impacted customers), and keeps the links back to source tickets and forward to Jira work. The goal is: when someone asks “why is this priority #1,” you can point to frequency, severity tags, and business impact—like ARR exposure or late-stage deal blockers.  \nIf you think about a recent example: what was the last “fire drill” issue that came up and got debated?",
      "link": "https://www.onyx.app/8750619-3"
    },
    {
      "text": "Henry Willis: We had a permissions bug that hit a few enterprise accounts. Support escalated, Product said it’s not common, Sales said it’s blocking renewals. We spent two weeks arguing what the real blast radius was.",
      "link": "https://www.onyx.app/8750619-4"
    },
    {
      "text": "Camila Vega: That’s exactly the kind of situation Issue_Tracker is built for. On the prioritization side, it ranks clusters using configurable inputs—frequency/velocity, severity, customer tier/ARR, churn risk flags, and segment importance. And because it connects to CRM and Sales_Accelerator, if you have a late-stage opportunity or renewal tied to that cluster, it can boost the priority with an explanation like “3 open enterprise renewals at risk; $420K exposure.”  \nHow are you currently measuring blast radius—manual spreadsheet, tags in Zendesk, CRM notes?",
      "link": "https://www.onyx.app/8750619-5"
    },
    {
      "text": "Henry Willis: It’s mostly manual. Support tags tickets, but they’re inconsistent. Then CSMs maintain their own notes and the Product team looks at Jira counts. Nothing ties cleanly to account health in our CRM.",
      "link": "https://www.onyx.app/8750619-6"
    },
    {
      "text": "Camila Vega: Got it. Two quick workflows I wanted to highlight.  \nFirst: the prioritization views. Support can look at SLA risk; Product can look at impact; Sales can look at deal blockers. Same underlying cluster, different lens.  \nSecond: the CSM follow-up use case. A CSM can subscribe an account to a cluster. When the linked Jira ticket ships, Issue_Tracker records the release milestone and logs a history trail of which customers were notified and when—so you’re not guessing who got the update or losing the thread when a CSM is out.",
      "link": "https://www.onyx.app/8750619-7"
    },
    {
      "text": "Henry Willis: That follow-up automation is attractive. We miss notifications sometimes. But I’m concerned about the integration side. We’ve got multiple contacts per account, some duplicates, and custom CRM fields that don’t always get filled. If Issue_Tracker calculates impact based on messy mappings, the prioritization could be wrong—and then we’re arguing about the tool instead of the issue.",
      "link": "https://www.onyx.app/8750619-8"
    },
    {
      "text": "Camila Vega: That’s a valid concern, and it’s one we’ve seen. The key is identity resolution—matching ticket submitters and contacts to the right account, and mapping the CRM fields you care about (ARR, segment, lifecycle stage). We typically start with a lightweight mapping, then tighten it with rules—like domain matching, contact-to-account precedence, and handling duplicates.  \nLet me ask: what CRM are you on, and how messy is the account model? Do you have parent/child accounts, multiple brands, that sort of thing?",
      "link": "https://www.onyx.app/8750619-9"
    },
    {
      "text": "Henry Willis: Salesforce. We do have parent/child and some accounts share domains. We also use custom fields for segment and “design partner” status. And our Support org doesn’t always enforce account association on tickets.",
      "link": "https://www.onyx.app/8750619-10"
    },
    {
      "text": "Camila Vega: Understood. In that environment, we’d want to be careful about how we compute “revenue exposure.” We can start by scoping impact calculations to the accounts that are confidently matched—so you’re not overcounting. And we can show “confidence” on the match so teams know when the score is based on solid data versus partial data.  \nWould it help if we scoped the initial rollout to a subset—say enterprise accounts only, or a segment where the mappings are cleaner?",
      "link": "https://www.onyx.app/8750619-11"
    },
    {
      "text": "Henry Willis: Maybe, but we’re not in a position to run a big integration project. Our RevOps team is swamped, and Product Ops is basically one person. If this takes weeks of field mapping and cleanup, it’s not happening this quarter.",
      "link": "https://www.onyx.app/8750619-12"
    },
    {
      "text": "Camila Vega: That makes sense. The lowest-lift path is usually: connect Zendesk + Jira first, get clustering and dedupe working, then add CRM weighting for ARR and pipeline risk. But the prioritization is strongest when CRM is connected.  \nCan I pressure-test the timeline—are you trying to solve this before a specific renewal cycle or planning window?",
      "link": "https://www.onyx.app/8750619-13"
    },
    {
      "text": "Henry Willis: Q2 planning is coming up fast. Honestly, we need something we can stand up quickly, or we’ll stick with what we have.",
      "link": "https://www.onyx.app/8750619-14"
    },
    {
      "text": "Camila Vega: If speed is the priority, we can still deliver value with the clustering and a basic priority score based on frequency, velocity, and severity tags. Then later layer in CRM-based revenue weighting.  \nBut it sounds like the risk for you is: if we can’t trust the account matching, you won’t trust the score. Is that the main blocker?",
      "link": "https://www.onyx.app/8750619-15"
    },
    {
      "text": "Henry Willis: Yeah. And also: we already have Jira dashboards and a productboard workflow. I’m worried Issue_Tracker becomes another place people have to check. Adoption is a real problem here.",
      "link": "https://www.onyx.app/8750619-16"
    },
    {
      "text": "Camila Vega: Totally. The intent is not “another dashboard,” but a standardized issue object that stays linked everywhere. For example, when a cluster is created, it can generate or link to a Jira ticket, and updates flow back. Support can keep working in Zendesk; Product stays in Jira; CSMs get a single source of truth for what’s happening and who’s impacted.  \nBut—if your team is already struggling with adoption, we’d need to be crisp about the one or two workflows you’d enforce. Which team would actually own Issue_Tracker internally—Support Ops, Product Ops, or CS leadership?",
      "link": "https://www.onyx.app/8750619-17"
    },
    {
      "text": "Henry Willis: That’s part of the problem. No one wants to own another tool. Support would say Product should, Product would say Support should. And our CS leadership is focused on renewals, not tooling.",
      "link": "https://www.onyx.app/8750619-18"
    },
    {
      "text": "Camila Vega: That’s helpful context. If there isn’t a clear owner, implementation can stall.  \nLet me propose a narrow pilot: pick, say, 20 strategic accounts, subscribe them to top clusters, and use the “release milestone + notification history” to prove the CSM follow-up value. That doesn’t require perfect CRM weighting on day one. Would you have bandwidth to run something like that with one CSM manager and one support lead?",
      "link": "https://www.onyx.app/8750619-19"
    },
    {
      "text": "Henry Willis: In theory, but even that requires someone to set it up and maintain it. And if we don’t connect the CRM properly, we can’t reliably know which accounts are impacted, which undermines the follow-up use case too.",
      "link": "https://www.onyx.app/8750619-20"
    },
    {
      "text": "Camila Vega: Fair point—if tickets aren’t consistently associated to accounts, subscriptions won’t be reliable.  \nDo you have any enforced process today for linking support tickets to accounts? Even a “must select organization” rule in Zendesk?",
      "link": "https://www.onyx.app/8750619-21"
    },
    {
      "text": "Henry Willis: Not consistently. Some tickets come in via email and don’t map. And we have shared inboxes that muddy it further.",
      "link": "https://www.onyx.app/8750619-22"
    },
    {
      "text": "Camila Vega: Okay. Given that, I don’t want to oversell a magic fix. Issue_Tracker can help standardize and expose the gaps—like showing a cluster with a high volume of “unmatched” tickets—but it can’t fully correct missing data without some workflow changes.  \nIf we were to move forward, I’d want to align on a small set of required inputs—like enforcing organization selection in Zendesk and agreeing on a single source of truth for ARR. Is that something you could realistically change soon?",
      "link": "https://www.onyx.app/8750619-23"
    },
    {
      "text": "Henry Willis: Not soon. We’re mid-reorg and changing support workflows right now would be hard. I like the concept, but the prerequisites aren’t there.",
      "link": "https://www.onyx.app/8750619-24"
    },
    {
      "text": "Camila Vega: I appreciate the candor. It sounds like the value is clear, but timing and data hygiene are the constraints—especially identity resolution and consistent ticket-to-account matching.  \nWould it be more helpful if I sent over a short readiness checklist—what needs to be true in Zendesk/Salesforce for the prioritization and CSM follow-up to work—so you can gauge when Vertexhollow is in a better spot?",
      "link": "https://www.onyx.app/8750619-25"
    },
    {
      "text": "Henry Willis: Yeah, that would be useful. And maybe a rough estimate of effort on the integration mapping, so I can talk to RevOps about it for later.",
      "link": "https://www.onyx.app/8750619-26"
    },
    {
      "text": "Camila Vega: Absolutely. I’ll send a checklist plus two implementation paths: “support + Jira only” for quick clustering, and “full revenue-weighted prioritization” with Salesforce mapping, including where identity resolution tends to get tricky with parent/child accounts and shared domains.  \nBefore we wrap: should we park the buying conversation for now and revisit after Q2 planning, or do you want to keep evaluating in parallel?",
      "link": "https://www.onyx.app/8750619-27"
    },
    {
      "text": "Henry Willis: Let’s park it. If we can’t implement this quarter, I don’t want to drag procurement into it. Circle back in a couple months.",
      "link": "https://www.onyx.app/8750619-28"
    },
    {
      "text": "Camila Vega: Sounds good. I’ll send the materials today, and I’ll set a tentative follow-up for eight weeks from now—easy to move if needed. Thanks, Henry.",
      "link": "https://www.onyx.app/8750619-29"
    },
    {
      "text": "Henry Willis: Thanks, Camila.",
      "link": "https://www.onyx.app/8750619-30"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "camila_vega@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "henry_willis@vertexhollow_design.onyx.app"
    }
  ]
}