{
  "id": "FIREFLIES_1880525",
  "semantic_identifier": "1880525 - Pebble & Pine Coffee - buy - Discussion with Allison Peterson",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-11-02 00:00:00",
  "metadata": {
    "meeting_date": "2025-11-02 00:00:00",
    "duration_min": "34"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-11"
      ],
      "year_month": "2025-11",
      "meeting_title": "1880525 - Pebble & Pine Coffee - buy - Discussion with Allison Peterson",
      "organizer_email": "megan_foster@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Megan Foster: Hi Allison—good to see you again. Since this is our third call, I wanted to keep it tight and aim for a decision today. Does that still work for you?",
      "link": "https://www.onyx.app/6863399-1"
    },
    {
      "text": "Allison Peterson: Yes, that works. I’ve got about thirty minutes, but I’m hoping we can wrap this up if we’re aligned.",
      "link": "https://www.onyx.app/6863399-2"
    },
    {
      "text": "Megan Foster: Perfect. Last time you said two things mattered most for Pebble & Pine: more reliable forecasting without chasing reps, and making sure AEs consistently run clean follow-ups after discovery so deals don’t stall. I’d like to focus on two parts of Sales_Accelerator that map directly to that: the sales_forecast and the post-discovery follow-up recommendations. Sound right?",
      "link": "https://www.onyx.app/6863399-3"
    },
    {
      "text": "Allison Peterson: Yes—forecasting is the big one. The follow-up part is also interesting because we’re inconsistent there.",
      "link": "https://www.onyx.app/6863399-4"
    },
    {
      "text": "Megan Foster: Great. On forecasting: Sales_Accelerator sits on top of your CRM—so you keep Salesforce as the system of record—but we add an execution layer that uses more than just stage. We combine stage data with activity signals—emails, calls, meetings—plus cycle-time benchmarks. If you want, we also weight the forecast using your Customer_Analyzer fit score, so ICP deals don’t get treated the same as non-ICP deals.",
      "link": "https://www.onyx.app/6863399-5"
    },
    {
      "text": "Allison Peterson: That weighting is appealing. Right now we basically have “gut feel” and stage, and it’s… not great at end of month.",
      "link": "https://www.onyx.app/6863399-6"
    },
    {
      "text": "Megan Foster: Exactly. The output is the views you’re used to—commit, best-case, pipeline—but what’s different is it’s explainable. So when your VP asks, “Why did commit drop?” you can see drivers like: stage age is beyond benchmark, no meeting scheduled, last touch was 12 days ago, or it’s a lower fit tier with historically lower win rates. That’s usually where teams get forecast accuracy and fewer end-of-quarter surprises.",
      "link": "https://www.onyx.app/6863399-7"
    },
    {
      "text": "Allison Peterson: How does it avoid being a black box? My team will push back if it feels like a magic number.",
      "link": "https://www.onyx.app/6863399-8"
    },
    {
      "text": "Megan Foster: Totally fair—and that’s why we built the drivers panel. For any opportunity, it literally shows the factors impacting the forecast. For example: “Next meeting scheduled” is a positive driver; “stage age above benchmark” is a negative driver. And at the pipeline level you can slice by segment, rep, and source and see stage conversion and slippage diagnostics—like which stages are leaking and which reps are consistently slipping from commit to best-case.",
      "link": "https://www.onyx.app/6863399-9"
    },
    {
      "text": "Allison Peterson: Okay. That would help my weekly forecast call. Right now I’m asking everyone the same questions every Monday.",
      "link": "https://www.onyx.app/6863399-10"
    },
    {
      "text": "Megan Foster: Right—and we’re trying to replace that with, “Here are the five deals most at risk and why.” Which leads into the second piece: best-next-action guidance after discovery. You mentioned AEs do discovery, then the follow-up email quality varies and mutual action plans are inconsistent.",
      "link": "https://www.onyx.app/6863399-11"
    },
    {
      "text": "Allison Peterson: Yeah. Some reps send a great recap with next steps. Others send a two-liner, and then the deal goes quiet.",
      "link": "https://www.onyx.app/6863399-12"
    },
    {
      "text": "Megan Foster: Sales_Accelerator gives your AE a guided follow-up sequence right after discovery: it drafts a recap email, suggests two tailored proof points from your approved positioning library, and then creates a mutual action plan with due dates and stakeholders—so you’re multi-threading early instead of hoping procurement magically appears later.",
      "link": "https://www.onyx.app/6863399-13"
    },
    {
      "text": "Allison Peterson: The mutual action plan is interesting. We’ve tried to get reps to do that manually, but it’s hit-or-miss.",
      "link": "https://www.onyx.app/6863399-14"
    },
    {
      "text": "Megan Foster: Exactly. We’re not trying to “police” reps—we’re making the right behavior the path of least resistance. And because we integrate with Customer_Analyzer, those proof points and messaging pulls from the positioning blocks you’ve already built, instead of inventing new content inside Sales_Accelerator.",
      "link": "https://www.onyx.app/6863399-15"
    },
    {
      "text": "Allison Peterson: Let me ask about a concern I had reading the notes you sent—recommendations getting generic. That would kill adoption fast.",
      "link": "https://www.onyx.app/6863399-16"
    },
    {
      "text": "Megan Foster: You’re spot on. There are two known failure modes: if the Customer_Analyzer positioning blocks aren’t kept current, or if the segment mapping between systems is inconsistent. We handle that in two ways. First, during implementation we confirm the segment taxonomy and map it cleanly between Customer_Analyzer and Salesforce so the right blocks trigger for the right accounts. Second, we set a lightweight monthly check—usually 30 minutes with whoever owns messaging—to review whether any positioning blocks need refreshing based on what’s working in-market.",
      "link": "https://www.onyx.app/6863399-17"
    },
    {
      "text": "Allison Peterson: That seems reasonable. We can do the segment mapping work up front. I just don’t want another tool that reps ignore.",
      "link": "https://www.onyx.app/6863399-18"
    },
    {
      "text": "Megan Foster: Same goal. Adoption usually comes when reps feel it saves them time and helps them win. The recap email + proof points + mutual action plan tends to be an immediate “oh, this is helpful,” and the forecast side helps leadership, which keeps it funded and supported.",
      "link": "https://www.onyx.app/6863399-19"
    },
    {
      "text": "Allison Peterson: So, practically, what would we be buying—licenses, implementation, timeline?",
      "link": "https://www.onyx.app/6863399-20"
    },
    {
      "text": "Megan Foster: For Pebble & Pine, given your team size we scoped 15 seats—SDRs and AEs—plus manager access for forecasting views. Implementation is two weeks: week one is Salesforce connection, activity signal integration, and segment mapping to Customer_Analyzer; week two is configuring cycle-time benchmarks and rolling out the AE post-discovery workflow. You’ll have a sandbox run so you can validate outputs before we turn it on for the whole team.",
      "link": "https://www.onyx.app/6863399-21"
    },
    {
      "text": "Allison Peterson: And the forecast accuracy—how quickly do we see improvement? We have a board update in six weeks.",
      "link": "https://www.onyx.app/6863399-22"
    },
    {
      "text": "Megan Foster: You’ll see directional improvement within the first 2–3 weeks because we start using stage + activity signals immediately. The longer-term accuracy improves as it learns your cycle-time benchmarks and historical conversion patterns—so by week six you should have a materially more defensible commit/best-case view, plus an at-risk list with clear reasons.",
      "link": "https://www.onyx.app/6863399-23"
    },
    {
      "text": "Allison Peterson: Okay. Pricing-wise, we’re close, but I need to make sure it fits this quarter’s budget. Can you remind me of the number you sent?",
      "link": "https://www.onyx.app/6863399-24"
    },
    {
      "text": "Megan Foster: Yes—$24K annually for the 15-seat package, billed annually, and implementation is included. That also includes the integration with Customer_Analyzer so we can use fit tiers and positioning blocks in the recommendations.",
      "link": "https://www.onyx.app/6863399-25"
    },
    {
      "text": "Allison Peterson: That’s within the range I expected. If we move forward, I’ll need procurement to review the terms, but I can sponsor it.",
      "link": "https://www.onyx.app/6863399-26"
    },
    {
      "text": "Megan Foster: Great. What would you need from me to feel comfortable saying “yes” today—assuming procurement is the process step, not a decision blocker?",
      "link": "https://www.onyx.app/6863399-27"
    },
    {
      "text": "Allison Peterson: I want two things: confirmation we’re not duplicating CRM work, and clarity on how we’ll prevent the generic recommendations problem.",
      "link": "https://www.onyx.app/6863399-28"
    },
    {
      "text": "Megan Foster: On CRM: we don’t replace Salesforce, and we don’t ask reps to re-enter data. We read CRM stages and opportunity fields, then layer on activity signals and guidance. Reps stay in their normal workflow, with Sales_Accelerator prompting next steps and generating the follow-up assets. On generic recommendations: we’ll do segment mapping during implementation, and we’ll align on who owns positioning blocks in Customer_Analyzer. I’ll also include in the SOW a monthly 30-minute “positioning health” check for the first three months so it doesn’t get neglected.",
      "link": "https://www.onyx.app/6863399-29"
    },
    {
      "text": "Allison Peterson: If that’s in writing, that addresses it for me.",
      "link": "https://www.onyx.app/6863399-30"
    },
    {
      "text": "Megan Foster: I can do that. So are you comfortable moving forward with the 15-seat annual agreement at $24K, with implementation included, starting next Monday?",
      "link": "https://www.onyx.app/6863399-31"
    },
    {
      "text": "Allison Peterson: Yes. Send the order form and the SOW with the segment mapping and the monthly checks called out. I’ll sign, then route to procurement.",
      "link": "https://www.onyx.app/6863399-32"
    },
    {
      "text": "Megan Foster: Done. I’ll send it right after this call. To keep momentum, can we also put 20 minutes on the calendar for early next week—just you and me—to confirm the segment taxonomy and who owns the Customer_Analyzer positioning blocks?",
      "link": "https://www.onyx.app/6863399-33"
    },
    {
      "text": "Allison Peterson: Yes, let’s do that. Tuesday morning works.",
      "link": "https://www.onyx.app/6863399-34"
    },
    {
      "text": "Megan Foster: Perfect—Tuesday at 10am. Last thing: once you sign, do you want us to do a short enablement for AEs focused only on the post-discovery follow-up flow, so it’s immediately useful?",
      "link": "https://www.onyx.app/6863399-35"
    },
    {
      "text": "Allison Peterson: Yes, that would help adoption. Keep it practical—show them the recap email and action plan, not a big theory session.",
      "link": "https://www.onyx.app/6863399-36"
    },
    {
      "text": "Megan Foster: Love it. I’ll include a 45-minute “after discovery” workshop as part of rollout. I’ll send docs today, and once you sign we’ll kick off. Anything else you want to cover before we wrap?",
      "link": "https://www.onyx.app/6863399-37"
    },
    {
      "text": "Allison Peterson: No, I think we’re good. Send the paperwork and I’ll get it moving.",
      "link": "https://www.onyx.app/6863399-38"
    },
    {
      "text": "Megan Foster: Will do. Thanks, Allison—excited to get Sales_Accelerator live for Pebble & Pine.",
      "link": "https://www.onyx.app/6863399-39"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "megan_foster@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "allison_peterson@pebble_&_pine_coffee.onyx.app"
    }
  ]
}