{
  "id": "FIREFLIES_2727225",
  "semantic_identifier": "2727225 - Yellowfinch Foods - sales_pitch - Discussion with Jeremy Medina",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-11-13 00:00:00",
  "metadata": {
    "meeting_date": "2025-11-13 00:00:00",
    "duration_min": "17"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-11"
      ],
      "year_month": "2025-11",
      "meeting_title": "2727225 - Yellowfinch Foods - sales_pitch - Discussion with Jeremy Medina",
      "organizer_email": "mina_park@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Mina Park: Hi Jeremy—Mina Park here. Thanks for taking a few minutes. I’ll be brief. I work with teams that are drowning in support tickets and struggling to turn that noise into clear, prioritized product issues without a ton of manual work. Does that sound even remotely familiar at Yellowfinch Foods?",
      "link": "https://www.onyx.app/7238708-1"
    },
    {
      "text": "Jeremy Medina: Hey Mina. Yeah, we get a lot of tickets, but I’m only loosely involved. I’ve got a hard stop in a few minutes—what’s this about?",
      "link": "https://www.onyx.app/7238708-2"
    },
    {
      "text": "Mina Park: Totally understood. The product is called Issue_Tracker. It sits between your support tools—like Zendesk or Intercom—and delivery tools like Jira or Linear, and it creates a standardized “issue object” out of raw tickets: deduplicated clusters, evidence, impacted customers, and links back to the source conversations and the engineering work. The quick pitch is: less noise, clearer themes, and better prioritization tied to business impact.",
      "link": "https://www.onyx.app/7238708-3"
    },
    {
      "text": "Jeremy Medina: We already use Zendesk and Jira. We also have our own tagging and some dashboards. Not sure we need another layer.",
      "link": "https://www.onyx.app/7238708-4"
    },
    {
      "text": "Mina Park: That’s fair—and we’re not trying to replace Zendesk or Jira. The value is in the connective tissue: we ingest tickets from Zendesk/Intercom/Help Scout, apply dedupe rules so duplicates merge into one cluster, and then sync context from Salesforce or HubSpot—like account value or open opportunities—so the issues are prioritized by revenue exposure or deal risk, not just volume. Then we back-link everything so your team can click from a cluster to the original Zendesk tickets or the Jira epics.",
      "link": "https://www.onyx.app/7238708-5"
    },
    {
      "text": "Jeremy Medina: Okay, but we can kind of do that manually. Our support ops manager pulls themes every week and sends a list to product. It’s not perfect, but it works.",
      "link": "https://www.onyx.app/7238708-6"
    },
    {
      "text": "Mina Park: That weekly theme pull is exactly the workflow we’re designed for. One of the common use cases is support ops taking something like 5,000 monthly tickets and clustering them into ~80 active themes automatically—then routing the top 10 clusters to product/engineering weekly with representative examples and the list of affected customers. It cuts the time spent arguing about “is this really a theme” and reduces duplicate work.",
      "link": "https://www.onyx.app/7238708-7"
    },
    {
      "text": "Jeremy Medina: I get the idea. But I’m cautious. Any new tool means admin, setup, change management. Also, we’re pretty locked into our current processes.",
      "link": "https://www.onyx.app/7238708-8"
    },
    {
      "text": "Mina Park: Makes sense. Setup is mostly connectors and field mapping—point at Zendesk, connect Jira, and optionally Salesforce/HubSpot if you want account context. You can define your dedupe rules—like subject similarity, product area, tag combinations—and we keep your existing systems as the source of truth. No one has to re-enter data; we’re just organizing and linking it.",
      "link": "https://www.onyx.app/7238708-9"
    },
    {
      "text": "Jeremy Medina: The Salesforce angle is interesting, but we’re not big on piping support data into CRM. Data governance gets messy fast.",
      "link": "https://www.onyx.app/7238708-10"
    },
    {
      "text": "Mina Park: Totally—so we don’t push raw ticket content into CRM by default. The integration can be one-way: we pull account and opportunity metadata to score impact. For example, if a cluster affects high-ARR accounts or a deal in negotiation, it bubbles up. The point is to stop the “we didn’t realize this bug was blocking a renewal” surprise.",
      "link": "https://www.onyx.app/7238708-11"
    },
    {
      "text": "Jeremy Medina: Sure, but we already have internal escalation paths. If something is truly critical, it gets attention.",
      "link": "https://www.onyx.app/7238708-12"
    },
    {
      "text": "Mina Park: Right—and Issue_Tracker is most helpful in the gray area: the issues that aren’t a single P0 ticket, but are quietly hitting lots of customers, creating churn risk, or slowing expansion. Clustering makes those patterns obvious. And because every cluster links back to the original tickets, it’s defensible—you’re not relying on someone’s summary in a spreadsheet.",
      "link": "https://www.onyx.app/7238708-13"
    },
    {
      "text": "Jeremy Medina: Who typically owns this? Support? Product ops? Because if it’s “between teams,” it often becomes nobody’s job.",
      "link": "https://www.onyx.app/7238708-14"
    },
    {
      "text": "Mina Park: Great question. Usually support ops or product ops owns the workflows—support ops likes it because it reduces ticket noise and repetitive triage. Product teams like it because they get a consistent issue format, evidence, and impacted customer lists instead of a grab bag of anecdotes. But yes, it needs a clear owner.",
      "link": "https://www.onyx.app/7238708-15"
    },
    {
      "text": "Jeremy Medina: We don’t really have product ops. Support ops exists, but they’re stretched. I’m not sure they want to add more tooling.",
      "link": "https://www.onyx.app/7238708-16"
    },
    {
      "text": "Mina Park: That’s fair. If you’re open to it, the next step would be a 30-minute call with whoever runs support ops and maybe someone from product, and we can map your current flow: Zendesk tags → weekly review → Jira creation. Then I can show how clustering and back-links would reduce the manual work rather than add to it.",
      "link": "https://www.onyx.app/7238708-17"
    },
    {
      "text": "Jeremy Medina: I’m probably not the right person to pull that together. And to be honest, we’re in the middle of other projects—tool consolidation, cost controls. New spend is going to be a tough sell.",
      "link": "https://www.onyx.app/7238708-18"
    },
    {
      "text": "Mina Park: Understood. One way some teams justify it is by reducing the time spent on triage and duplicate ticket handling—plus fewer escalations driven by missed patterns. But if budget is frozen, it may not be the right moment.",
      "link": "https://www.onyx.app/7238708-19"
    },
    {
      "text": "Jeremy Medina: Yeah, and we’ve also got a pretty specific workflow in Jira. I worry this becomes another place to check status.",
      "link": "https://www.onyx.app/7238708-20"
    },
    {
      "text": "Mina Park: We try to avoid that by syncing delivery tracking to Jira/Linear/GitHub and keeping the back-links, so Jira remains the system of record for engineering. Issue_Tracker is more the intelligence layer: “what are the real themes and who’s impacted,” not “where do devs work.”",
      "link": "https://www.onyx.app/7238708-21"
    },
    {
      "text": "Jeremy Medina: I hear you. But practically, I don’t have the bandwidth to sponsor this, and I’m not convinced the problem is painful enough right now.",
      "link": "https://www.onyx.app/7238708-22"
    },
    {
      "text": "Mina Park: That’s completely fair, Jeremy. If I can ask one quick question before you go: roughly how many support tickets do you see in a month—are we talking hundreds, thousands?",
      "link": "https://www.onyx.app/7238708-23"
    },
    {
      "text": "Jeremy Medina: Thousands, but again—support handles it. We get involved only when something escalates.",
      "link": "https://www.onyx.app/7238708-24"
    },
    {
      "text": "Mina Park: Got it. Given that volume, it might still be worth a quick intro to your support ops lead, but I don’t want to create work for you. If you can point me to the right owner—name or role—I can reach out directly with a concise note and you don’t have to coordinate.",
      "link": "https://www.onyx.app/7238708-25"
    },
    {
      "text": "Jeremy Medina: I’d rather not do intros right now. We’re trying to limit vendor conversations this quarter.",
      "link": "https://www.onyx.app/7238708-26"
    },
    {
      "text": "Mina Park: Understood. Would it be okay if I sent you a one-page overview that you can forward if priorities change? Specifically focused on the clustering use case—5,000 tickets down to ~80 themes—and the integrations piece with Zendesk and Jira.",
      "link": "https://www.onyx.app/7238708-27"
    },
    {
      "text": "Jeremy Medina: You can send it, but I can’t promise I’ll look at it soon.",
      "link": "https://www.onyx.app/7238708-28"
    },
    {
      "text": "Mina Park: That’s fair. What’s the best email for you—still jeremy.medina@yellowfinchfoods.com?",
      "link": "https://www.onyx.app/7238708-29"
    },
    {
      "text": "Jeremy Medina: Yes, that’s right.",
      "link": "https://www.onyx.app/7238708-30"
    },
    {
      "text": "Mina Park: Perfect. I’ll keep it short, and I’ll include a couple screenshots of what a clustered theme looks like—evidence, impacted customers, and the links back to Zendesk and Jira. If it becomes a priority later, we can revisit. Thanks again for the time, Jeremy.",
      "link": "https://www.onyx.app/7238708-31"
    },
    {
      "text": "Jeremy Medina: Okay. Thanks, Mina. I’ve got to jump.",
      "link": "https://www.onyx.app/7238708-32"
    },
    {
      "text": "Mina Park: Of course. Have a good one—bye.",
      "link": "https://www.onyx.app/7238708-33"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mina_park@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "jeremy_medina@yellowfinch_foods.onyx.app"
    }
  ]
}