{
  "id": "FIREFLIES_3010412",
  "semantic_identifier": "3010412 - Orchidpointe Hospitality - sales_pitch - Discussion with Jace Matthews",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-11-21 00:00:00",
  "metadata": {
    "meeting_date": "2025-11-21 00:00:00",
    "duration_min": "27"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-11"
      ],
      "year_month": "2025-11",
      "meeting_title": "3010412 - Orchidpointe Hospitality - sales_pitch - Discussion with Jace Matthews",
      "organizer_email": "camila_vega@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Camila Vega: Hi Jace—Camila Vega here. Thanks for taking a few minutes. I’ll be brief: I work with teams that are trying to get sharper on which customer segments are actually their best fit and how to message to win more of them. Is now still okay?",
      "link": "https://www.onyx.app/2680179-1"
    },
    {
      "text": "Jace Matthews: Yeah, I’ve got a few minutes. What’s this about?",
      "link": "https://www.onyx.app/2680179-2"
    },
    {
      "text": "Camila Vega: Great. So the product is Customer_Analyzer. It pulls in the customer signals you already have—CRM fields, onboarding notes, usage events, support tickets—and it outputs two things: a fit score by account or segment, and practical positioning recommendations you can hand to marketing and sales. The reason I reached out is I saw Orchidpointe Hospitality is likely juggling which industries or property types to focus on next quarter, and it’s easy to over-index on revenue while missing retention or support burden. Does that sound familiar?",
      "link": "https://www.onyx.app/2680179-3"
    },
    {
      "text": "Jace Matthews: Sort of. We definitely look at retention. Support burden too, but it’s not super formal.",
      "link": "https://www.onyx.app/2680179-4"
    },
    {
      "text": "Camila Vega: That’s exactly where we help. The fit_estimation piece computes a 0–100 fit score for accounts and for segments—say “boutique hotels vs multi-property groups,” or “SMB vs mid-market”—and it breaks down why the score is high or low. So instead of a gut feel like “this segment seems good,” you see drivers like: time-to-value, adoption patterns, churn risk signals, and support load, side by side with retention and expansion outcomes.",
      "link": "https://www.onyx.app/2680179-5"
    },
    {
      "text": "Jace Matthews: Okay. We already have some dashboards in our BI tool. How is this different from that?",
      "link": "https://www.onyx.app/2680179-6"
    },
    {
      "text": "Camila Vega: Fair question. BI typically tells you what happened; Customer_Analyzer is specifically built to connect those outcomes to a repeatable “fit model” your teams can actually use for go-to-market decisions. Two key differences: first, the driver breakdown—what factors correlate to retention, expansion, lower support. Second, the segment comparison and recommended ICP profile it generates based on observed outcomes, so you can say, “Here are the top 2 segments to prioritize next quarter,” with evidence behind it.",
      "link": "https://www.onyx.app/2680179-7"
    },
    {
      "text": "Jace Matthews: We’re not really looking to add another tool right now. Budget’s tight.",
      "link": "https://www.onyx.app/2680179-8"
    },
    {
      "text": "Camila Vega: Totally understand. I’m not trying to force a tool into your stack. Let me make it concrete with one use case: prioritizing which industries to target next quarter using retention and support burden signals. If today you’re debating, for example, “Do we lean into resorts, business hotels, or extended-stay,” we can ingest your retention and ticketing data and show which segment has the best combination of: high renewal likelihood, lower support burden, and faster adoption. That typically informs both marketing targeting and sales qualification.",
      "link": "https://www.onyx.app/2680179-9"
    },
    {
      "text": "Jace Matthews: We don’t really segment that way. And our data’s messy. Support tickets aren’t consistently tagged.",
      "link": "https://www.onyx.app/2680179-10"
    },
    {
      "text": "Camila Vega: That’s common. We don’t require perfect tagging to start; we can begin with what you do have—firmographics, deal stage data, renewal outcomes—and then progressively add support signals. Even basic things like ticket volume per account, time-to-resolution, or number of escalations can be used as “support burden” proxies if tagging isn’t reliable.",
      "link": "https://www.onyx.app/2680179-11"
    },
    {
      "text": "Jace Matthews: Maybe. But we’re mid-quarter and already set on our priorities. I don’t know if this is urgent.",
      "link": "https://www.onyx.app/2680179-12"
    },
    {
      "text": "Camila Vega: Makes sense. If priorities are locked, this might be more of a next-quarter planning tool. The other quick win is sales alignment: the fit score can sit alongside your CRM so reps know which accounts resemble your best customers and why. That reduces time spent on low-fit deals and can tighten your ICP.",
      "link": "https://www.onyx.app/2680179-13"
    },
    {
      "text": "Jace Matthews: Our sales team already has qualification criteria. And honestly, we’ve tried “ICP exercises” before. They turn into debates.",
      "link": "https://www.onyx.app/2680179-14"
    },
    {
      "text": "Camila Vega: I hear you—ICP conversations get political fast. The angle here is we anchor it in observed outcomes rather than opinions. The output isn’t “here’s a persona slide”; it’s “here’s the segment that retains 20% better and generates 30% fewer tickets, and here are the drivers.” That tends to reduce debate because the data does the arguing.",
      "link": "https://www.onyx.app/2680179-15"
    },
    {
      "text": "Jace Matthews: Data only helps if it’s clean and if someone owns it. We don’t have bandwidth for a big implementation.",
      "link": "https://www.onyx.app/2680179-16"
    },
    {
      "text": "Camila Vega: Understood. Implementation-wise, we typically start lightweight: connect CRM, import a sample of support ticket metadata, and a small set of usage events if available. Then we run an initial fit model and review segment comparisons. That first pass is meant to be fast—more diagnostic than “big implementation.”",
      "link": "https://www.onyx.app/2680179-17"
    },
    {
      "text": "Jace Matthews: Who would even use this on our side? Marketing? Sales ops? Product?",
      "link": "https://www.onyx.app/2680179-18"
    },
    {
      "text": "Camila Vega: Usually it’s a small trio—RevOps or Sales Ops for the data connections, Marketing for targeting and messaging, and sometimes Product for adoption insights. But it can be owned by one person if needed. The output is simple enough for exec review: fit scores, top drivers, and a recommended ICP profile.",
      "link": "https://www.onyx.app/2680179-19"
    },
    {
      "text": "Jace Matthews: I’m still not convinced it’s a priority. We’re focused on launching a new package and getting pipeline up. This sounds like analysis work.",
      "link": "https://www.onyx.app/2680179-20"
    },
    {
      "text": "Camila Vega: That’s fair. The intent is to make that launch and pipeline push more efficient—so you’re not spending budget and SDR cycles on segments that look like they’ll churn or require heavy support. But if the team’s bandwidth is truly tapped, it may not be the right moment.",
      "link": "https://www.onyx.app/2680179-21"
    },
    {
      "text": "Jace Matthews: Yeah, plus we’ve got procurement constraints. Even if we liked it, it wouldn’t move fast.",
      "link": "https://www.onyx.app/2680179-22"
    },
    {
      "text": "Camila Vega: Got it. Let me ask one quick question to see if it’s even worth revisiting later: when you look at accounts that renew and expand versus ones that churn, do you have a clear, agreed-upon set of factors that explain the difference? Or is it still fuzzy?",
      "link": "https://www.onyx.app/2680179-23"
    },
    {
      "text": "Jace Matthews: It’s fuzzy. We have theories, but nothing we all agree on.",
      "link": "https://www.onyx.app/2680179-24"
    },
    {
      "text": "Camila Vega: That’s exactly the gap we close—turning those theories into a ranked driver breakdown tied to outcomes. If it helps, we could do a short working session where we map your current signals and see if we can produce a first-pass segment comparison. But if now’s not the time, I don’t want to push.",
      "link": "https://www.onyx.app/2680179-25"
    },
    {
      "text": "Jace Matthews: I appreciate that. I’m just not the right owner for this, and I can’t take on another evaluation.",
      "link": "https://www.onyx.app/2680179-26"
    },
    {
      "text": "Camila Vega: Totally fair. Who would be the best person for something like fit scoring and segment prioritization—RevOps, maybe someone in growth marketing?",
      "link": "https://www.onyx.app/2680179-27"
    },
    {
      "text": "Jace Matthews: Probably RevOps, but they’re slammed. And honestly, we’re not adding vendors this quarter.",
      "link": "https://www.onyx.app/2680179-28"
    },
    {
      "text": "Camila Vega: Understood. In that case, would it be okay if I sent a one-pager summarizing the fit_estimation output—fit score, driver breakdown, segment comparisons—and the specific use case around targeting next quarter based on retention and support burden? You can forward it if it becomes relevant later.",
      "link": "https://www.onyx.app/2680179-29"
    },
    {
      "text": "Jace Matthews: You can send it, sure. No promises.",
      "link": "https://www.onyx.app/2680179-30"
    },
    {
      "text": "Camila Vega: That’s all I’m asking. What’s the best email for you?",
      "link": "https://www.onyx.app/2680179-31"
    },
    {
      "text": "Jace Matthews: Just send it to my work email—same one you used to reach out.",
      "link": "https://www.onyx.app/2680179-32"
    },
    {
      "text": "Camila Vega: Will do. And if you find you’re revisiting next-quarter targeting in a month or two, I’d be happy to reconnect—no pressure. Thanks again for the time, Jace.",
      "link": "https://www.onyx.app/2680179-33"
    },
    {
      "text": "Jace Matthews: Alright. Thanks.",
      "link": "https://www.onyx.app/2680179-34"
    },
    {
      "text": "Camila Vega: Have a good one. Bye.",
      "link": "https://www.onyx.app/2680179-35"
    },
    {
      "text": "Jace Matthews: Bye.",
      "link": "https://www.onyx.app/2680179-36"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "camila_vega@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "jace_matthews@orchidpointe_hospitality.onyx.app"
    }
  ]
}