{
  "id": "FIREFLIES_3390641",
  "semantic_identifier": "3390641 - Zenith Lark Ventures - sales_pitch - Discussion with Kinsley Daniels",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-11-06 00:00:00",
  "metadata": {
    "meeting_date": "2025-11-06 00:00:00",
    "duration_min": "29"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-11"
      ],
      "year_month": "2025-11",
      "meeting_title": "3390641 - Zenith Lark Ventures - sales_pitch - Discussion with Kinsley Daniels",
      "organizer_email": "arjun_mehta@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Arjun Mehta: Hi Kinsley—Arjun Mehta here. Thanks for taking a few minutes. I’ll keep it brief: I work with teams that are trying to get really crisp on which customer segments are actually a strong fit and then translate that into messaging that converts. Does that match what you’re focused on at Zenith Lark Ventures right now?",
      "link": "https://www.onyx.app/7666440-1"
    },
    {
      "text": "Kinsley Daniels: Yeah, it does. We’re investing in a couple portfolio companies where ICP is still fuzzy, and even internally we debate whether we should lean SMB or mid-market for a few initiatives.",
      "link": "https://www.onyx.app/7666440-2"
    },
    {
      "text": "Arjun Mehta: That’s exactly the gap Customer_Analyzer is built for. It’s a SaaS tool that ingests your customer signals—CRM fields, onboarding survey data, usage events, support tickets, even interview notes—and outputs two things: a fit score per account/segment and practical positioning recommendations you can use in outbound and landing pages.",
      "link": "https://www.onyx.app/7666440-3"
    },
    {
      "text": "Kinsley Daniels: Okay. How is the “fit score” determined? I’ve seen a lot of scoring models that feel subjective.",
      "link": "https://www.onyx.app/7666440-4"
    },
    {
      "text": "Arjun Mehta: Totally fair. The fit estimation is driven by fit drivers you define—so it’s transparent and adjustable. For example: firmographics like industry and company size, technographics, problem severity, willingness to pay, time-to-value, adoption patterns, support burden, and churn-risk signals. Then it produces a 0–100 fit score, plus a driver breakdown that shows *why* the score is high or low, and segment comparisons—like SMB vs mid-market—based on actual outcomes such as retention, expansion, and conversion.",
      "link": "https://www.onyx.app/7666440-5"
    },
    {
      "text": "Kinsley Daniels: When you say “actual outcomes,” do you need a ton of historical data? Some of these teams are early.",
      "link": "https://www.onyx.app/7666440-6"
    },
    {
      "text": "Arjun Mehta: Not necessarily a ton, but we do need *some* signals. For early teams, we usually start with what you already have: CRM stage outcomes, a handful of onboarding responses, basic product usage, and support themes. The first pass is about getting directional clarity—what’s looking like high-fit versus low-fit—and then refining as more data comes in. The key is the driver breakdown makes it easy to challenge and calibrate the model with your team.",
      "link": "https://www.onyx.app/7666440-7"
    },
    {
      "text": "Kinsley Daniels: That calibration piece matters. Our teams often argue about “fit” in abstract terms.",
      "link": "https://www.onyx.app/7666440-8"
    },
    {
      "text": "Arjun Mehta: Exactly. Instead of “mid-market feels better,” you can see: mid-market has higher willingness-to-pay and better retention, but longer time-to-value; SMB activates faster but generates more support burden. Then the tool recommends an ICP profile based on what correlates with success for *your* product, not generic benchmarks.",
      "link": "https://www.onyx.app/7666440-9"
    },
    {
      "text": "Kinsley Daniels: Interesting. And the positioning recommendations—what do those look like in practice?",
      "link": "https://www.onyx.app/7666440-10"
    },
    {
      "text": "Arjun Mehta: In practice, it outputs segment-specific messaging components: value propositions, differentiators, proof points, and objection handling. So if you’re doing the classic two-tier approach—SMB vs mid-market—you can create two landing page narratives and two outbound angles that match what each segment actually cares about and where your product is strongest.",
      "link": "https://www.onyx.app/7666440-11"
    },
    {
      "text": "Kinsley Daniels: That’s one of our near-term needs. We’re trying to split messaging but keep it grounded in reality, not just “SMB wants simplicity, mid-market wants control.”",
      "link": "https://www.onyx.app/7666440-12"
    },
    {
      "text": "Arjun Mehta: Right—and Customer_Analyzer helps you avoid stereotypes. For example, it might surface that SMB in a specific industry has unusually high problem severity and expands quickly, making it a better segment than mid-market in another industry that churns due to implementation complexity. The fit score plus driver breakdown gives you that nuance, and the positioning recs turn it into copy and talk tracks you can use.",
      "link": "https://www.onyx.app/7666440-13"
    },
    {
      "text": "Kinsley Daniels: How quickly could a team get to something usable? We’re moving fast.",
      "link": "https://www.onyx.app/7666440-14"
    },
    {
      "text": "Arjun Mehta: Typical path is: connect the main data sources—often your CRM and product events first—map 6–10 fit drivers, and within a couple weeks you have a first set of segment comparisons and an initial recommended ICP profile. Then you can immediately apply it to one use case: two landing pages (SMB vs mid-market) and a simple outbound sequence per segment with proof points and objections.",
      "link": "https://www.onyx.app/7666440-15"
    },
    {
      "text": "Kinsley Daniels: What’s the lift on our side? I don’t want this to turn into a data science project.",
      "link": "https://www.onyx.app/7666440-16"
    },
    {
      "text": "Arjun Mehta: It’s not. Most of the lift is choosing the drivers and agreeing on what “success” means for you—renewal, expansion, activation, sales cycle length—things you already track. From there, the system does the scoring and keeps the reasoning visible so your team can pressure-test it.",
      "link": "https://www.onyx.app/7666440-17"
    },
    {
      "text": "Kinsley Daniels: Got it. Do you have examples of the segment comparison output? Like, what would I see?",
      "link": "https://www.onyx.app/7666440-18"
    },
    {
      "text": "Arjun Mehta: You’d see something like: SMB segment fit score 78 vs mid-market 64, plus a breakdown—SMB scores high on time-to-value and adoption, mid-market scores higher on willingness-to-pay but lower on support burden and churn risk. Then it will point to the top drivers contributing to each score and recommend the ICP attributes that align with the higher-retention, higher-conversion cohorts.",
      "link": "https://www.onyx.app/7666440-19"
    },
    {
      "text": "Kinsley Daniels: That would be useful in internal discussions. We spend a lot of time debating where to focus.",
      "link": "https://www.onyx.app/7666440-20"
    },
    {
      "text": "Arjun Mehta: Exactly—this creates a shared source of truth, so product, marketing, and sales can align. And once you have that, the messaging becomes far easier: you’re not trying to be everything to everyone; you’re tailoring by segment with evidence.",
      "link": "https://www.onyx.app/7666440-21"
    },
    {
      "text": "Kinsley Daniels: Okay. What would the next step be? I’m interested, but I’d want to see how it would map to one of our portfolio companies.",
      "link": "https://www.onyx.app/7666440-22"
    },
    {
      "text": "Arjun Mehta: Perfect. The best next step is a 30-minute working session where we pick one company, define the success outcome you care about, and outline the fit drivers and data sources you already have. I can also show a live walkthrough of the fit score, driver breakdown, and an example of the SMB vs mid-market landing-page messaging output.",
      "link": "https://www.onyx.app/7666440-23"
    },
    {
      "text": "Kinsley Daniels: That sounds reasonable. Can we do it next week?",
      "link": "https://www.onyx.app/7666440-24"
    },
    {
      "text": "Arjun Mehta: Absolutely. How’s Tuesday or Wednesday morning your time? If you tell me which portfolio company you want to use, I’ll send a short prep checklist—basically “CRM fields you have,” “any onboarding survey questions,” and whether you have product usage events and support tags.",
      "link": "https://www.onyx.app/7666440-25"
    },
    {
      "text": "Kinsley Daniels: Wednesday morning works. Let’s use Asterline— they’re the one most actively debating SMB versus mid-market right now.",
      "link": "https://www.onyx.app/7666440-26"
    },
    {
      "text": "Arjun Mehta: Great—Wednesday morning, Asterline it is. I’ll send a calendar invite for 30 minutes and that quick prep list. And if you can share, even at a high level, what you consider the key “win” metric—conversion, retention, expansion—that’ll help us tailor the fit model immediately.",
      "link": "https://www.onyx.app/7666440-27"
    },
    {
      "text": "Kinsley Daniels: Will do. Send it over and I’ll loop in the right person from their team for that session.",
      "link": "https://www.onyx.app/7666440-28"
    },
    {
      "text": "Arjun Mehta: Perfect. Appreciate it, Kinsley—talk Wednesday.",
      "link": "https://www.onyx.app/7666440-29"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "arjun_mehta@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "kinsley_daniels@zenith_lark_ventures.onyx.app"
    }
  ]
}