{
  "id": "FIREFLIES_3670566",
  "semantic_identifier": "3670566 - Redwood Prism Media - sales_pitch - Discussion with Kathryn Jacobs",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-11-04 00:00:00",
  "metadata": {
    "meeting_date": "2025-11-04 00:00:00",
    "duration_min": "16"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-11"
      ],
      "year_month": "2025-11",
      "meeting_title": "3670566 - Redwood Prism Media - sales_pitch - Discussion with Kathryn Jacobs",
      "organizer_email": "sneha_reddy@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Sneha Reddy: Hi Kathryn—Sneha Reddy here. Thanks for taking a few minutes. Did I catch you at an okay time?",
      "link": "https://www.onyx.app/9748784-1"
    },
    {
      "text": "Kathryn Jacobs: I have about five minutes, yeah. What’s this regarding?",
      "link": "https://www.onyx.app/9748784-2"
    },
    {
      "text": "Sneha Reddy: Perfect—I'll keep it tight. I’m calling because we work with product and revenue teams to get really clear on who their best customers are and how to message to those segments. The product is called Customer_Analyzer. It pulls signals you already have—CRM fields, onboarding surveys, product usage, support tickets—and turns that into a fit score and a simple “here’s how to position” recommendation. Curious—are you doing any ICP work right now at Redwood Prism Media?",
      "link": "https://www.onyx.app/9748784-3"
    },
    {
      "text": "Kathryn Jacobs: We’ve done some ICP work, yes. But we’re pretty busy, and we’re not looking for a big new initiative.",
      "link": "https://www.onyx.app/9748784-4"
    },
    {
      "text": "Sneha Reddy: Totally fair. The reason I’m reaching out is because a lot of teams *think* they have an ICP, but when they start scaling outbound or paid, the real question becomes: which segments actually convert, onboard quickly, stick around, and expand—and which ones look good on paper but churn or soak support. Customer_Analyzer’s main feature is fit estimation: it assigns a 0–100 fit score at the account and segment level and shows the driver breakdown—why that segment is high or low fit.",
      "link": "https://www.onyx.app/9748784-5"
    },
    {
      "text": "Kathryn Jacobs: We already have dashboards in HubSpot and we look at retention. I’m not sure we need another tool scoring things.",
      "link": "https://www.onyx.app/9748784-6"
    },
    {
      "text": "Sneha Reddy: Makes sense. Where we tend to be different is we don’t just report what happened—we connect multiple signals to explain *why* and make it usable for GTM. For example, you might see Mid-market “Media & Entertainment” looks fine in CRM, but when you blend in product adoption patterns and support burden, the score drops—and the driver breakdown shows it’s a time-to-value issue or onboarding friction. Then the segment comparison helps you decide, “Do we fix onboarding for this segment, or do we focus spend elsewhere?”",
      "link": "https://www.onyx.app/9748784-7"
    },
    {
      "text": "Kathryn Jacobs: Okay, but we’re not a startup figuring this out from scratch. We know our buyer.",
      "link": "https://www.onyx.app/9748784-8"
    },
    {
      "text": "Sneha Reddy: Totally. Even with a known buyer, the use case we see a lot is validating the ICP *before* scaling spend—especially if you’re thinking about expanding campaigns or pushing into adjacent verticals. If you’re about to put budget behind a segment, a fit score plus driver breakdown can prevent you from paying to acquire customers who look similar but don’t succeed.",
      "link": "https://www.onyx.app/9748784-9"
    },
    {
      "text": "Kathryn Jacobs: We’re not really increasing spend right now. Budgets are flat this quarter.",
      "link": "https://www.onyx.app/9748784-10"
    },
    {
      "text": "Sneha Reddy: Understood. In that case, one lightweight way teams use it is to tighten focus with the same resources—prioritize the highest-fit segments for sales effort and messaging, and deprioritize the ones that generate pipeline but don’t close or renew. Quick question: do you see any pattern where certain types of accounts take longer to onboard or require more support than others?",
      "link": "https://www.onyx.app/9748784-11"
    },
    {
      "text": "Kathryn Jacobs: Not in a way that’s actionable. But again, we’re in the middle of a bunch of stuff. I’m not sure I want to spend time integrating another SaaS.",
      "link": "https://www.onyx.app/9748784-12"
    },
    {
      "text": "Sneha Reddy: That’s fair. Implementation is usually the big concern. We typically start with the signals you already have in the CRM plus a small export of product usage or support tags—no heavy lift. The first output is basically: top segments by fit, the bottom segments, and the key drivers. It’s meant to be a fast diagnostic rather than a months-long project.",
      "link": "https://www.onyx.app/9748784-13"
    },
    {
      "text": "Kathryn Jacobs: Even so, we have data people. They can do an analysis if we need one.",
      "link": "https://www.onyx.app/9748784-14"
    },
    {
      "text": "Sneha Reddy: Absolutely—if you have bandwidth internally, that can work. The thing we hear is: analysts can produce a one-off report, but it’s hard to keep it current and tie it directly to positioning. Customer_Analyzer keeps the scoring updated as new accounts come in, and it translates the insight into practical messaging—value props, differentiators, proof points, and even objection handling aligned to that segment’s drivers.",
      "link": "https://www.onyx.app/9748784-15"
    },
    {
      "text": "Kathryn Jacobs: Messaging recommendations sounds kind of generic. We’re pretty specific with our positioning.",
      "link": "https://www.onyx.app/9748784-16"
    },
    {
      "text": "Sneha Reddy: I get the skepticism. The recommendations are grounded in your own outcomes. So if the driver breakdown shows your best-fit customers consistently have high problem severity and fast time-to-value, the messaging focuses on that—what resonates, what proof to use, and what objections typically show up for lower-fit accounts. It’s not “generic AI copy”—it’s derived from your patterns.",
      "link": "https://www.onyx.app/9748784-17"
    },
    {
      "text": "Kathryn Jacobs: Maybe. But I still don’t see enough of a need to take this to a longer call.",
      "link": "https://www.onyx.app/9748784-18"
    },
    {
      "text": "Sneha Reddy: That’s fair. Let me make it super concrete and you can tell me if it’s even relevant. If we could show you, say, three segments in your current pipeline that look similar by firmographics—but one has a significantly higher likelihood to adopt, renew, and expand based on usage and support signals—would that be useful to your team?",
      "link": "https://www.onyx.app/9748784-19"
    },
    {
      "text": "Kathryn Jacobs: In theory, sure. In practice, we’re not changing our process this quarter.",
      "link": "https://www.onyx.app/9748784-20"
    },
    {
      "text": "Sneha Reddy: Understood. Is there a time when you usually revisit ICP or segmentation—quarterly planning, annual planning, campaign refresh?",
      "link": "https://www.onyx.app/9748784-21"
    },
    {
      "text": "Kathryn Jacobs: Probably annual planning. Maybe late Q3. But I can’t promise.",
      "link": "https://www.onyx.app/9748784-22"
    },
    {
      "text": "Sneha Reddy: That helps. I don’t want to push if the timing’s off. Would it be okay if I sent a one-page overview of the fit estimation output—what the score looks like and the driver breakdown—and then I can check back closer to late Q3?",
      "link": "https://www.onyx.app/9748784-23"
    },
    {
      "text": "Kathryn Jacobs: You can send something, yes. But please don’t put me into a sequence that emails me every week.",
      "link": "https://www.onyx.app/9748784-24"
    },
    {
      "text": "Sneha Reddy: Totally—no weekly sequence. I’ll send a single email with the overview and a couple screenshots, and I’ll set a reminder to follow up in a few months. What’s the best email for you—should I use kathryn.jacobs@redwoodprismmedia.com?",
      "link": "https://www.onyx.app/9748784-25"
    },
    {
      "text": "Kathryn Jacobs: Yes, that’s fine.",
      "link": "https://www.onyx.app/9748784-26"
    },
    {
      "text": "Sneha Reddy: Great. Last quick question so I tailor what I send: are you primarily focused on retention/expansion right now, or net-new acquisition?",
      "link": "https://www.onyx.app/9748784-27"
    },
    {
      "text": "Kathryn Jacobs: Retention and upsell, mostly.",
      "link": "https://www.onyx.app/9748784-28"
    },
    {
      "text": "Sneha Reddy: Got it. I’ll emphasize how the fit score ties to churn risk signals and support burden, and how that informs which segments are most likely to expand. I’ll send that over today. Anything else I should know before I do?",
      "link": "https://www.onyx.app/9748784-29"
    },
    {
      "text": "Kathryn Jacobs: No, that’s it. I have to jump.",
      "link": "https://www.onyx.app/9748784-30"
    },
    {
      "text": "Sneha Reddy: Of course—thanks for the time, Kathryn. I’ll email the overview and I’ll follow up closer to late Q3. Have a good one.",
      "link": "https://www.onyx.app/9748784-31"
    },
    {
      "text": "Kathryn Jacobs: Thanks. Bye.",
      "link": "https://www.onyx.app/9748784-32"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "sneha_reddy@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "kathryn_jacobs@redwood_prism_media.onyx.app"
    }
  ]
}