{
  "id": "FIREFLIES_4108150",
  "semantic_identifier": "4108150 - Jetstream Vale Aviation - sales_call - Discussion with Teresa Flores",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-11-16 00:00:00",
  "metadata": {
    "meeting_date": "2025-11-16 00:00:00",
    "duration_min": "25"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-11"
      ],
      "year_month": "2025-11",
      "meeting_title": "4108150 - Jetstream Vale Aviation - sales_call - Discussion with Teresa Flores",
      "organizer_email": "megan_foster@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Megan Foster: Hi Teresa—good to see you again. Last time you mentioned Jetstream Vale Aviation was interested in tightening follow-ups after discovery and getting a cleaner view of what’s actually going to close. Does that still feel like the right priority for this quarter?",
      "link": "https://www.onyx.app/9456333-1"
    },
    {
      "text": "Teresa Flores: Hi Megan, yes. We’ve got decent top-of-funnel, but our follow-through is inconsistent and the forecast is… not great. Leadership is pushing for fewer surprises at the end of the month.",
      "link": "https://www.onyx.app/9456333-2"
    },
    {
      "text": "Megan Foster: That’s exactly where Sales_Accelerator tends to land value fast. Since you already have Customer_Analyzer in the mix, Sales_Accelerator sits on top of Salesforce and uses those fit scores and positioning blocks you’ve already built—so we’re not asking you to redo ICP or messaging. The two areas I’d suggest we focus on today are: (1) explainable sales forecasting, and (2) AE follow-up recommendations right after discovery. Sound good?",
      "link": "https://www.onyx.app/9456333-3"
    },
    {
      "text": "Teresa Flores: Yes, those two are the big ones. We’re especially trying to standardize what happens after a discovery call.",
      "link": "https://www.onyx.app/9456333-4"
    },
    {
      "text": "Megan Foster: Perfect. On the forecasting side: Sales_Accelerator combines your CRM stage data with activity signals—emails, calls, meetings—plus cycle-time benchmarks. If you choose, it can also use Customer_Analyzer fit score as a weighting factor. The output is the usual commit / best-case / pipeline views, but what’s different is the “why.” It shows the drivers: stage age, last touch, whether a next meeting is scheduled, fit tier, and how similar deals historically convert.",
      "link": "https://www.onyx.app/9456333-5"
    },
    {
      "text": "Teresa Flores: When you say activity signals, are you reading our emails and call notes? That’s one of our concerns—privacy and compliance.",
      "link": "https://www.onyx.app/9456333-6"
    },
    {
      "text": "Megan Foster: Totally fair, and it comes up a lot. You can control the data sources. Many teams start with metadata only—timestamps, meeting scheduled vs not, last activity date—without ingesting email body content. If you want the follow-up drafting piece, that’s where you’d allow the system to reference approved notes or transcripts, but we support consent controls, redaction options, and retention settings so you can align with your policies.",
      "link": "https://www.onyx.app/9456333-7"
    },
    {
      "text": "Teresa Flores: Okay. We’re in aviation—PII and customer data handling is sensitive. We’d need to be sure we can limit what’s stored and who can see it.",
      "link": "https://www.onyx.app/9456333-8"
    },
    {
      "text": "Megan Foster: Absolutely. We can scope it so only specific fields are stored, and we can keep it within your CRM governance model for access—role-based permissions. In the pilot, we can start with forecasting that uses stage + activity metadata + fit score only. Then, if you’re comfortable, we expand to the post-discovery follow-up workflow with stricter guardrails.",
      "link": "https://www.onyx.app/9456333-9"
    },
    {
      "text": "Teresa Flores: That’s reassuring. Forecasting accuracy is a pain point, but honestly the bigger immediate issue is deals stalling because reps don’t send a strong recap or they don’t multi-thread.",
      "link": "https://www.onyx.app/9456333-10"
    },
    {
      "text": "Megan Foster: Let’s dig into that use case. After a discovery call, Sales_Accelerator prompts the AE with a recommended follow-up package: it drafts a recap email, suggests two tailored proof points from the approved positioning library—pulled from what you already have in Customer_Analyzer—and it can generate a mutual action plan with due dates and stakeholders. The goal is to make the “right next step” the default, not something that depends on the rep’s memory.",
      "link": "https://www.onyx.app/9456333-11"
    },
    {
      "text": "Teresa Flores: How “automatic” is that? We don’t want reps blasting out something that’s off-brand or includes something sensitive from notes.",
      "link": "https://www.onyx.app/9456333-12"
    },
    {
      "text": "Megan Foster: It’s recommended, not auto-send. The AE reviews, edits, and sends. And the proof points are only from your approved positioning blocks—so you’re not getting random AI-generated claims. For the recap, you can choose what inputs it uses: for example, “use only the AE’s structured call notes fields” instead of pulling verbatim transcript text. That’s often the cleanest path for compliance.",
      "link": "https://www.onyx.app/9456333-13"
    },
    {
      "text": "Teresa Flores: That could work. Our reps do fill out structured notes, even if they’re inconsistent about it. Another issue: we already have Salesforce dashboards. Sales ops will ask why we need another layer.",
      "link": "https://www.onyx.app/9456333-14"
    },
    {
      "text": "Megan Foster: Great question. We’re not trying to replace your dashboards; we’re trying to turn them into action. Salesforce tells you “what happened” and “where it sits.” Sales_Accelerator adds two things: explainable forecasting drivers and best-next-action guidance. For example, it’ll flag, “This deal is in stage 3, but stage age is 2x your benchmark, last touch is 12 days ago, and no next meeting is scheduled”—and it will recommend the next step and prompt the follow-up sequence. That’s hard to operationalize with static dashboards alone.",
      "link": "https://www.onyx.app/9456333-15"
    },
    {
      "text": "Teresa Flores: That makes sense. My VP will want to see how it improves forecast calls specifically. We have weekly commits and it’s always a debate.",
      "link": "https://www.onyx.app/9456333-16"
    },
    {
      "text": "Megan Foster: In forecast calls, managers can see commit/best-case/pipeline by segment, rep, or source, with slippage diagnostics—like which stages are leaking and which reps have outlier cycle times. The key is the scenario planning: “If we add 20 SQLs in ICP Tier 1, what’s the expected impact?” It ties pipeline generation to outcomes using your historical conversion, plus fit tier weighting.",
      "link": "https://www.onyx.app/9456333-17"
    },
    {
      "text": "Teresa Flores: The scenario planning is interesting. We’ve been arguing about whether to focus more on Tier 1 accounts or expand. Having a model would help, as long as it’s explainable.",
      "link": "https://www.onyx.app/9456333-18"
    },
    {
      "text": "Megan Foster: Exactly—and it is explainable. You can click into a forecast number and see the driver breakdown. It’s not a black box. Also, because it consumes Customer_Analyzer fit tiers, you can see how much of your pipeline is truly ICP-aligned, and how that affects forecast confidence.",
      "link": "https://www.onyx.app/9456333-19"
    },
    {
      "text": "Teresa Flores: Okay. If we were to pilot, what would you recommend we start with? I don’t want a massive rollout.",
      "link": "https://www.onyx.app/9456333-20"
    },
    {
      "text": "Megan Foster: I’d propose a focused pilot with one team—say 6–8 AEs. Two success criteria: (1) forecast accuracy improvement measured by variance between commit and actual, and (2) time-to-follow-up and consistency after discovery—like % of deals with a recap sent within 24 hours and a mutual action plan created within 72 hours.",
      "link": "https://www.onyx.app/9456333-21"
    },
    {
      "text": "Teresa Flores: I like measurable. On the compliance side, I’d want the pilot to avoid email body ingestion at first.",
      "link": "https://www.onyx.app/9456333-22"
    },
    {
      "text": "Megan Foster: Done. Phase 1: forecasting with CRM stage data + activity metadata + Customer_Analyzer fit score. Phase 2: post-discovery follow-up recommendations using only structured fields and approved positioning blocks—no transcript parsing unless and until your compliance team signs off.",
      "link": "https://www.onyx.app/9456333-23"
    },
    {
      "text": "Teresa Flores: That sounds like a reasonable path. What does integration look like? We can’t afford a ton of admin work.",
      "link": "https://www.onyx.app/9456333-24"
    },
    {
      "text": "Megan Foster: Because it sits on top of Salesforce, setup is mainly: connect Salesforce, map your opportunity stages, connect activity signals (often via your existing calendar/calling tool integrations), and connect Customer_Analyzer so we can pull the fit scores and positioning blocks. Sales ops typically spends a few hours on mapping and permissions, then we configure the forecast views and the follow-up templates.",
      "link": "https://www.onyx.app/9456333-25"
    },
    {
      "text": "Teresa Flores: And training? Adoption is always the challenge.",
      "link": "https://www.onyx.app/9456333-26"
    },
    {
      "text": "Megan Foster: For AEs, it’s light: it shows up as “next best actions” on the account and opportunity, plus a post-discovery checklist. For managers, it’s a forecast workspace that replaces spreadsheet gymnastics. We usually do one enablement session for reps and one for leaders, then weekly check-ins during the pilot.",
      "link": "https://www.onyx.app/9456333-27"
    },
    {
      "text": "Teresa Flores: Okay. If we can keep compliance comfortable and prove the forecast variance improvement, I can get this funded. What do you need from me to move forward?",
      "link": "https://www.onyx.app/9456333-28"
    },
    {
      "text": "Megan Foster: Two things: first, confirm the pilot group—who the 6–8 AEs and one manager would be. Second, introduce us to whoever owns data governance/privacy so we can document the Phase 1 boundaries—no email body, metadata only, retention rules. After that, I’ll send a pilot proposal with timeline, success metrics, and pricing to align to a buying decision.",
      "link": "https://www.onyx.app/9456333-29"
    },
    {
      "text": "Teresa Flores: I can do that. I’ll loop in our sales ops lead and our compliance contact. Can you send me a one-pager that outlines the phased approach and the data handling controls?",
      "link": "https://www.onyx.app/9456333-30"
    },
    {
      "text": "Megan Foster: Absolutely. I’ll send a one-pager today with the Phase 1/Phase 2 scope, the controls around PII, retention, and permissions, and the success criteria we discussed. If we aim for a 30-day pilot starting next month, does that fit your timeline?",
      "link": "https://www.onyx.app/9456333-31"
    },
    {
      "text": "Teresa Flores: Yes, that lines up well. Let’s target next month. If the proposal is straightforward, I think we can get approval quickly.",
      "link": "https://www.onyx.app/9456333-32"
    },
    {
      "text": "Megan Foster: Great—then next step: I’ll email the one-pager and a calendar link for a 30-minute pilot planning session with you, sales ops, and compliance. Thanks, Teresa—this feels like a strong fit for what you’re trying to solve.",
      "link": "https://www.onyx.app/9456333-33"
    },
    {
      "text": "Teresa Flores: Thanks, Megan. Looking forward to the details.",
      "link": "https://www.onyx.app/9456333-34"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "megan_foster@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "teresa_flores@jetstream_vale_aviation.onyx.app"
    }
  ]
}