{
  "id": "FIREFLIES_6456156",
  "semantic_identifier": "6456156 - Wavelink Marine Systems - buy - Discussion with Joaquin Bennett",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-11-28 00:00:00",
  "metadata": {
    "meeting_date": "2025-11-28 00:00:00",
    "duration_min": "36"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-11"
      ],
      "year_month": "2025-11",
      "meeting_title": "6456156 - Wavelink Marine Systems - buy - Discussion with Joaquin Bennett",
      "organizer_email": "mina_park@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Mina Park: Hey Joaquin—good to see you again. Since this is our third call, I’d love to use the time to line up anything still unclear and, if it feels right, get next steps locked so you can move forward with Customer_Analyzer. Sound good?",
      "link": "https://www.onyx.app/5139301-1"
    },
    {
      "text": "Joaquin Bennett: Yeah, that works. We’re definitely interested. I just want to make sure we’re buying something we can actually operationalize and not just another “insights” tool.",
      "link": "https://www.onyx.app/5139301-2"
    },
    {
      "text": "Mina Park: Totally fair. Let me anchor on what you told me last time: you want your team aligned on who your best-fit marine operators and partners are, and you want sales enablement that actually helps reps handle objections consistently. The two parts of Customer_Analyzer that map most directly are the fit score and the positioning recommendations—especially the objection-handling playbook that’s tied to real drivers and evidence. Is that still the core?",
      "link": "https://www.onyx.app/5139301-3"
    },
    {
      "text": "Joaquin Bennett: Yes. The enablement angle is big. We’ve got reps saying different things, and marketing is producing content that doesn’t always match what prospects care about.",
      "link": "https://www.onyx.app/5139301-4"
    },
    {
      "text": "Mina Park: Perfect. Then here’s how I’d frame it in practical terms. First, we ingest the signals you already have—CRM fields, onboarding notes, any product usage events you can share, support ticket themes, even interview notes if you’ve got them. From that we generate fit drivers—what correlates with successful customers—and produce a fit score at the segment level and account level. Second, and this is the part your sales team will feel immediately, the positioning recommendation feature turns those drivers into editable messaging blocks: value proposition, differentiators, proof points to collect, pricing/value framing, and a clean objection-handling guide. All linked back to the evidence so reps trust it.",
      "link": "https://www.onyx.app/5139301-5"
    },
    {
      "text": "Joaquin Bennett: The linking back to evidence is interesting. My concern is adoption—reps don’t like “theory.” They want something they can use in a call tomorrow.",
      "link": "https://www.onyx.app/5139301-6"
    },
    {
      "text": "Mina Park: Exactly. That’s why we don’t just output a PDF. The messaging shows up as blocks you can drop into your deck bullets, your email openers, and your call talk-tracks. For example, if a segment’s top fit driver is “reliability under harsh conditions,” the value prop and differentiators will reflect that, and the objection playbook will include: “If they say ‘your system is too complex,’ respond with X, supported by Y proof point,” and it will tell you what proof points you’re missing so you can collect them intentionally.",
      "link": "https://www.onyx.app/5139301-7"
    },
    {
      "text": "Joaquin Bennett: That would help. Right now objections like “integration will be painful” or “we already have a vendor” are handled differently by every rep.",
      "link": "https://www.onyx.app/5139301-8"
    },
    {
      "text": "Mina Park: Great example. Customer_Analyzer will surface which objections show up most in your notes and tickets, and then recommend responses grounded in what best-fit customers actually valued. So instead of generic “we integrate with everything,” you get segment-specific language: “Here’s how operators like you reduced install time,” plus a list of proof points to gather—like a one-pager from your implementation lead or a short case snippet. It’s a system for making enablement consistent and measurable.",
      "link": "https://www.onyx.app/5139301-9"
    },
    {
      "text": "Joaquin Bennett: Okay. The other thing we talked about is our data being messy. Our CRM has missing fields. We don’t always tag segments consistently. I don’t want the fit scoring to be garbage-in, garbage-out.",
      "link": "https://www.onyx.app/5139301-10"
    },
    {
      "text": "Mina Park: You’re right to flag it. Data quality and missing fields can reduce scoring accuracy if we treat everything as required. Two things we do to de-risk that: (1) we start with the signals you do trust and that are reasonably complete—often a handful of CRM fields plus a couple sources like onboarding survey responses or support ticket categories. (2) we show “confidence” and “coverage” indicators so you can see when a score is based on thin data. We’ll also give you a short recommended field and tagging cleanup list—usually 5–10 items—that improves accuracy quickly without boiling the ocean.",
      "link": "https://www.onyx.app/5139301-11"
    },
    {
      "text": "Joaquin Bennett: What does the first month look like in that scenario? Because I don’t have appetite for a giant CRM project.",
      "link": "https://www.onyx.app/5139301-12"
    },
    {
      "text": "Mina Park: Understood. Typical month one for a team like Wavelink Marine Systems is: week one, connect CRM and import whatever customer notes and ticket themes you have. Week two, generate initial segments and fit drivers; you’ll validate with your team—quick workshop. Week three, positioning recommendations for your top two target segments, including the objection-handling playbook. Week four, roll it into sales enablement: update your deck, create a one-page “objections and responses” sheet, and we measure usage with a simple workflow—like requiring the rep to choose the segment in CRM so the right blocks show up in the right places.",
      "link": "https://www.onyx.app/5139301-13"
    },
    {
      "text": "Joaquin Bennett: That’s reasonable. I like that you’re focusing on two segments rather than trying to fix everything at once.",
      "link": "https://www.onyx.app/5139301-14"
    },
    {
      "text": "Mina Park: Exactly—because the goal is impact fast. Let me ask: if we delivered, say, a segment-specific objection guide that your team actually uses, and it shortens cycles or improves win rate, is that enough to justify the purchase this quarter?",
      "link": "https://www.onyx.app/5139301-15"
    },
    {
      "text": "Joaquin Bennett: If it really gets used, yes. We’re under pressure to improve conversion on inbound and be more deliberate on outbound. I can sell that internally.",
      "link": "https://www.onyx.app/5139301-16"
    },
    {
      "text": "Mina Park: Great. Then the remaining piece is commercial and decision process. Last call you mentioned you’re the main driver but you need finance sign-off. Has anything changed there?",
      "link": "https://www.onyx.app/5139301-17"
    },
    {
      "text": "Joaquin Bennett: Same. I can recommend it, but I need our ops director to be comfortable with implementation and finance to see pricing.",
      "link": "https://www.onyx.app/5139301-18"
    },
    {
      "text": "Mina Park: Perfect. To make this easy, I suggest we lock in a 12-month subscription for Customer_Analyzer with the positioning recommendations included, and we define success criteria around sales enablement: two segments live, objection-handling playbook adopted by the team, and a set of proof points collected. I can send a proposal today with pricing and a simple implementation plan you can forward. Then we schedule a quick 20-minute approval call with ops/finance. Does that fit?",
      "link": "https://www.onyx.app/5139301-19"
    },
    {
      "text": "Joaquin Bennett: Yes, but I want to be sure the pricing aligns with the value. What range are we talking?",
      "link": "https://www.onyx.app/5139301-20"
    },
    {
      "text": "Mina Park: For your size and scope—sales enablement focus, two core segments to start, CRM plus support signals—the annual is in the mid five-figures. That includes onboarding, the segment workshop, and the positioning blocks and playbooks. If you want expansion later—more segments or additional data sources—we can add it, but you don’t have to start there.",
      "link": "https://www.onyx.app/5139301-21"
    },
    {
      "text": "Joaquin Bennett: Mid five-figures is in line with what I expected. I’m more worried about “we buy it and nobody uses it.”",
      "link": "https://www.onyx.app/5139301-22"
    },
    {
      "text": "Mina Park: Totally. Here’s how we bake adoption in: we don’t measure success by “logins.” We measure it by outputs in the workflow—updated deck bullets, email openers, and the objection guide that reps reference. And because the recommendations are editable messaging blocks, marketing can own the final copy while sales owns the call usage. We’ll also set a recurring check-in for the first 60 days to tighten the segments and make sure the playbook matches what’s happening in real calls.",
      "link": "https://www.onyx.app/5139301-23"
    },
    {
      "text": "Joaquin Bennett: That’s good. If marketing can edit and we’re not locked into “AI said so,” it’ll go over better.",
      "link": "https://www.onyx.app/5139301-24"
    },
    {
      "text": "Mina Park: Exactly—Customer_Analyzer is opinionated but transparent. Everything links back to drivers and evidence, so if Joaquin says “this differentiator doesn’t resonate,” you can trace why it was suggested and adjust. It becomes your system, not ours.",
      "link": "https://www.onyx.app/5139301-25"
    },
    {
      "text": "Joaquin Bennett: Alright. I think we’re ready to move. Send the proposal and the implementation outline. I’ll loop in ops and finance.",
      "link": "https://www.onyx.app/5139301-26"
    },
    {
      "text": "Mina Park: Will do. One last thing—can we pencil the approval call now so this doesn’t stall? I have openings tomorrow at 2:00 or Thursday at 11:00.",
      "link": "https://www.onyx.app/5139301-27"
    },
    {
      "text": "Joaquin Bennett: Tomorrow at 2:00 works. I’ll invite ops and finance.",
      "link": "https://www.onyx.app/5139301-28"
    },
    {
      "text": "Mina Park: Perfect. I’ll send the proposal within the next hour, plus a one-page summary that highlights the two features we’re leading with—fit scoring and positioning recommendations—specifically the objection-handling playbook tied to your strongest value drivers. And I’ll include the data quality plan: which fields we’ll use first, what’s optional, and the quick cleanup list. Anything else you want included for internal review?",
      "link": "https://www.onyx.app/5139301-29"
    },
    {
      "text": "Joaquin Bennett: Maybe a short paragraph on how you handle missing fields and confidence, since that’s the main risk people will bring up.",
      "link": "https://www.onyx.app/5139301-30"
    },
    {
      "text": "Mina Park: Got it. I’ll include that clearly—how we start with trusted signals, show coverage/confidence, and improve incrementally without a big CRM overhaul. Thanks, Joaquin. Looking forward to getting this over the line tomorrow.",
      "link": "https://www.onyx.app/5139301-31"
    },
    {
      "text": "Joaquin Bennett: Same here. Talk tomorrow.",
      "link": "https://www.onyx.app/5139301-32"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mina_park@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "joaquin_bennett@wavelink_marine_systems.onyx.app"
    }
  ]
}