{
  "id": "FIREFLIES_7036470",
  "semantic_identifier": "7036470 - Yarrowgate Investment - sales_pitch - Discussion with Leah Wheeler",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-11-16 00:00:00",
  "metadata": {
    "meeting_date": "2025-11-16 00:00:00",
    "duration_min": "27"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-11"
      ],
      "year_month": "2025-11",
      "meeting_title": "7036470 - Yarrowgate Investment - sales_pitch - Discussion with Leah Wheeler",
      "organizer_email": "irene_shen@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Irene Shen: Hi Leah—thanks for taking a few minutes. I work with teams that are getting swamped by support requests and internal Jira threads, and they’re trying to answer a simple question: “What customer issues actually matter most to the business right now?” I wanted to quickly share how Issue_Tracker helps with that, and if it resonates we can book a deeper walkthrough.",
      "link": "https://www.onyx.app/7520693-1"
    },
    {
      "text": "Leah Wheeler: Hi Irene. Sure—happy to hear it. We definitely have the “too many signals, not enough clarity” problem.",
      "link": "https://www.onyx.app/7520693-2"
    },
    {
      "text": "Irene Shen: That’s exactly where Issue_Tracker sits. It’s not a replacement for Zendesk or Jira—think of it as an intelligence and triage layer in between. It continuously ingests customer-reported problems from your support channels, deduplicates and clusters them into themes, and then prioritizes those clusters based on business impact—like revenue exposure, segment importance, and deal risk. So instead of debating anecdote vs. anecdote, everyone looks at the same “issue object” with evidence and impacted customers.",
      "link": "https://www.onyx.app/7520693-3"
    },
    {
      "text": "Leah Wheeler: Interesting. When you say “clusters,” do you mean it’s automatically grouping similar tickets and requests together?",
      "link": "https://www.onyx.app/7520693-4"
    },
    {
      "text": "Irene Shen: Exactly. The system pulls in the source conversations, links them to one consolidated theme or root cause, and keeps a searchable history of what was decided, why, and what’s shipped. The feature most teams start with is our issue prioritization—Issue_Tracker assigns an explainable priority score to each cluster. It can factor in frequency and velocity, severity tags, customer tier or ARR, churn risk flags, and which segments you care about most.",
      "link": "https://www.onyx.app/7520693-5"
    },
    {
      "text": "Leah Wheeler: “Explainable” is key. We’ve tried scoring models before and people don’t trust them because it’s a black box.",
      "link": "https://www.onyx.app/7520693-6"
    },
    {
      "text": "Irene Shen: Totally. Here it’s transparent: you can see the inputs and tune the weighting. And we don’t force one view. Support can view clusters by SLA risk, Product can view impact vs effort, Sales can view deal blockers, and Execs can view revenue exposure. Everyone’s looking at the same underlying cluster, just through the lens they need.",
      "link": "https://www.onyx.app/7520693-7"
    },
    {
      "text": "Leah Wheeler: Got it. Our biggest pain is follow-up consistency. We’ll tell clients “we’re on it,” but then weeks later no one remembers who needed an update, or it’s buried in a CSM’s notes.",
      "link": "https://www.onyx.app/7520693-8"
    },
    {
      "text": "Irene Shen: That’s one of the cleanest use cases. CSMs can subscribe accounts to relevant clusters—so if Yarrowgate has five customers impacted by “portfolio export timing out,” those customers get attached to that cluster. When the linked Jira ticket ships, Issue_Tracker records the release milestone and creates a history trail of which customers were notified and when. It turns follow-up from a heroic manual process into a consistent workflow.",
      "link": "https://www.onyx.app/7520693-9"
    },
    {
      "text": "Leah Wheeler: That would help. Right now, we try to do that with Jira watchers and spreadsheets, and it’s messy. How does it connect to Jira? We’re pretty standardized there.",
      "link": "https://www.onyx.app/7520693-10"
    },
    {
      "text": "Irene Shen: We integrate directly. The cluster stays linked to the downstream engineering work item—Jira or Linear—so Product and Engineering keep working where they already are. Issue_Tracker just standardizes the “issue object” and keeps it connected to the original customer evidence and the impacted account list. So when Jira status changes, your CS team can see it immediately, and the system can prompt or automate notifications based on your process.",
      "link": "https://www.onyx.app/7520693-11"
    },
    {
      "text": "Leah Wheeler: And the prioritization—can it incorporate customer tier and segment? Because we have institutional clients where an issue carries way more weight than, say, smaller accounts.",
      "link": "https://www.onyx.app/7520693-12"
    },
    {
      "text": "Irene Shen: Yes. That’s actually where it becomes most valuable. You can weight by ARR and customer tier, and also by ICP/segment importance. So if an issue hits a high-fit segment—like institutional workflows—it rises, even if the raw ticket volume is smaller. The goal is to prevent the “loudest wins” dynamic and instead align on business-grounded logic.",
      "link": "https://www.onyx.app/7520693-13"
    },
    {
      "text": "Leah Wheeler: That resonates. Our product team often prioritizes by volume, and our CS team prioritizes by account importance, and we end up with tension.",
      "link": "https://www.onyx.app/7520693-14"
    },
    {
      "text": "Irene Shen: Exactly. The shared issue model reduces that tension because you can say, “Here’s the cluster, here’s how many customers, here’s which segments, here’s ARR at risk, and here’s the velocity.” Then the debate shifts from “is this real?” to “what do we do about it?”",
      "link": "https://www.onyx.app/7520693-15"
    },
    {
      "text": "Leah Wheeler: How much setup is involved? I’m always wary of tools that require weeks of taxonomy work.",
      "link": "https://www.onyx.app/7520693-16"
    },
    {
      "text": "Irene Shen: Minimal to start. Typically we connect your support channel and Jira first, then configure a baseline priority model—frequency/velocity, severity, tier/ARR. If you want, we add segment weighting using your CRM fields. The clustering starts immediately because it’s based on incoming ticket text and metadata; you can refine it over time, but you don’t need a perfect taxonomy on day one.",
      "link": "https://www.onyx.app/7520693-17"
    },
    {
      "text": "Leah Wheeler: Makes sense. One concern: we’re in a regulated space. Are you storing full message transcripts from support tickets?",
      "link": "https://www.onyx.app/7520693-18"
    },
    {
      "text": "Irene Shen: Good question. We can ingest the relevant ticket content and metadata needed for clustering and evidence, and we support controls around what’s stored and how it’s accessed. On a longer call we can go through your requirements and our options—many teams choose to store references plus curated excerpts, depending on policy.",
      "link": "https://www.onyx.app/7520693-19"
    },
    {
      "text": "Leah Wheeler: Okay. If we did a deeper session, I’d want my Head of Customer Success and maybe someone from Product Ops there. Can you show a concrete example of how an issue gets prioritized and then how CSM follow-up is tracked after a Jira release?",
      "link": "https://www.onyx.app/7520693-20"
    },
    {
      "text": "Irene Shen: Absolutely—that’s the perfect agenda. We can walk through: (1) ingestion and clustering, (2) the explainable priority score and the different views—Support/Product/Exec—and (3) the subscribe-and-notify workflow for CSMs tied to Jira milestones, including the history trail of notifications.",
      "link": "https://www.onyx.app/7520693-21"
    },
    {
      "text": "Leah Wheeler: Great. What would you need from us beforehand to make it relevant?",
      "link": "https://www.onyx.app/7520693-22"
    },
    {
      "text": "Irene Shen: If you can share which support platform you’re using—Zendesk or Intercom—and confirm Jira is the delivery tool, I can tailor the demo flow. Also, if you have two or three common recurring issues you’re currently tracking manually, we can use those as examples. And if you have segment tiers you care about most, we can show how weighting changes the ranking.",
      "link": "https://www.onyx.app/7520693-23"
    },
    {
      "text": "Leah Wheeler: We’re on Zendesk and Jira. I can send a couple of recurring themes we struggle with, and our segment tiers. Let’s do it.",
      "link": "https://www.onyx.app/7520693-24"
    },
    {
      "text": "Irene Shen: Perfect. How does next Wednesday look for a 45-minute working session? I can invite your Head of CS and Product Ops, and we’ll keep it very practical—by the end you’ll know whether Issue_Tracker can replace the spreadsheets and make prioritization less contentious.",
      "link": "https://www.onyx.app/7520693-25"
    },
    {
      "text": "Leah Wheeler: Next Wednesday works. Send the invite for late morning my time, and I’ll loop them in.",
      "link": "https://www.onyx.app/7520693-26"
    },
    {
      "text": "Irene Shen: Will do. I’ll send a calendar hold for Wednesday late morning, plus a short note on the couple of inputs that help us tailor it. Thanks, Leah—looking forward to showing you how the prioritization and the CSM follow-up trail work end-to-end.",
      "link": "https://www.onyx.app/7520693-27"
    },
    {
      "text": "Leah Wheeler: Thanks, Irene. Talk next week.",
      "link": "https://www.onyx.app/7520693-28"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "irene_shen@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "leah_wheeler@yarrowgate_investment.onyx.app"
    }
  ]
}