{
  "id": "FIREFLIES_7741164",
  "semantic_identifier": "7741164 - Highridge Data Services - sales_pitch - Discussion with Tatum Green",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-11-29 00:00:00",
  "metadata": {
    "meeting_date": "2025-11-29 00:00:00",
    "duration_min": "40"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-11"
      ],
      "year_month": "2025-11",
      "meeting_title": "7741164 - Highridge Data Services - sales_pitch - Discussion with Tatum Green",
      "organizer_email": "irene_shen@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Irene Shen: Hi Tatum—this is Irene Shen. Thanks for taking a few minutes. I work with teams that are trying to get sharper on who their best customers really are and then turn that into a clear ICP and messaging. Does that match what you’re focused on at Highridge Data Services right now?",
      "link": "https://www.onyx.app/9053777-1"
    },
    {
      "text": "Tatum Green: Hi Irene. Yeah, it does. We’ve been debating ICP a lot lately, especially between a couple segments, and it’s hard to get everyone aligned.",
      "link": "https://www.onyx.app/9053777-2"
    },
    {
      "text": "Irene Shen: Totally get it. The quick reason I called is to share what Customer_Analyzer does and see if it’s worth a deeper session. In short, we ingest the customer signals you already have—CRM fields, onboarding surveys, product usage, support tickets, even interview notes—and we turn that into two things. First is a fit score, 0 to 100, at the account and segment level. Second is a breakdown of why a segment is high or low fit, so it’s not a black box.",
      "link": "https://www.onyx.app/9053777-3"
    },
    {
      "text": "Tatum Green: Okay. When you say “fit,” do you mean like likelihood to buy, or likelihood to retain, or…?",
      "link": "https://www.onyx.app/9053777-4"
    },
    {
      "text": "Irene Shen: Great question—fit in our model is how well a customer segment matches your product’s current strengths, based on the outcomes you care about. Most teams start with a blend of conversion plus retention/expansion, and then we weight drivers accordingly. For example: firmographics like industry and size, technographics, problem severity, time-to-value, adoption patterns, support burden, and churn-risk signals. You can define those drivers, or we can start with templates and tune from there.",
      "link": "https://www.onyx.app/9053777-5"
    },
    {
      "text": "Tatum Green: That sounds relevant. We have plenty of data, but it’s messy and the conclusions get political fast.",
      "link": "https://www.onyx.app/9053777-6"
    },
    {
      "text": "Irene Shen: Exactly the pain we’re built for. The “political” part usually happens because everyone can cherry-pick examples. With Customer_Analyzer, you get segment comparisons side-by-side—say SMB versus mid-market, or healthcare versus logistics—with a driver breakdown that shows, “Here’s why mid-market looks stronger: faster time-to-value, higher weekly active usage, lower support burden,” or the opposite. Then it recommends an ICP profile based on observed outcomes like retention and expansion.",
      "link": "https://www.onyx.app/9053777-7"
    },
    {
      "text": "Tatum Green: How hard is it to set up? We’re pretty lean and I don’t have cycles for a huge implementation.",
      "link": "https://www.onyx.app/9053777-8"
    },
    {
      "text": "Irene Shen: Setup is intentionally lightweight. For a first pass, we usually start with CRM fields plus one behavioral source—product usage events if you have them, or support ticket data if that’s more accessible. The point is to get to a credible initial fit scoring model quickly, then iterate. In a deeper call, we’d map the signals you already track and pick, say, 8–12 fit drivers that are most predictive for your business.",
      "link": "https://www.onyx.app/9053777-9"
    },
    {
      "text": "Tatum Green: We do have product usage events and our support tickets in Zendesk. CRM is Salesforce. But I’m still trying to picture the output. Is it like a dashboard?",
      "link": "https://www.onyx.app/9053777-10"
    },
    {
      "text": "Irene Shen: Yes—dashboard and downloadable outputs. You’d see a fit score per account and rollups per segment, plus the driver breakdown. A lot of product leaders use it for product planning: identify high-fit customers with unmet needs to guide roadmap bets. So instead of “loudest customer wins,” it becomes “highest-fit segment is asking for X, and it correlates with expansion, so let’s prioritize that.”",
      "link": "https://www.onyx.app/9053777-11"
    },
    {
      "text": "Tatum Green: That product planning angle is interesting. We’re about to do roadmap planning, and there’s a lot of disagreement on whether we should build deeper features for our current base or chase a new segment.",
      "link": "https://www.onyx.app/9053777-12"
    },
    {
      "text": "Irene Shen: That’s a perfect use case. In practice, we’ll often uncover something like: Segment A has decent conversion but high support burden and churn risk, while Segment B has slightly slower sales cycles but much higher retention and expansion once adopted. Then you can make a roadmap bet with clearer tradeoffs. And because the model shows the “why,” you can bring it to the exec team and say, “Here are the drivers—time-to-value, adoption, support load—this isn’t just intuition.”",
      "link": "https://www.onyx.app/9053777-13"
    },
    {
      "text": "Tatum Green: How do you handle situations where we don’t have consistent data for every account? Like, some accounts have clean onboarding survey data, others don’t.",
      "link": "https://www.onyx.app/9053777-14"
    },
    {
      "text": "Irene Shen: Very common. We treat signals as optional inputs and quantify confidence. If onboarding surveys are missing for half your accounts, we won’t pretend we know that driver everywhere. You can still get a reliable model from the signals that are consistently present—like firmographics, usage patterns, ticket volume, and renewal outcomes—and then add the other signals as coverage improves.",
      "link": "https://www.onyx.app/9053777-15"
    },
    {
      "text": "Tatum Green: Got it. And is this mostly for sales, or product, or marketing?",
      "link": "https://www.onyx.app/9053777-16"
    },
    {
      "text": "Irene Shen: It’s cross-functional, but the first “home” tends to be product or growth because you’re trying to answer, “Who should we build for?” and “Where do we win?” Then marketing uses the recommended ICP and driver insights to sharpen positioning and proof points. Sales uses it to prioritize accounts and handle objections. But to keep it simple for today: if you’re heading into roadmap planning and you need evidence on which segment is truly high-fit, the fit estimation and driver breakdown are usually the fastest win.",
      "link": "https://www.onyx.app/9053777-17"
    },
    {
      "text": "Tatum Green: That’s resonating. What would you need from us to show something meaningful? I’m cautious about tools that promise insight but need a ton of custom work.",
      "link": "https://www.onyx.app/9053777-18"
    },
    {
      "text": "Irene Shen: Fair. For a meaningful first demo tailored to Highridge, we don’t need a full integration on day one. On a follow-up call, we can do a quick discovery: what segments you’re debating, what outcomes matter most—renewal, expansion, speed to value—and what data sources are available. If you’re open to it, we can also use a small sample export—like a Salesforce report plus a usage summary and a support ticket rollup—to illustrate how the fit scoring and segment comparison would look. No heavy lift, just enough to ground the conversation.",
      "link": "https://www.onyx.app/9053777-19"
    },
    {
      "text": "Tatum Green: Okay. And what does “recommended ICP profile” actually include? Is it just a description, or something actionable?",
      "link": "https://www.onyx.app/9053777-20"
    },
    {
      "text": "Irene Shen: Actionable. It’s essentially a profile of the segment and the drivers that make them successful with your product—industry, size bands, typical tech stack indicators if you have them, problem severity proxies, adoption thresholds, and early behaviors that predict retention. The goal is you can hand it to marketing and sales and say, “This is who we’re targeting, and these are the measurable signals that indicate fit.” It helps reduce the “everyone has their own ICP definition” problem.",
      "link": "https://www.onyx.app/9053777-21"
    },
    {
      "text": "Tatum Green: That would help. Right now our “ICP” is basically a slide from two years ago and a bunch of tribal knowledge.",
      "link": "https://www.onyx.app/9053777-22"
    },
    {
      "text": "Irene Shen: You’re not alone. One more quick question so I can gauge fit: when you think about your best customers—ones that renew and expand—do you already have a sense of what’s different about them? Or is that still murky?",
      "link": "https://www.onyx.app/9053777-23"
    },
    {
      "text": "Tatum Green: We have hypotheses. We think customers with faster onboarding and higher weekly usage are better, but we haven’t quantified it. And support load is a big wildcard—some segments are just much harder.",
      "link": "https://www.onyx.app/9053777-24"
    },
    {
      "text": "Irene Shen: Perfect. Those are exactly the kinds of drivers the fit estimation model captures—time-to-value, adoption patterns, and support burden—and then it ties them back to outcomes like retention and expansion. So instead of “we think,” you get “accounts with these patterns score 80+ and expand 2x,” or “this segment looks attractive on paper but scores low because support burden is killing margins and retention.”",
      "link": "https://www.onyx.app/9053777-25"
    },
    {
      "text": "Tatum Green: Makes sense. So what would the next step be?",
      "link": "https://www.onyx.app/9053777-26"
    },
    {
      "text": "Irene Shen: I’d suggest a 30–45 minute working session next week. You, maybe one person from RevOps or whoever owns Salesforce reporting, and I can walk you through a sample fit scoring framework, map your key segments, and define the first set of drivers. If it still feels compelling, we can talk about the lightest path to getting a pilot going for roadmap planning.",
      "link": "https://www.onyx.app/9053777-27"
    },
    {
      "text": "Tatum Green: Yeah, I’m open to that. Next week is better. Can you do Wednesday afternoon?",
      "link": "https://www.onyx.app/9053777-28"
    },
    {
      "text": "Irene Shen: Wednesday works. How about 2:00 PM your time? I’ll send a calendar invite with a short agenda: segments under debate, outcomes to optimize, available data signals, and what a first fit score and driver breakdown would look like for Highridge.",
      "link": "https://www.onyx.app/9053777-29"
    },
    {
      "text": "Tatum Green: 2:00 is good. Send it over. If you can include what you’d need from our side ahead of time, that would help.",
      "link": "https://www.onyx.app/9053777-30"
    },
    {
      "text": "Irene Shen: Absolutely. I’ll keep it minimal—likely a Salesforce report export and a quick summary of usage and ticket fields you track, even if it’s just field names. Thanks, Tatum—looking forward to digging in Wednesday.",
      "link": "https://www.onyx.app/9053777-31"
    },
    {
      "text": "Tatum Green: Sounds good. Talk then.",
      "link": "https://www.onyx.app/9053777-32"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "irene_shen@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "tatum_green@highridge_data_services.onyx.app"
    }
  ]
}