{
  "id": "FIREFLIES_7746170",
  "semantic_identifier": "7746170 - Novafathom Analytics - sales_pitch - Discussion with Isabel Patel",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-11-12 00:00:00",
  "metadata": {
    "meeting_date": "2025-11-12 00:00:00",
    "duration_min": "28"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-11"
      ],
      "year_month": "2025-11",
      "meeting_title": "7746170 - Novafathom Analytics - sales_pitch - Discussion with Isabel Patel",
      "organizer_email": "mina_park@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Mina Park: Hi Isabel—Mina Park here. Thanks for taking a few minutes. I work with revenue teams that are already on Salesforce or HubSpot but want a practical layer on top that tells reps what to do next, deal by deal, so pipeline doesn’t stall. Does that map to anything you’re feeling at Novafathom Analytics right now?",
      "link": "https://www.onyx.app/8264660-1"
    },
    {
      "text": "Isabel Patel: Hi Mina. Yes, it does. We’re growing, and consistency is a struggle—especially around follow-up after discovery and keeping deals moving without me constantly chasing updates.",
      "link": "https://www.onyx.app/8264660-2"
    },
    {
      "text": "Mina Park: That’s exactly the gap Sales_Accelerator is built for. It’s a sales execution layer that sits on top of your CRM and turns what you already know about accounts into action: it recommends next steps per opportunity, nudges reps when something’s at risk, and standardizes the behaviors that top performers do without forcing a rigid methodology. Quick question—what does “good follow-up” look like today after a discovery call?",
      "link": "https://www.onyx.app/8264660-3"
    },
    {
      "text": "Isabel Patel: Ideally, a recap email goes out the same day with next steps, stakeholders, timelines… but in reality, it’s uneven. Some AEs are great; others send something vague days later. And mutual plans are kind of ad hoc.",
      "link": "https://www.onyx.app/8264660-4"
    },
    {
      "text": "Mina Park: Makes sense. One area customers see immediate lift is our sales_followup_recommendations. After a discovery meeting, Sales_Accelerator detects that a meeting happened but there’s no clear follow-up logged, and it prompts the AE with a recommended action: draft a recap email, propose specific next steps, and create a mutual action plan—owners, due dates, and who needs to be involved. It also flags when you’re single-threaded, so if only one contact is active, it suggests multi-threading and gives a sequence suggestion—like a short cadence across email and LinkedIn over a few days—to pull in the right stakeholders.",
      "link": "https://www.onyx.app/8264660-5"
    },
    {
      "text": "Isabel Patel: That sounds helpful. How does it know what proof points or messaging to use? We’ve been trying to standardize positioning, but we don’t want reps making things up.",
      "link": "https://www.onyx.app/8264660-6"
    },
    {
      "text": "Mina Park: Great constraint, and we designed for that. Sales_Accelerator doesn’t ask reps to invent messaging; it pulls from your approved positioning blocks and fit insights—especially if you’re already using Customer_Analyzer. So when the AE is writing the recap, it can suggest two tailored proof points from that approved library based on the account’s fit score and the pains you’ve tagged. The end result is reps move faster, but it’s still consistent and explainable—no random “AI copy” that doesn’t match how you sell.",
      "link": "https://www.onyx.app/8264660-7"
    },
    {
      "text": "Isabel Patel: We do have Customer_Analyzer in place for fit scoring and some messaging. Adoption is decent with ops, mixed with the reps. I’m cautious about adding another tool they ignore.",
      "link": "https://www.onyx.app/8264660-8"
    },
    {
      "text": "Mina Park: Totally fair. Two things that help adoption: first, it lives where reps already work—inside the CRM or via a lightweight extension—so it’s not “yet another tab.” Second, we make it a task queue that’s hard to ignore but easy to act on: “Send recap + next steps,” “Add stakeholder,” “Build mutual plan checklist,” that kind of thing. It’s less about dashboards and more about a daily workflow that saves them time. If I asked your AEs what eats the most time post-discovery, what would they say?",
      "link": "https://www.onyx.app/8264660-9"
    },
    {
      "text": "Isabel Patel: Chasing internal info, figuring out who else to loop in on the customer side, and remembering to send something that feels customized without spending an hour on it.",
      "link": "https://www.onyx.app/8264660-10"
    },
    {
      "text": "Mina Park: That lines up well. In the follow-up recommendation, the system checks who’s engaged so far and what’s missing in the mutual plan. If there’s no procurement or technical evaluator identified—depending on your deal type—it prompts that and suggests an outreach sequence to bring them in. And for customization, it’s not writing a novel; it’s drafting a crisp recap email with placeholders and recommended proof points so the rep can send it in minutes. The goal is fewer “we’ll get back to you” dead ends and fewer deals slipping because next steps weren’t concrete.",
      "link": "https://www.onyx.app/8264660-11"
    },
    {
      "text": "Isabel Patel: What about managers? I’m in RevOps, but our sales leaders want forecasting confidence and early warnings. Does this help them, or is it rep-only?",
      "link": "https://www.onyx.app/8264660-12"
    },
    {
      "text": "Mina Park: It helps both, but we can keep today focused on follow-up since that’s your pain. The same signals that drive the rep’s next action—no follow-up after a meeting, mutual plan incomplete, single-threading, low recent activity—also roll up as risk alerts for managers. So instead of “update your CRM,” leaders see “These five deals are at risk because there’s no next meeting scheduled and only one stakeholder engaged.” It’s actionable, not just a red/yellow/green score.",
      "link": "https://www.onyx.app/8264660-13"
    },
    {
      "text": "Isabel Patel: Got it. How hard is setup if we’re already using Salesforce and Customer_Analyzer? I don’t have appetite for a six-month implementation.",
      "link": "https://www.onyx.app/8264660-14"
    },
    {
      "text": "Mina Park: Understood. Typically the fastest path is: connect Salesforce, connect Customer_Analyzer so we can consume fit scores and positioning blocks, then define your stages and what “done” looks like for a mutual action plan at each stage. From there, we pilot with a small AE group—say 5–10 reps—focused on one motion, like post-discovery follow-up for mid-market. You’ll know quickly if it’s improving follow-up speed and multi-threading rates.",
      "link": "https://www.onyx.app/8264660-15"
    },
    {
      "text": "Isabel Patel: If we ran a pilot, what would you measure to prove it’s working?",
      "link": "https://www.onyx.app/8264660-16"
    },
    {
      "text": "Mina Park: For the use case you described, I’d suggest a simple set: time-to-follow-up after discovery, percentage of opportunities with a documented mutual action plan within X days, stakeholder count per opp (to track multi-threading), and stage conversion from discovery to next stage. We can also look at stall rate—how many opps go dark for, say, 14 days without activity. If those move in the right direction, it’s usually a clear signal.",
      "link": "https://www.onyx.app/8264660-17"
    },
    {
      "text": "Isabel Patel: That’s reasonable. I’d want our sales director involved, and maybe one frontline manager who can give feedback from the reps.",
      "link": "https://www.onyx.app/8264660-18"
    },
    {
      "text": "Mina Park: Perfect. What I’d propose is a longer working session—30 to 45 minutes—where I can show exactly what the follow-up recommendations look like inside Salesforce, including the recap email draft, the proof point insertion from your approved library, and how the mutual action plan checklist gets created with due dates. Then we can talk through a pilot plan and success metrics with your sales director and that manager. Does next week work?",
      "link": "https://www.onyx.app/8264660-19"
    },
    {
      "text": "Isabel Patel: Yes, next week is fine. Tuesday or Wednesday afternoon would be best.",
      "link": "https://www.onyx.app/8264660-20"
    },
    {
      "text": "Mina Park: Great—how about Tuesday at 2:00 PM your time for 45 minutes? If you send me the names of the sales director and the manager you want on, I’ll include them, and I’ll tailor the demo to your discovery-to-proposal motion.",
      "link": "https://www.onyx.app/8264660-21"
    },
    {
      "text": "Isabel Patel: Tuesday at 2 works. I’ll add our Sales Director, Jason, and our Mid-Market Manager, Lina. Send me the invite and what you need from us beforehand.",
      "link": "https://www.onyx.app/8264660-22"
    },
    {
      "text": "Mina Park: Will do. I’ll send a calendar invite for Tuesday at 2 with a short pre-read—just a couple questions on your stages and what you consider a “complete” next-step after discovery. Thanks, Isabel—looking forward to showing you how this can make follow-up consistent without adding busywork.",
      "link": "https://www.onyx.app/8264660-23"
    },
    {
      "text": "Isabel Patel: Sounds good. Thanks, Mina.",
      "link": "https://www.onyx.app/8264660-24"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mina_park@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "isabel_patel@novafathom_analytics.onyx.app"
    }
  ]
}