{
  "id": "FIREFLIES_7924918",
  "semantic_identifier": "7924918 - Starfall Terra Analytics - buy - Discussion with Audrey Rogers",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-11-24 00:00:00",
  "metadata": {
    "meeting_date": "2025-11-24 00:00:00",
    "duration_min": "29"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-11"
      ],
      "year_month": "2025-11",
      "meeting_title": "7924918 - Starfall Terra Analytics - buy - Discussion with Audrey Rogers",
      "organizer_email": "arjun_mehta@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Arjun Mehta: Hey Audrey—good to see you again. Since this is our third call, I wanted to focus on what it would take to get Customer_Analyzer approved this week, and make sure we’re not glossing over any blockers. Does that work?",
      "link": "https://www.onyx.app/7846761-1"
    },
    {
      "text": "Audrey Rogers: Yeah, that works. We’re still interested, but we’re also trying to be realistic about effort and whether it’ll actually be trusted internally.",
      "link": "https://www.onyx.app/7846761-2"
    },
    {
      "text": "Arjun Mehta: Totally fair. Let me frame today around two things: first, how Customer_Analyzer helps your product planning team identify high‑fit customers with unmet needs for roadmap bets; second, how the positioning recommendations turn that into usable messaging for sales and marketing. And then we’ll decide if the timing is right. Sound okay?",
      "link": "https://www.onyx.app/7846761-3"
    },
    {
      "text": "Audrey Rogers: Yep. The value is clear in theory. The concern is whether the inputs are solid enough—our CRM isn’t exactly pristine.",
      "link": "https://www.onyx.app/7846761-4"
    },
    {
      "text": "Arjun Mehta: That’s the right place to dig in. On the product planning side, the core output is the fit score by segment—so you can see, for example, “this industry + company size + workflow pattern” is disproportionately successful and sticks around, versus “this other segment churns or never activates.” But the fit score quality depends on signals: CRM fields, onboarding surveys, usage events, support tickets, notes—whatever you can provide.",
      "link": "https://www.onyx.app/7846761-5"
    },
    {
      "text": "Audrey Rogers: Right, and our issue is we have missing fields and inconsistent tagging. We’ve got Salesforce fields that reps don’t always fill in, and product events are decent but not mapped cleanly to customer outcomes.",
      "link": "https://www.onyx.app/7846761-6"
    },
    {
      "text": "Arjun Mehta: Understood. Two things we do to mitigate that. First, we don’t rely on one source—so sparse CRM can be offset by stronger product usage and support patterns. Second, we show the “fit drivers” and evidence behind the score. So instead of a black box, you can see what’s contributing: activation time, retention behaviors, ticket themes, survey language—whatever is present. That way, even if the score isn’t perfect on day one, teams can decide if it’s directionally trustworthy.",
      "link": "https://www.onyx.app/7846761-7"
    },
    {
      "text": "Audrey Rogers: But if leadership sees a score and then asks, “based on what?” we’d need to defend it. And honestly, we’re not confident we can.",
      "link": "https://www.onyx.app/7846761-8"
    },
    {
      "text": "Arjun Mehta: That’s where the positioning recommendation feature helps too, because it explicitly links messaging back to the drivers and evidence used. For a prioritized segment, it generates an editable block: segment‑specific value prop, top use cases, differentiators, proof points to collect, pricing/value framing notes, and an objection-handling playbook. And each line ties back to actual observed customer language—support tickets, interview notes, survey responses.",
      "link": "https://www.onyx.app/7846761-9"
    },
    {
      "text": "Audrey Rogers: The messaging blocks were compelling when you demoed them. But it still assumes the underlying data is captured consistently.",
      "link": "https://www.onyx.app/7846761-10"
    },
    {
      "text": "Arjun Mehta: It assumes “enough” data to start, and then it improves as data improves. In your case, I was thinking we start narrow: pick one segment you already suspect is high-fit, and one you suspect is noisy or low-fit. We can run Customer_Analyzer against those with the data you have, generate positioning for the high-fit segment, and use the proof-points list to systematically fill gaps—like “collect 3 quotes about X objection,” or “track Y usage event.”",
      "link": "https://www.onyx.app/7846761-11"
    },
    {
      "text": "Audrey Rogers: That sounds like a project, though. We’re lean. I’m trying not to sign us up for something that requires a big data cleanup.",
      "link": "https://www.onyx.app/7846761-12"
    },
    {
      "text": "Arjun Mehta: I hear you. Let me be concrete on effort. For onboarding, we typically need: a CRM export with whatever fields you trust, a mapping to accounts, and a product events feed—or even a weekly export to start. If you don’t have clean tags, we can still create a basic segment model with what’s there, and flag confidence levels. But yes—if fields are missing, scoring accuracy drops.",
      "link": "https://www.onyx.app/7846761-13"
    },
    {
      "text": "Audrey Rogers: That’s the thing. Our segments aren’t well-defined, and the fields we’d need to define them are the exact ones missing. Industry is wrong half the time, and “use case” is free text. We could fix it, but that’s not happening this quarter.",
      "link": "https://www.onyx.app/7846761-14"
    },
    {
      "text": "Arjun Mehta: If industry is unreliable, we can segment on behaviors and outcomes instead—activation path, feature adoption patterns, support themes. Would that be more stable for you?",
      "link": "https://www.onyx.app/7846761-15"
    },
    {
      "text": "Audrey Rogers: Somewhat. But we also have multiple products and the tracking differs. I’m worried we’d spend a month integrating and then get a “maybe” answer that doesn’t change decisions.",
      "link": "https://www.onyx.app/7846761-16"
    },
    {
      "text": "Arjun Mehta: Got it. Let me ask: what decision do you want Customer_Analyzer to influence in the next 60 days? Is it a roadmap bet, a packaging/pricing move, a segment focus for pipeline?",
      "link": "https://www.onyx.app/7846761-17"
    },
    {
      "text": "Audrey Rogers: Roadmap. Specifically: which customer type we should build deeper integrations for. We don’t want to over-invest for a segment that’s loud but not sticky.",
      "link": "https://www.onyx.app/7846761-18"
    },
    {
      "text": "Arjun Mehta: Perfect use case. The way teams use the fit score here is to identify: “these customers have unmet needs in integrations, they retain, and they expand,” versus “they ask for integrations but churn.” Then positioning recommendations help sales stop over-promising by arming them with segment-specific language and objection handling—so the roadmap bet and the narrative align.",
      "link": "https://www.onyx.app/7846761-19"
    },
    {
      "text": "Audrey Rogers: That’s what we want. But again, I don’t think our data can separate “loud” from “sticky” cleanly. Churn reasons are messy, and support tickets aren’t tagged.",
      "link": "https://www.onyx.app/7846761-20"
    },
    {
      "text": "Arjun Mehta: If support tickets aren’t tagged, we can still do text-based clustering from ticket content—no tags required. Same with interview notes. Do you have those in a consistent place?",
      "link": "https://www.onyx.app/7846761-21"
    },
    {
      "text": "Audrey Rogers: Zendesk has the raw text, yes. Interview notes are in Notion and Google Docs. It’s not structured.",
      "link": "https://www.onyx.app/7846761-22"
    },
    {
      "text": "Arjun Mehta: That’s actually workable for the positioning side because we’re looking for observed language—phrases customers use, objections, and what outcomes they care about. But for the fit score, we still need a stable identifier across systems and some reliable outcome signals—retention, expansion, product adoption milestones.",
      "link": "https://www.onyx.app/7846761-23"
    },
    {
      "text": "Audrey Rogers: Our account IDs don’t line up cleanly between Salesforce and product analytics. We’ve been meaning to fix that, but it’s not done.",
      "link": "https://www.onyx.app/7846761-24"
    },
    {
      "text": "Arjun Mehta: Okay—that’s a real blocker for scoring accuracy. We can do a light reconciliation, but if IDs are inconsistent, we’ll spend time just matching accounts. And if the fit score is the centerpiece for your roadmap decision, you don’t want shaky foundations.",
      "link": "https://www.onyx.app/7846761-25"
    },
    {
      "text": "Audrey Rogers: Exactly. I can’t take this to our VP and say, “trust the score,” when we know the mapping is messy.",
      "link": "https://www.onyx.app/7846761-26"
    },
    {
      "text": "Arjun Mehta: Understood. Let’s talk decision process then. If we could get you comfortable with a scoped pilot—say, 30 days, one product line, limited segment model—would you have budget authority to start now, or would it still require a larger internal alignment?",
      "link": "https://www.onyx.app/7846761-27"
    },
    {
      "text": "Audrey Rogers: Budget isn’t the main issue. It’s credibility and timing. We’re already mid-planning for next quarter, and we don’t have the data plumbing fixed. If we start now, I’ll own the outcome—and I’m not confident it’ll land.",
      "link": "https://www.onyx.app/7846761-28"
    },
    {
      "text": "Arjun Mehta: I appreciate the candor. The last thing I want is to sell you something you can’t operationalize yet. One option: we shift the initial goal away from the fit score and toward positioning recommendations only—generate messaging blocks for the segments you already believe in, using Zendesk + notes + surveys, and create a proof-point collection plan. That could still help sales and marketing quickly.",
      "link": "https://www.onyx.app/7846761-29"
    },
    {
      "text": "Audrey Rogers: That’s interesting, but it’s not the problem I’m tasked with solving right now. My priority is making a defensible roadmap call.",
      "link": "https://www.onyx.app/7846761-30"
    },
    {
      "text": "Arjun Mehta: Makes sense. And for that, you’re saying the limiting factor is data quality: missing CRM fields, inconsistent tags, and poor account ID alignment—so scoring accuracy would be questioned.",
      "link": "https://www.onyx.app/7846761-31"
    },
    {
      "text": "Audrey Rogers: Yes. If we had clean account matching and a few consistent fields, I’d be much closer. But we don’t.",
      "link": "https://www.onyx.app/7846761-32"
    },
    {
      "text": "Arjun Mehta: Given that, pushing for a purchase today feels misaligned. What I’d propose instead is a “readiness plan” you can use internally: the minimum set of fields and mappings needed to get reliable scoring, plus a lightweight way to improve signal quality without a massive cleanup. Then we reconvene when that’s underway.",
      "link": "https://www.onyx.app/7846761-33"
    },
    {
      "text": "Audrey Rogers: That would be helpful. Because I do like the product. I just can’t justify buying it before we fix the basics.",
      "link": "https://www.onyx.app/7846761-34"
    },
    {
      "text": "Arjun Mehta: Totally fair. If we did that, what timeline would be realistic for you to have the account ID alignment and a handful of key fields in place? Is that a Q2 thing? Later?",
      "link": "https://www.onyx.app/7846761-35"
    },
    {
      "text": "Audrey Rogers: Probably Q2. We have an internal data project slated, but it’s not staffed until March.",
      "link": "https://www.onyx.app/7846761-36"
    },
    {
      "text": "Arjun Mehta: Okay. Here’s what I’ll do: I’ll send a one-pager after this call outlining (1) the minimum viable inputs for fit scoring you’d need for roadmap-grade confidence, (2) options to use Customer_Analyzer in a lighter way in the meantime if priorities shift, and (3) a suggested pilot scope once your ID mapping is fixed. Would you be open to penciling a follow-up for late March?",
      "link": "https://www.onyx.app/7846761-37"
    },
    {
      "text": "Audrey Rogers: Yes, let’s do late March. And send that readiness one-pager—make it very specific so I can forward it to our data lead.",
      "link": "https://www.onyx.app/7846761-38"
    },
    {
      "text": "Arjun Mehta: Will do. Last quick check: is there anything else preventing a “yes later,” like security review concerns, procurement, or stakeholder skepticism?",
      "link": "https://www.onyx.app/7846761-39"
    },
    {
      "text": "Audrey Rogers: Security is fine—we’ve done similar tools. Stakeholders are skeptical of “AI scoring,” but if we can show drivers and evidence like you said, that’ll help. The gating item is still data.",
      "link": "https://www.onyx.app/7846761-40"
    },
    {
      "text": "Arjun Mehta: Got it. I’ll tailor the doc to address that skepticism too—how the fit drivers and evidence trail works, and what “confidence” looks like when fields are missing. Thanks, Audrey. I’ll follow up today with the doc and a calendar hold for late March.",
      "link": "https://www.onyx.app/7846761-41"
    },
    {
      "text": "Audrey Rogers: Sounds good. Thanks, Arjun.",
      "link": "https://www.onyx.app/7846761-42"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "arjun_mehta@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "audrey_rogers@starfall_terra_analytics.onyx.app"
    }
  ]
}