{
  "id": "FIREFLIES_8040380",
  "semantic_identifier": "8040380 - Hilltop Orion Real Estate - sales_pitch - Discussion with Daniela Rojas",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-11-14 00:00:00",
  "metadata": {
    "meeting_date": "2025-11-14 00:00:00",
    "duration_min": "17"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-11"
      ],
      "year_month": "2025-11",
      "meeting_title": "8040380 - Hilltop Orion Real Estate - sales_pitch - Discussion with Daniela Rojas",
      "organizer_email": "megan_foster@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Megan Foster: Hi Daniela—Megan Foster calling. Did I catch you with a quick five minutes?",
      "link": "https://www.onyx.app/9026374-1"
    },
    {
      "text": "Daniela Rojas: Hi Megan. I have about three minutes—what’s this about?",
      "link": "https://www.onyx.app/9026374-2"
    },
    {
      "text": "Megan Foster: Totally fair. I’ll keep it tight. I’m reaching out because we work with product and marketing teams that are trying to get clearer on which customer segments are actually their best fit—so they can tighten messaging and stop wasting cycles on the wrong prospects. Our product is called Customer_Analyzer.",
      "link": "https://www.onyx.app/9026374-3"
    },
    {
      "text": "Daniela Rojas: Okay. We’re in real estate—what does it do exactly?",
      "link": "https://www.onyx.app/9026374-4"
    },
    {
      "text": "Megan Foster: Customer_Analyzer pulls together customer signals you already have—CRM fields, onboarding questions, product usage events, support tickets, even interview notes—and turns them into a simple fit score by account and by segment. It’s a 0–100 score, plus a breakdown of why a segment is high or low fit.",
      "link": "https://www.onyx.app/9026374-5"
    },
    {
      "text": "Daniela Rojas: We already have CRM reports and dashboards. How is this different from what we can do internally?",
      "link": "https://www.onyx.app/9026374-6"
    },
    {
      "text": "Megan Foster: Great question. Most dashboards show activity. This is geared toward decision-making: “Which segment should we prioritize and how should we talk to them?” The fit estimation looks at drivers like industry/size, problem severity, time-to-value, adoption patterns, support burden, and churn risk signals—then compares segments side-by-side. So you can see, for example, “Segment A converts but churns,” versus “Segment B takes longer to onboard but expands.”",
      "link": "https://www.onyx.app/9026374-7"
    },
    {
      "text": "Daniela Rojas: We’re not a SaaS company selling into segments like that. We serve different buyer types, but it’s not SMB versus mid-market in a classic way.",
      "link": "https://www.onyx.app/9026374-8"
    },
    {
      "text": "Megan Foster: That makes sense—and you can define segments however you want: property managers vs brokers vs investors, enterprise groups vs independents, or even by region or portfolio size. One common use case is creating segment-specific landing pages and outbound messaging for two ICP tiers—like “smaller operators” versus “larger portfolios”—with different value props and proof points.",
      "link": "https://www.onyx.app/9026374-9"
    },
    {
      "text": "Daniela Rojas: We’re not really doing outbound right now, and our website messaging isn’t the bottleneck. Leads are fine.",
      "link": "https://www.onyx.app/9026374-10"
    },
    {
      "text": "Megan Foster: Got it. When you say “leads are fine,” is the bigger issue conversion later in the funnel—or retention—once you bring on clients?",
      "link": "https://www.onyx.app/9026374-11"
    },
    {
      "text": "Daniela Rojas: Honestly, neither is a crisis. We have some churn, like everyone, but we’re in the middle of a website refresh and some internal changes. Not looking to add tools.",
      "link": "https://www.onyx.app/9026374-12"
    },
    {
      "text": "Megan Foster: Completely understand. Let me connect it to a tangible outcome: the fit score helps you identify which customer types are most likely to succeed and stick—so you can focus acquisition on them and adjust expectations for the rest. It also shows a driver breakdown, so you can see what’s hurting fit—like longer time-to-value or higher support burden—and align marketing and operations around that.",
      "link": "https://www.onyx.app/9026374-13"
    },
    {
      "text": "Daniela Rojas: That sounds interesting, but I’m not sure we have the data to support something like that. Our “signals” are messy.",
      "link": "https://www.onyx.app/9026374-14"
    },
    {
      "text": "Megan Foster: That’s pretty common. We can start with whatever you have—CRM fields and a few simple outcome metrics like retention, renewal likelihood, expansion, even qualitative tags from support tickets. The model isn’t asking for perfection on day one; it’s looking for patterns. Then you get segment comparisons and a recommended ICP profile based on observed outcomes.",
      "link": "https://www.onyx.app/9026374-15"
    },
    {
      "text": "Daniela Rojas: Who on our side would even own this? Marketing is stretched, and sales is focused on relationships.",
      "link": "https://www.onyx.app/9026374-16"
    },
    {
      "text": "Megan Foster: Usually it’s a marketing ops or RevOps owner, sometimes product marketing. But it can be lightweight—one way we start is with a quick segment comparison: pick two or three customer groups you already talk about internally, score them, and use the output to sanity-check your positioning and prioritization.",
      "link": "https://www.onyx.app/9026374-17"
    },
    {
      "text": "Daniela Rojas: We don’t really have RevOps. And to be candid, we’ve been burned by “AI insights” tools that take a lot of setup and then tell us what we already know.",
      "link": "https://www.onyx.app/9026374-18"
    },
    {
      "text": "Megan Foster: I hear you. The goal isn’t a black box. The fit estimation is explainable: you get the “why” behind the score—driver breakdown, what’s pulling it up or down—and you can adjust the fit drivers. If the output is telling you something obvious, that’s useful too because it documents it and makes it actionable across teams.",
      "link": "https://www.onyx.app/9026374-19"
    },
    {
      "text": "Daniela Rojas: Maybe, but I’m not planning to launch new segment landing pages or redo messaging beyond the current refresh. And I don’t have budget this quarter.",
      "link": "https://www.onyx.app/9026374-20"
    },
    {
      "text": "Megan Foster: Understood. If budget and bandwidth are tight, the best next step might just be a short discovery to see if there’s a clear win—like reducing churn by avoiding low-fit customers, or improving close rates by tailoring the narrative for two buyer types. Would you be open to a 20-minute call next week to see if it’s relevant at all?",
      "link": "https://www.onyx.app/9026374-21"
    },
    {
      "text": "Daniela Rojas: Not next week. We’re slammed, and this doesn’t feel urgent.",
      "link": "https://www.onyx.app/9026374-22"
    },
    {
      "text": "Megan Foster: That’s fair. Is there a better time—maybe after the website refresh is done? Or is this more of a “not this year” kind of thing?",
      "link": "https://www.onyx.app/9026374-23"
    },
    {
      "text": "Daniela Rojas: Probably not this year. We’re keeping the stack stable until we finish a few internal projects. I can’t take on evaluating new software right now.",
      "link": "https://www.onyx.app/9026374-24"
    },
    {
      "text": "Megan Foster: Totally respect that. Could I send you a one-pager that outlines the fit score output and an example of a segment comparison—so if priorities change, you have it handy?",
      "link": "https://www.onyx.app/9026374-25"
    },
    {
      "text": "Daniela Rojas: Sure, you can send it, but I can’t promise I’ll look at it soon.",
      "link": "https://www.onyx.app/9026374-26"
    },
    {
      "text": "Megan Foster: That’s completely okay. What’s the best email for you?",
      "link": "https://www.onyx.app/9026374-27"
    },
    {
      "text": "Daniela Rojas: daniela.rojas@hilltoporion.com.",
      "link": "https://www.onyx.app/9026374-28"
    },
    {
      "text": "Megan Foster: Perfect—thanks. I’ll send a short overview and include a quick example of how teams use it to separate two ICP tiers and tailor messaging. If it’s helpful later, would it be alright if I check back in a couple months?",
      "link": "https://www.onyx.app/9026374-29"
    },
    {
      "text": "Daniela Rojas: That’s fine. Just keep it brief.",
      "link": "https://www.onyx.app/9026374-30"
    },
    {
      "text": "Megan Foster: Will do. Thanks for the time today, Daniela.",
      "link": "https://www.onyx.app/9026374-31"
    },
    {
      "text": "Daniela Rojas: Thanks, Megan. Bye.",
      "link": "https://www.onyx.app/9026374-32"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "megan_foster@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "daniela_rojas@hilltop_orion_real_estate.onyx.app"
    }
  ]
}