{
  "id": "FIREFLIES_8425843",
  "semantic_identifier": "8425843 - Riverstone Aeroworks - sales_call - Discussion with Addison Simmons",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-11-07 00:00:00",
  "metadata": {
    "meeting_date": "2025-11-07 00:00:00",
    "duration_min": "22"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-11"
      ],
      "year_month": "2025-11",
      "meeting_title": "8425843 - Riverstone Aeroworks - sales_call - Discussion with Addison Simmons",
      "organizer_email": "megan_foster@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Megan Foster: Hi Addison—thanks again for making time. Last time you mentioned Riverstone Aeroworks is looking for something that helps the team act on pipeline insights, not just report on them. I wanted to focus today on Sales_Accelerator—specifically the forecasting layer and the “what to do next” guidance—so we can see if it’s something you’d actually roll out this quarter. Does that still match what you’re trying to solve?",
      "link": "https://www.onyx.app/3195382-1"
    },
    {
      "text": "Addison Simmons: Hi Megan. Yes, broadly. We’re definitely feeling pain around forecast reliability and end-of-quarter surprises. I’m open to hearing how you think you’d help, but I’m also cautious—our CRM data isn’t pristine.",
      "link": "https://www.onyx.app/3195382-2"
    },
    {
      "text": "Megan Foster: That’s helpful context, and I’m glad you called that out. The piece that generated interest last time was our sales_forecast capability—because it doesn’t just take CRM stage at face value. It blends stage + activity signals like recent emails/calls/meetings, stage age, whether there’s a next meeting scheduled, and optionally fit-tier weighting from Customer_Analyzer. The point is: it’s explainable and it flags why a deal is in commit versus best-case, so you can coach and correct early. How are you forecasting today—spreadsheet rollups, manager judgment, CRM reports?",
      "link": "https://www.onyx.app/3195382-3"
    },
    {
      "text": "Addison Simmons: A mix. CRM reports and then a lot of manager judgment. The issue is reps don’t always update close dates or next steps, and activities live in different tools. So forecasting becomes a debate, not a system.",
      "link": "https://www.onyx.app/3195382-4"
    },
    {
      "text": "Megan Foster: Understood. Two quick angles that tend to resonate for sales ops: first, pipeline forecasting that’s grounded in behavior—like “no customer touch in 14 days” or “stage age is double the benchmark,” which is often more predictive than a rep’s confidence. Second, bottleneck diagnostics—seeing stage-to-stage conversion by segment and rep, and where deals are stalling. In your world, do you have a consistent “stuck” stage? Like moving from discovery to evaluation, or evaluation to procurement?",
      "link": "https://www.onyx.app/3195382-5"
    },
    {
      "text": "Addison Simmons: Discovery to evaluation is messy. We also get hung up on security and compliance late, which causes slips. But I’m not sure a tool can fix the underlying process. And again—if stages are stale, the system will just shout at us constantly.",
      "link": "https://www.onyx.app/3195382-6"
    },
    {
      "text": "Megan Foster: Totally fair. On the bottleneck side, what we do is show conversion and slippage by stage, segment, and rep, and then recommend process adjustments—like pulling a security step earlier if that’s consistently the source of late-cycle slips. It’s not magic, but it makes the bottleneck visible and measurable. On the “shouting constantly” concern—alert fatigue is real. We tune risk signals so they’re tied to a few high-confidence drivers: stage age relative to your historical cycle time, last touch, and whether there’s a scheduled next meeting. And we can start with a limited set of alerts rather than everything at once.",
      "link": "https://www.onyx.app/3195382-7"
    },
    {
      "text": "Addison Simmons: Okay, but that tuning requires good baselines. We don’t have clean historical cycle-time benchmarks across teams. Different reps run different processes, and our segments aren’t consistently tagged. I’m worried we’d spend months cleaning data just to get basic value.",
      "link": "https://www.onyx.app/3195382-8"
    },
    {
      "text": "Megan Foster: That’s a key question: time-to-value. In most deployments, we start by using what you already have—stages, close dates, and activity metadata—and we layer in benchmarks gradually. Even if the historical data is imperfect, stage age plus “next meeting scheduled” and recency of customer engagement can still give you a meaningful risk view. And if you’re already using Customer_Analyzer, we can use those fit tiers as a weighting factor to make the forecast more realistic—so your Tier 1 ICP deals get treated differently than lower-fit pipeline.",
      "link": "https://www.onyx.app/3195382-9"
    },
    {
      "text": "Addison Simmons: We are using Customer_Analyzer, yes, but our team doesn’t always agree with the fit scores. Some AEs think the model is missing nuance, and they sometimes override it informally. If Sales_Accelerator depends on those scores, I’m not sure it’ll be trusted.",
      "link": "https://www.onyx.app/3195382-10"
    },
    {
      "text": "Megan Foster: It doesn’t have to depend on them—it can optionally use fit as one driver. The forecast remains explainable, so if a deal is being down-weighted due to low fit, that’s visible, and you can decide whether to include that driver. The bigger benefit I’d emphasize is consistency: instead of every manager using a different mental model, you get one system showing commit/best-case/pipeline with clear reasons. That usually reduces the “forecast meeting as argument” dynamic.",
      "link": "https://www.onyx.app/3195382-11"
    },
    {
      "text": "Addison Simmons: Consistency is appealing, but we’ve tried “one system” before. The reps see it as management oversight. Adoption becomes the issue, not the tooling. Also, we’re on HubSpot plus a couple of email tools—integrations have been painful historically.",
      "link": "https://www.onyx.app/3195382-12"
    },
    {
      "text": "Megan Foster: That’s fair. Sales_Accelerator is designed to sit on top of your CRM rather than replace it, and we integrate to pull activity signals. But adoption-wise, we try to make it useful to reps, not just leaders—like showing a rep which deals are likely to slip and what action could reduce that risk, for example “schedule next meeting,” “reconfirm decision criteria,” or “pull in security earlier.” The idea is it helps them hit their number, not just get inspected. Do you think your reps would engage if it clearly helped them protect deals at risk?",
      "link": "https://www.onyx.app/3195382-13"
    },
    {
      "text": "Addison Simmons: Some would. Others would ignore it. And I’m still stuck on the inputs. If reps aren’t logging next steps reliably, you’ll mark everything risky and people will just tune it out. We already have dashboards that people ignore because they don’t reflect reality.",
      "link": "https://www.onyx.app/3195382-14"
    },
    {
      "text": "Megan Foster: Makes sense. One approach is to start with a narrow pilot: one segment or one team, and focus on a couple of signals that are hard to fake—like email/calendar activity and last customer touch—so it’s not purely dependent on manual CRM hygiene. Then we add stage hygiene improvements as a parallel initiative. We’ve seen teams get value even before perfect hygiene, because the tool surfaces “silent deals” you didn’t realize were going dark.",
      "link": "https://www.onyx.app/3195382-15"
    },
    {
      "text": "Addison Simmons: Maybe. But candidly, we have limited bandwidth for parallel initiatives. Our ops team is slammed. If this requires process redesign plus data cleanup plus configuration, it’s going to lose out to other priorities.",
      "link": "https://www.onyx.app/3195382-16"
    },
    {
      "text": "Megan Foster: If bandwidth is the constraint, we can keep the pilot extremely scoped: forecasting at the pipeline level with just the explainable drivers and a light set of slippage diagnostics. The sales ops use case you mentioned—pinpointing bottlenecks—could be a quick win without a giant change program. For example, we could show “evaluation → security” conversion and time-in-stage, and test whether moving security earlier reduces slippage over a month.",
      "link": "https://www.onyx.app/3195382-17"
    },
    {
      "text": "Addison Simmons: A month isn’t realistic for us to see improvement. Our cycles are longer. And we’ve been burned by pilots that don’t translate into adoption. Leadership then asks why we spent money at all.",
      "link": "https://www.onyx.app/3195382-18"
    },
    {
      "text": "Megan Foster: Understood. Let’s talk about what “buying stage” would look like on your side. If you were to move forward, what decision criteria would you need? Is it forecast accuracy improvement, reduction in slips, manager adoption, rep adoption, or integration effort?",
      "link": "https://www.onyx.app/3195382-19"
    },
    {
      "text": "Addison Simmons: Integration effort and ongoing maintenance are huge. We don’t want another tool that needs constant babysitting. And yes—forecast accuracy, but we’d need to prove it. Our CFO is skeptical of new forecasting tools because the core issue is human behavior and messy data.",
      "link": "https://www.onyx.app/3195382-20"
    },
    {
      "text": "Megan Foster: That’s a reasonable CFO perspective. What I can do is propose a structured evaluation: we take a snapshot of your current pipeline, run Sales_Accelerator forecasting in parallel with your existing method for a few weeks, and compare. Because the forecast is driver-based, we can also show where the misses come from—like stale close dates, lack of next meeting, stage age outliers—so it doubles as a hygiene map. Would that be something you’d be willing to set up if we keep implementation light?",
      "link": "https://www.onyx.app/3195382-21"
    },
    {
      "text": "Addison Simmons: I’m hesitant. We’ve done “parallel runs” before and the outputs become a distraction. Also, if the tool is going to tell us “your CRM is messy,” we already know that. The question is whether it meaningfully improves outcomes without us rebuilding our entire process.",
      "link": "https://www.onyx.app/3195382-22"
    },
    {
      "text": "Megan Foster: That’s fair. If we strip it down: the two concrete outcomes we aim for are fewer end-of-quarter surprises—because risky deals are flagged earlier with clear reasons—and faster identification of pipeline bottlenecks—so ops can target a process fix instead of guessing. But if your team can’t act on the signals due to bandwidth, then you won’t get that value.",
      "link": "https://www.onyx.app/3195382-23"
    },
    {
      "text": "Addison Simmons: Exactly. And right now, bandwidth is tight, and rep compliance is not great. I don’t want to sign up for something that depends on behavior change we can’t enforce.",
      "link": "https://www.onyx.app/3195382-24"
    },
    {
      "text": "Megan Foster: Given that, it may not be the right timing for a full rollout. Would it be useful if I sent a short outline of what a minimal-data pilot would require—like the specific integrations, the fields we’d need clean, and the alerts we’d start with—so you can sanity-check effort with your ops lead?",
      "link": "https://www.onyx.app/3195382-25"
    },
    {
      "text": "Addison Simmons: You can send it, sure. But I want to set expectations: I don’t see us purchasing in the near term. We’re more likely to revisit after we finish a CRM cleanup project that’s slated for later this year.",
      "link": "https://www.onyx.app/3195382-26"
    },
    {
      "text": "Megan Foster: I appreciate the clarity. I’ll send a one-pager with the minimal pilot requirements and what we’d measure—forecast variance, slippage rates, and stage conversion diagnostics—so you have it for when the timing is better. Would it make sense to reconnect after your CRM cleanup kicks off, maybe in a couple months, to reassess?",
      "link": "https://www.onyx.app/3195382-27"
    },
    {
      "text": "Addison Simmons: Yes, that’s fine. Send the details, and we can pencil something for later. I just don’t want to overcommit now.",
      "link": "https://www.onyx.app/3195382-28"
    },
    {
      "text": "Megan Foster: Completely understood. I’ll follow up with the outline and a proposed check-in window. Thanks for the straightforward feedback, Addison.",
      "link": "https://www.onyx.app/3195382-29"
    },
    {
      "text": "Addison Simmons: Thanks, Megan. Talk soon.",
      "link": "https://www.onyx.app/3195382-30"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "megan_foster@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "addison_simmons@riverstone_aeroworks.onyx.app"
    }
  ]
}