{
  "id": "FIREFLIES_3246639",
  "semantic_identifier": "3246639 - Marinerock Outdoor Gear - sales_call - Discussion with Dustin Dean",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-06-02 00:00:00",
  "metadata": {
    "meeting_date": "2025-06-02 00:00:00",
    "duration_min": "19"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-06"
      ],
      "year_month": "2025-06",
      "meeting_title": "3246639 - Marinerock Outdoor Gear - sales_call - Discussion with Dustin Dean",
      "organizer_email": "james_choi@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "James Choi: Hey Dustin, good to see you again. Thanks for making the time. Last call you mentioned you’re trying to tighten quarter-end forecasting and reduce the scramble with spreadsheet rollups. Is that still the top priority?",
      "link": "https://www.onyx.app/3591754-1"
    },
    {
      "text": "Dustin Dean: Hey James—yeah, definitely. We’re still doing a lot of manual stitching together from Salesforce, and it gets messy fast. The hardest part is figuring out which “commit” deals are actually solid.",
      "link": "https://www.onyx.app/3591754-2"
    },
    {
      "text": "James Choi: That’s exactly where Sales_Accelerator is strongest. Since you already have Salesforce as the source of truth, we sit on top of it—no rip-and-replace—and we generate an explainable forecast at the opportunity and pipeline level. The big shift is it doesn’t just look at stage; it blends in activity signals like last touch, meetings scheduled, and how long the deal’s been sitting in-stage, and then shows you the drivers behind the number.",
      "link": "https://www.onyx.app/3591754-3"
    },
    {
      "text": "Dustin Dean: When you say “explainable,” what does that look like? Because I’ve seen forecasting tools that give you a score and everyone immediately distrusts it.",
      "link": "https://www.onyx.app/3591754-4"
    },
    {
      "text": "James Choi: Totally fair. In Sales_Accelerator, every forecast view—commit, best case, pipeline—can be drilled into so a manager can answer “why is this deal weakening?” You’d see, for example: stage age is above your benchmark, there’s no next meeting on the calendar, email activity dropped in the last two weeks, and for deals like this historically your win rate is X. It’s not a black box score; it’s a set of visible drivers you can act on in a deal review.",
      "link": "https://www.onyx.app/3591754-5"
    },
    {
      "text": "Dustin Dean: Okay, that’s interesting. We do have a problem where reps keep deals in commit because they “feel good,” and then two weeks later we realize there’s no next step.",
      "link": "https://www.onyx.app/3591754-6"
    },
    {
      "text": "James Choi: Exactly. So one common workflow for a VP Sales is: on Monday, you pull your commit forecast, then filter for “commit deals showing risk signals.” Risk signals are things like stage aging beyond your norm, no next meeting scheduled, low engagement, or slipping close dates. Instead of debating every deal, you run targeted deal reviews on the few that are statistically weakening.",
      "link": "https://www.onyx.app/3591754-7"
    },
    {
      "text": "Dustin Dean: That would save time. But how does it handle differences across segments? Our wholesale deals behave differently than our direct-to-consumer partnerships.",
      "link": "https://www.onyx.app/3591754-8"
    },
    {
      "text": "James Choi: Great point. Forecasting can be sliced by segment, rep, and source. And the benchmarks—like typical cycle time and stage conversion—can be learned separately per segment. So wholesale doesn’t get judged by the same “normal” as a smaller partnership motion. That’s also where the “drivers” stay credible because it’s comparing like-to-like historical patterns.",
      "link": "https://www.onyx.app/3591754-9"
    },
    {
      "text": "Dustin Dean: Makes sense. We also talked last time about our ICP work. We’ve been using Customer_Analyzer for fit scoring—how does your product relate to that?",
      "link": "https://www.onyx.app/3591754-10"
    },
    {
      "text": "James Choi: Perfect segue. Sales_Accelerator integrates with Customer_Analyzer rather than duplicating it. If you have fit tiers or fit scores coming out of Customer_Analyzer, Sales_Accelerator can use that as a weighting factor in forecast and prioritization. So if two deals look identical in stage and activity but one is ICP Tier 1 and the other is Tier 3, you’ll see that reflected in both forecast confidence and where managers focus attention.",
      "link": "https://www.onyx.app/3591754-11"
    },
    {
      "text": "Dustin Dean: I like the idea, but I worry reps will push back if they feel like the tool is “overruling” their judgment. Especially if it starts telling them their commit deal isn’t commit.",
      "link": "https://www.onyx.app/3591754-12"
    },
    {
      "text": "James Choi: That’s a healthy concern, and we see it a lot early on. The way teams get adoption is by positioning it as “better deal inspection,” not “the tool is the boss.” In practice, you use it to ask better questions: “I see we’re in commit but there’s no next meeting—what’s the agreed next step?” Or “We’re past the normal stage time—what’s changed?” The rep can absolutely override, but the tool forces the conversation onto facts—stage age, engagement, next meeting—so it’s constructive rather than personal.",
      "link": "https://www.onyx.app/3591754-13"
    },
    {
      "text": "Dustin Dean: That would help. Our deal reviews sometimes become gut-feel debates.",
      "link": "https://www.onyx.app/3591754-14"
    },
    {
      "text": "James Choi: Exactly, and that’s where the quarter-end scramble comes from. Another angle: scenario planning. So you can do “what if” planning—like, “If we add 20 SQLs in our ICP Tier 1 segment, what’s the expected impact on pipeline coverage or bookings this quarter?” It’s not just a static forecast; it helps you pressure-test assumptions and see what levers actually move the number.",
      "link": "https://www.onyx.app/3591754-15"
    },
    {
      "text": "Dustin Dean: Scenario planning is appealing, especially when marketing asks what we need to hit the quarter. But again, I’m going to come back to trust—how quickly can we validate it’s not garbage-in, garbage-out from Salesforce?",
      "link": "https://www.onyx.app/3591754-16"
    },
    {
      "text": "James Choi: You’re right to anchor on that. We typically start with a short baseline phase: connect Salesforce, pull historical opps, and generate stage conversion and cycle-time benchmarks. Then we compare Sales_Accelerator’s forecast against your last few quarters and current pipeline to calibrate. If you have gaps—like missing activity logging or inconsistent stage definitions—we’ll surface that fast because the drivers will look off. The goal is to make the quality issues visible, not hide them.",
      "link": "https://www.onyx.app/3591754-17"
    },
    {
      "text": "Dustin Dean: Activity logging is a mixed bag here. Some reps are disciplined, some aren’t. Does the tool fall apart if logging isn’t perfect?",
      "link": "https://www.onyx.app/3591754-18"
    },
    {
      "text": "James Choi: It doesn’t require perfection, but it does get stronger with consistency. If activity is sparse, the model leans more on stage age, close date movement, and historical outcomes for similar deals—and it will show that in the drivers. And practically, a lot of teams use this as a gentle nudge: when reps see that “no next meeting” is making their deals show up as risk, they start scheduling and logging the next step because it directly impacts how leadership views the deal.",
      "link": "https://www.onyx.app/3591754-19"
    },
    {
      "text": "Dustin Dean: That’s actually a good behavior change. I can see our managers using that in a consistent way.",
      "link": "https://www.onyx.app/3591754-20"
    },
    {
      "text": "James Choi: Exactly. And because it’s explainable, managers aren’t saying “the AI says you’re wrong.” They’re saying “we’re missing a next step; let’s fix it.” That usually lands better.",
      "link": "https://www.onyx.app/3591754-21"
    },
    {
      "text": "Dustin Dean: So if we were to move forward, what would you suggest as the first use case to prove value quickly?",
      "link": "https://www.onyx.app/3591754-22"
    },
    {
      "text": "James Choi: For Marinerock, I’d recommend we start with the VP Sales quarter-end accuracy use case: replace the spreadsheet rollups with the explainable forecast and a “commit risk” view for deal reviews. It’s a clean before/after: time saved, fewer surprises, and better visibility into which commit deals are weakening and why. Once that’s working, you can expand into deeper guidance, but forecasting is the fastest path to measurable ROI.",
      "link": "https://www.onyx.app/3591754-23"
    },
    {
      "text": "Dustin Dean: That aligns. Our VP of Sales is the one pushing for this, and the spreadsheet pain is real. What would implementation look like in terms of time and resources?",
      "link": "https://www.onyx.app/3591754-24"
    },
    {
      "text": "James Choi: Lightweight to start. Since we sit on Salesforce, we’re not changing your process; we’re reading it and layering analytics and guidance. Typically: week one is integration and data mapping, week two is calibration and validation with your sales ops lead, and then we do a manager enablement session focused on using the drivers in deal reviews. You can be live for a pilot inside a month, often sooner depending on access and data hygiene.",
      "link": "https://www.onyx.app/3591754-25"
    },
    {
      "text": "Dustin Dean: Okay. And pricing aside for a second—how would you run a pilot so it doesn’t become “another dashboard nobody opens”?",
      "link": "https://www.onyx.app/3591754-26"
    },
    {
      "text": "James Choi: We make it workflow-based. For the pilot, we pick one segment or one leadership cadence—like your weekly commit call. Success criteria could be: eliminate the manual rollup, use Sales_Accelerator forecast as the default view, and require that every commit deal has an identified next step. We’ll track how many “commit risk” deals get addressed and whether slippage decreases. If it’s not being used in the meeting rhythm, it won’t stick—so we design it around that rhythm.",
      "link": "https://www.onyx.app/3591754-27"
    },
    {
      "text": "Dustin Dean: That’s good. I can already picture using it in our Monday forecast meeting. If it can reliably flag the “fake commit” deals early, that’s a win.",
      "link": "https://www.onyx.app/3591754-28"
    },
    {
      "text": "James Choi: Great. Here’s what I’d propose as next steps to get you to a buying decision: I’ll send a one-page pilot plan—scope, timeline, success metrics—and we schedule a 30-minute session with your VP Sales and sales ops to confirm the data sources and the segment split. If they’re aligned, we can move to a formal proposal right after. Does that work?",
      "link": "https://www.onyx.app/3591754-29"
    },
    {
      "text": "Dustin Dean: Yes, let’s do that. Include our VP Sales and our sales ops manager. If they’re comfortable with the explainability and the rollout plan, I think we can move quickly.",
      "link": "https://www.onyx.app/3591754-30"
    },
    {
      "text": "James Choi: Perfect. I’ll follow up today with times for early next week and the pilot plan. And Dustin—before we wrap—any other concern you want me to address proactively for them? Usually it’s trust, data quality, or “will reps hate this.”",
      "link": "https://www.onyx.app/3591754-31"
    },
    {
      "text": "Dustin Dean: Trust and adoption are the big ones. If you can come prepared with how other teams introduced it without backlash, that would help.",
      "link": "https://www.onyx.app/3591754-32"
    },
    {
      "text": "James Choi: Absolutely. I’ll bring a couple of adoption playbooks and examples of the driver-based deal review questions managers use, so it feels practical and not theoretical. Thanks, Dustin—talk soon.",
      "link": "https://www.onyx.app/3591754-33"
    },
    {
      "text": "Dustin Dean: Sounds good, James. Thanks.",
      "link": "https://www.onyx.app/3591754-34"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "james_choi@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "dustin_dean@marinerock_outdoor_gear.onyx.app"
    }
  ]
}