{
  "id": "FIREFLIES_4210674",
  "semantic_identifier": "4210674 - Pacific Ember Foods - sales_pitch - Discussion with Kent Delgado",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-06-13 00:00:00",
  "metadata": {
    "meeting_date": "2025-06-13 00:00:00",
    "duration_min": "17"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-06"
      ],
      "year_month": "2025-06",
      "meeting_title": "4210674 - Pacific Ember Foods - sales_pitch - Discussion with Kent Delgado",
      "organizer_email": "irene_shen@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Irene Shen: Hi Kent—this is Irene Shen. Thanks for taking a few minutes. I work with teams who are living in Salesforce or HubSpot but still struggling with “what do I do next” on each lead and opportunity. I wanted to quickly share how Sales_Accelerator helps with that and see if it’s worth a deeper session.",
      "link": "https://www.onyx.app/9445859-1"
    },
    {
      "text": "Kent Delgado: Hi Irene. Yeah, I’ve got about five minutes. What is it exactly—another CRM?",
      "link": "https://www.onyx.app/9445859-2"
    },
    {
      "text": "Irene Shen: Totally fair question. It’s not a CRM replacement. Sales_Accelerator sits on top of your existing CRM as an execution layer. It looks at what’s happening across your pipeline and then does two things really well: it recommends the best next action for each deal—inside the CRM—and it flags risk early when deals are likely to slip. It also plugs into your existing customer fit/ICP work rather than duplicating it.",
      "link": "https://www.onyx.app/9445859-3"
    },
    {
      "text": "Kent Delgado: Okay. We’re using HubSpot today, and our reps already have sequences. What’s different here?",
      "link": "https://www.onyx.app/9445859-4"
    },
    {
      "text": "Irene Shen: Sequences are great for consistent outreach, but they’re usually “one-size-fits-most.” Where Sales_Accelerator helps is: it adapts the next step based on what’s actually happening in the opportunity. For example, if a meeting happened and there’s no follow-up logged, it’ll prompt a recap email with next steps. If only one stakeholder is engaged, it recommends multi-threading and suggests who to pull in. If the mutual plan is incomplete, it generates a lightweight checklist and reminders so deals don’t stall quietly.",
      "link": "https://www.onyx.app/9445859-5"
    },
    {
      "text": "Kent Delgado: That sounds useful, but we’re a food company—our process isn’t super enterprise-y. We mostly care about inbound speed-to-lead and not letting good leads rot.",
      "link": "https://www.onyx.app/9445859-6"
    },
    {
      "text": "Irene Shen: Perfect—one of the strongest use cases is aligning speed-to-lead for inbound. Sales_Accelerator prioritizes high-fit inbound leads, recommends the best first response message, and then tracks whether faster first-touch is actually correlating with higher win rate. So instead of a dashboard that says “respond faster,” reps get a queue: “These five inbound leads are high fit—here’s the best first-touch message, here’s the channel, and here’s the recommended cadence for the next 48 hours.”",
      "link": "https://www.onyx.app/9445859-7"
    },
    {
      "text": "Kent Delgado: How does it know “high fit”? We’ve got some scoring, but it’s not great.",
      "link": "https://www.onyx.app/9445859-8"
    },
    {
      "text": "Irene Shen: If you already have scoring, we can consume it. If you’re using something like Customer_Analyzer—or even if you’re not today—we can ingest fit scores and positioning blocks so reps aren’t guessing. The key is: Sales_Accelerator doesn’t redo your ICP work; it operationalizes it. It takes “this lead is a fit and here’s the positioning” and turns it into: “send this message, ask these questions, and here’s the next action if they raise objection X.”",
      "link": "https://www.onyx.app/9445859-9"
    },
    {
      "text": "Kent Delgado: We don’t use Customer_Analyzer specifically. We do have some segments, and the team has talk tracks. Would your tool still work?",
      "link": "https://www.onyx.app/9445859-10"
    },
    {
      "text": "Irene Shen: Yes. We can start with your existing segments and talk tracks and layer in smarter guidance over time. The first win tends to be operational: reps don’t have to decide what to do next, managers don’t have to chase basic hygiene, and you get a measurable improvement in inbound follow-up consistency.",
      "link": "https://www.onyx.app/9445859-11"
    },
    {
      "text": "Kent Delgado: What does “guidance” look like—are reps getting spammed with alerts?",
      "link": "https://www.onyx.app/9445859-12"
    },
    {
      "text": "Irene Shen: No, we’re careful about that. It’s primarily a task queue and in-context recommendations on the record. For example: “Opportunity at stage 2 has one contact engaged, last activity 8 days ago, no next meeting scheduled—recommended next actions: 1) send recap + propose times, 2) add operations contact, 3) update mutual action plan.” Reps can one-click create the tasks or messages, and managers can see where the pipeline is drifting without a bunch of manual inspection.",
      "link": "https://www.onyx.app/9445859-13"
    },
    {
      "text": "Kent Delgado: And this lives in HubSpot?",
      "link": "https://www.onyx.app/9445859-14"
    },
    {
      "text": "Irene Shen: Exactly—either embedded in the CRM or via a lightweight extension, depending on your setup. The idea is not to add a new tab reps have to remember. It’s “where they already work.”",
      "link": "https://www.onyx.app/9445859-15"
    },
    {
      "text": "Kent Delgado: Got it. What’s the risk flagging you mentioned?",
      "link": "https://www.onyx.app/9445859-16"
    },
    {
      "text": "Irene Shen: We look for patterns that precede slippage: stalled stages, missing stakeholders, lack of next step, mutual plan gaps, inconsistent activity, that kind of thing. Then we surface “deal at risk” with the specific reason and the recommended fix. That’s really helpful for forecasting conversations because instead of arguing about gut feel, you’re looking at explainable signals.",
      "link": "https://www.onyx.app/9445859-17"
    },
    {
      "text": "Kent Delgado: Interesting. My worry is change management. Our team is small, and if this feels heavy, it won’t stick.",
      "link": "https://www.onyx.app/9445859-18"
    },
    {
      "text": "Irene Shen: That’s a good callout. This is designed to be lightweight—think “nudges and consistency” rather than a forced methodology. The initial rollout can be just one motion: inbound speed-to-lead. We’d set up the prioritization and first-touch recommendations, measure response time and conversion impact, and only then expand to deal progression recommendations for later stages.",
      "link": "https://www.onyx.app/9445859-19"
    },
    {
      "text": "Kent Delgado: If we did that, what would you need from us?",
      "link": "https://www.onyx.app/9445859-20"
    },
    {
      "text": "Irene Shen: For the inbound pilot: access to HubSpot objects for leads/contacts, lifecycle stages, activity logs, and your current routing rules and sequences. Then we’d define what “high fit” means using your existing segments or scoring, and we’d map a couple of first-response templates per segment. Usually we can stand up something usable in a couple of weeks.",
      "link": "https://www.onyx.app/9445859-21"
    },
    {
      "text": "Kent Delgado: And you can show this before we commit to anything?",
      "link": "https://www.onyx.app/9445859-22"
    },
    {
      "text": "Irene Shen: Absolutely. What I’d suggest is a 30-minute working session—screen share—where we walk through your current inbound flow and then I’ll demo what the rep experience looks like: the prioritized queue, the recommended first response, and an example of the follow-up recommendation when a lead engages but no next step is set.",
      "link": "https://www.onyx.app/9445859-23"
    },
    {
      "text": "Kent Delgado: That would be helpful. I’d want our sales ops person to see it too, since they own HubSpot.",
      "link": "https://www.onyx.app/9445859-24"
    },
    {
      "text": "Irene Shen: Perfect. If you bring sales ops, we can also cover how the recommendations are configured and what reporting you get—like speed-to-lead by fit tier and the win-rate lift. Does early next week work?",
      "link": "https://www.onyx.app/9445859-25"
    },
    {
      "text": "Kent Delgado: Yeah, early next week is fine. Tuesday afternoon maybe.",
      "link": "https://www.onyx.app/9445859-26"
    },
    {
      "text": "Irene Shen: Great—how about Tuesday at 2:00 PM Pacific for 30 minutes? If that’s tight, we can do 45 and include a few specific scenarios from Pacific Ember Foods—like your top inbound sources and what happens after the first reply.",
      "link": "https://www.onyx.app/9445859-27"
    },
    {
      "text": "Kent Delgado: Let’s do 2:00 PM Pacific for 45 minutes. I’ll loop in ops.",
      "link": "https://www.onyx.app/9445859-28"
    },
    {
      "text": "Irene Shen: Awesome. I’ll send a calendar invite for Tuesday 2:00 PM Pacific, 45 minutes, and I’ll include a short list of what we’ll cover and the minimal HubSpot info that’s helpful. Thanks, Kent—looking forward to it.",
      "link": "https://www.onyx.app/9445859-29"
    },
    {
      "text": "Kent Delgado: Sounds good. Thanks, Irene.",
      "link": "https://www.onyx.app/9445859-30"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "irene_shen@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "kent_delgado@pacific_ember_foods.onyx.app"
    }
  ]
}