{
  "id": "FIREFLIES_4864163",
  "semantic_identifier": "4864163 - Unitypeak Nonprofits - sales_call - Discussion with Fernando Chapman",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-06-17 00:00:00",
  "metadata": {
    "meeting_date": "2025-06-17 00:00:00",
    "duration_min": "40"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-06"
      ],
      "year_month": "2025-06",
      "meeting_title": "4864163 - Unitypeak Nonprofits - sales_call - Discussion with Fernando Chapman",
      "organizer_email": "megan_foster@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Megan Foster: Hi Fernando, thanks for making the time again. Last time you mentioned Unitypeak’s biggest pain is the end-of-month “surprise” on pipeline—things look fine in the CRM and then three deals slip at once. I wanted to focus today on one piece of Sales_Accelerator that directly targets that: our sales_forecast view and the drivers behind it. Does that still feel like the priority?",
      "link": "https://www.onyx.app/6774703-1"
    },
    {
      "text": "Fernando Chapman: Yeah, forecast accuracy is still a priority. But I’m also cautious—our CRM data isn’t always perfect, and I don’t want another dashboard that’s only as good as what people remember to enter.",
      "link": "https://www.onyx.app/6774703-2"
    },
    {
      "text": "Megan Foster: Totally fair, and that’s actually the right lens for this. Sales_Accelerator sits on top of your CRM, so we don’t try to replace Salesforce discipline—we surface where the discipline is breaking the forecast. The difference from a standard CRM forecast is we combine stage with activity signals—email/call/meeting patterns—and cycle-time benchmarks, and we can optionally use Customer_Analyzer’s fit score as a weighting factor. So if a deal is “late” for the stage and hasn’t had a meaningful touch, it drops out of commit even if it’s still marked “verbal yes.”",
      "link": "https://www.onyx.app/6774703-3"
    },
    {
      "text": "Fernando Chapman: That sounds helpful in theory. But we’ve tried “activity-based” tools before. The reps complained about false alerts and it became noise. And honestly, our stages are inconsistent across teams—some folks skip stages, some don’t update close dates until the last second.",
      "link": "https://www.onyx.app/6774703-4"
    },
    {
      "text": "Megan Foster: Understood. Let me anchor on how it’s explainable so it’s not a black box. For any forecast number—commit, best-case, pipeline—you can click into the drivers: stage age, last touch, whether a next meeting is scheduled, fit tier if you bring in Customer_Analyzer, and historical win rate for similar deals. Then you can see “why” it’s at risk, not just “it’s at risk.” It’s less “alerts everywhere” and more “these five deals are the reason your commit is inflated.”",
      "link": "https://www.onyx.app/6774703-5"
    },
    {
      "text": "Fernando Chapman: I get the value of explainable drivers. But if our close dates and next steps aren’t reliable, won’t your “stage age” and “next meeting scheduled” driver just reflect bad inputs? We’ve fought that battle for years.",
      "link": "https://www.onyx.app/6774703-6"
    },
    {
      "text": "Megan Foster: You’re right that hygiene matters. Where teams see traction quickly is using the system to *highlight* hygiene problems in a way that’s tied to outcomes. For example, Sales ops can view stage slippage diagnostics and conversion by segment and rep. If one segment shows a big drop from discovery to evaluation, we can recommend a process fix—like moving security review earlier—and then monitor whether conversion improves. The tool becomes a feedback loop, not just a report.",
      "link": "https://www.onyx.app/6774703-7"
    },
    {
      "text": "Fernando Chapman: We’re a nonprofit org. Our “segments” aren’t clean like enterprise SaaS. We have donors, partners, institutional grants, and different cycles. I’m not sure benchmarking would be meaningful.",
      "link": "https://www.onyx.app/6774703-8"
    },
    {
      "text": "Megan Foster: That’s fair. The benchmarks don’t have to be generic industry averages. We base them on *your* historical cycle times and win rates by whatever breakdown is meaningful—source, motion, rep, or even “grant-funded vs. donor-led.” The system learns patterns from your own pipeline history. And on top of that, the scenario planning can help you quantify what you need—like “If we add 20 SQLs in the highest-fit tier, what’s the expected impact this quarter?” That’s especially useful for planning around board expectations.",
      "link": "https://www.onyx.app/6774703-9"
    },
    {
      "text": "Fernando Chapman: Scenario planning is interesting. But again, it assumes the underlying data is accurate. Our reps are not great at logging emails and meetings either. Some of it is in Gmail, some in calendar, and some just… not tracked.",
      "link": "https://www.onyx.app/6774703-10"
    },
    {
      "text": "Megan Foster: That’s the other side of “activity signals.” If you connect email/calendar, we can pull signals without reps logging every touch manually. It’s not perfect, but it reduces reliance on manual entry. And we can set thresholds so it’s not pinging people for minor things—more like “no touch in 14 days on a late-stage deal” rather than “you didn’t send an email today.”",
      "link": "https://www.onyx.app/6774703-11"
    },
    {
      "text": "Fernando Chapman: We’d have to get IT and security comfortable with connecting email and calendars. That can take months here. And I’m also wary that if reps feel monitored, adoption drops.",
      "link": "https://www.onyx.app/6774703-12"
    },
    {
      "text": "Megan Foster: Completely. We can start without inbox/calendar and still add value with CRM-stage and the data you already have, then expand. In terms of rep sentiment, we try to position it as *deal protection*. The output is manager-facing too—so instead of “Why didn’t you log activity?” it becomes “This deal is slipping because there’s no next meeting scheduled and it’s exceeded typical time in stage.” It’s a coaching artifact.",
      "link": "https://www.onyx.app/6774703-13"
    },
    {
      "text": "Fernando Chapman: Okay, but then we’re back to inconsistent stages. If the stage is wrong, you’re diagnosing the wrong thing.",
      "link": "https://www.onyx.app/6774703-14"
    },
    {
      "text": "Megan Foster: True. One practical approach we’ve seen: start with a narrow scope—one team, one motion—and use the stage conversion report to *expose* inconsistencies. If Team A has 40% conversion to proposal and Team B has 10%, either they’re doing something different or their stage definitions differ. Sales ops can then standardize. The forecast then becomes a forcing function to clean things up because leadership starts trusting it and asks for it.",
      "link": "https://www.onyx.app/6774703-15"
    },
    {
      "text": "Fernando Chapman: That sounds like a lot of change management. We don’t have a big sales ops bench. It’s basically me and one analyst, and we’re already stretched.",
      "link": "https://www.onyx.app/6774703-16"
    },
    {
      "text": "Megan Foster: That’s helpful context. If ops bandwidth is limited, we can keep the initial rollout lightweight: one forecast view that leadership cares about, plus a simple “slippage” diagnostic. The goal would be to reduce end-of-quarter surprises rather than do a full process re-architecture on day one.",
      "link": "https://www.onyx.app/6774703-17"
    },
    {
      "text": "Fernando Chapman: So what would you actually need from us to get started? Last time you mentioned integrating with Customer_Analyzer—our team liked that fit scoring, but we haven’t rolled it out widely.",
      "link": "https://www.onyx.app/6774703-18"
    },
    {
      "text": "Megan Foster: Great memory. Sales_Accelerator can consume Customer_Analyzer’s fit tiers to weight forecast—so high-fit deals get treated differently than low-fit ones even at the same stage. But you don’t have to have it perfect. Minimum to start is: Salesforce access, your current stage definitions, and 12 months of historical opp data if possible. Optional: Customer_Analyzer feed and email/calendar signals later.",
      "link": "https://www.onyx.app/6774703-19"
    },
    {
      "text": "Fernando Chapman: The 12 months of historical data is fine. Stage definitions are the messy part. And Salesforce access approvals take time. Also, budget is… tight. We’re in a hiring freeze.",
      "link": "https://www.onyx.app/6774703-20"
    },
    {
      "text": "Megan Foster: Understood on budget. If we can get agreement on scope, I can propose a phased plan: start with forecasting for one pipeline slice and prove improved accuracy and fewer slips. Then you’d have a concrete ROI story internally. Would it be fair to say your biggest concern is that without hygiene, the tool becomes noise and you don’t have time to manage it?",
      "link": "https://www.onyx.app/6774703-21"
    },
    {
      "text": "Fernando Chapman: That’s exactly it. We’ve bought tools that promised “insights” and then we ended up babysitting the data and turning off alerts. I can’t take on another system that needs constant tuning.",
      "link": "https://www.onyx.app/6774703-22"
    },
    {
      "text": "Megan Foster: That’s a valid risk. What I’d suggest is a short evaluation where we run Sales_Accelerator against your existing pipeline and show you: (1) forecast accuracy compared to your current method, and (2) the top drivers of slippage. If it’s noisy because of data gaps, we’ll see that quickly—and you can decide not to proceed.",
      "link": "https://www.onyx.app/6774703-23"
    },
    {
      "text": "Fernando Chapman: Evaluation is fine, but what does that mean in practice? I don’t want a “pilot” that becomes a sunk-cost project.",
      "link": "https://www.onyx.app/6774703-24"
    },
    {
      "text": "Megan Foster: In practice it’s two weeks of data access and a working session. We’ll generate the forecast views—commit/best-case/pipeline—plus the diagnostics by segment/rep/source. Then we review with you: “Here are the deals driving risk, here’s why.” If it’s not credible, we stop. No long implementation.",
      "link": "https://www.onyx.app/6774703-25"
    },
    {
      "text": "Fernando Chapman: Two weeks might be optimistic for access and approvals. And even if we get through it, I’m not sure I can get purchasing over the line this quarter. We’re prioritizing donor platform work and compliance projects.",
      "link": "https://www.onyx.app/6774703-26"
    },
    {
      "text": "Megan Foster: That’s helpful. Timing-wise, are you saying this is more of a next-quarter conversation even if the evaluation goes well?",
      "link": "https://www.onyx.app/6774703-27"
    },
    {
      "text": "Fernando Chapman: Likely, yes. And honestly, even then, I’d need to see a very clear case that it won’t create extra work for ops. If the answer is “clean your CRM first,” that’s a non-starter right now.",
      "link": "https://www.onyx.app/6774703-28"
    },
    {
      "text": "Megan Foster: I hear you. I don’t want to oversell it—Sales_Accelerator does benefit from cleaner data. We can reduce manual effort with activity signals, and we can surface where hygiene is hurting outcomes, but it won’t magically fix inconsistent stages overnight. If that foundational work can’t happen, it may not be the right time.",
      "link": "https://www.onyx.app/6774703-29"
    },
    {
      "text": "Fernando Chapman: That’s where I’m landing. I like the idea, and I think the forecasting drivers could help, but we’re not in a position to tackle the prerequisites or add another tool this quarter.",
      "link": "https://www.onyx.app/6774703-30"
    },
    {
      "text": "Megan Foster: That makes sense. How about we do this: I’ll send a one-page outline of what the evaluation would require—access, timeline, and what we’d deliver—so you can sanity-check effort internally. And if it’s not feasible, we can revisit when your donor platform work settles. Would you prefer I circle back in, say, 90 days?",
      "link": "https://www.onyx.app/6774703-31"
    },
    {
      "text": "Fernando Chapman: Yes—send the outline, and let’s plan to reconnect in a few months. If we can improve CRM discipline by then, this might be back on the table.",
      "link": "https://www.onyx.app/6774703-32"
    },
    {
      "text": "Megan Foster: Perfect. I’ll send that today. Thanks, Fernando—this was really clear, and it helps me not push you into something that won’t stick.",
      "link": "https://www.onyx.app/6774703-33"
    },
    {
      "text": "Fernando Chapman: Appreciate it, Megan. Talk soon.",
      "link": "https://www.onyx.app/6774703-34"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "megan_foster@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "fernando_chapman@unitypeak_nonprofits.onyx.app"
    }
  ]
}