{
  "id": "FIREFLIES_7664994",
  "semantic_identifier": "7664994 - Ultraviolet Summit Labs - sales_call - Discussion with Natalie Collins",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-06-03 00:00:00",
  "metadata": {
    "meeting_date": "2025-06-03 00:00:00",
    "duration_min": "16"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-06"
      ],
      "year_month": "2025-06",
      "meeting_title": "7664994 - Ultraviolet Summit Labs - sales_call - Discussion with Natalie Collins",
      "organizer_email": "mina_park@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Mina Park: Hi Natalie—good to see you again. Last time you mentioned you’re trying to get clearer on which customer segments are actually your best fit, especially for product planning. I wanted to use today to show how Customer_Analyzer turns your existing signals into a fit score and then into positioning recommendations you can actually use. Does that still line up with what you’re prioritizing this quarter?",
      "link": "https://www.onyx.app/5485394-1"
    },
    {
      "text": "Natalie Collins: Yeah, that’s still the idea. We’re getting pressure to make roadmap bets based on something more solid than anecdotal feedback. But I’m also wary of tooling that looks great in a demo and then falls apart once it hits our actual data.",
      "link": "https://www.onyx.app/5485394-2"
    },
    {
      "text": "Mina Park: Totally fair. Why don’t we anchor on one concrete workflow: using Customer_Analyzer to identify high-fit customers with unmet needs so you can prioritize roadmap themes. The two pieces we’d focus on are the fit score—who looks like your best segment right now—and then the positioning recommendation feature, which turns that into segment-specific messaging and objections. Would it help if I walked through what the output looks like and what inputs it needs from you?",
      "link": "https://www.onyx.app/5485394-3"
    },
    {
      "text": "Natalie Collins: Sure. But inputs is where I’m concerned. Our CRM fields are… not clean. Tagging is inconsistent. Usage data is split across tools. If your scoring depends on that, I’m not sure we’ll get anything trustworthy.",
      "link": "https://www.onyx.app/5485394-4"
    },
    {
      "text": "Mina Park: That’s one of the most common starting points. Customer_Analyzer can ingest what you have—CRM fields, onboarding surveys if you’ve got them, product usage events, support tickets, even interview notes. The fit score is only as good as the signals, but the system also shows which drivers are being used and what evidence supports them, so you can see “this score is high because X, Y, Z.” For product planning, we usually start with a smaller set of signals that are more reliable—like plan type, industry, team size, and a couple of usage events—then expand.",
      "link": "https://www.onyx.app/5485394-5"
    },
    {
      "text": "Natalie Collins: The transparency part is good. But if half our accounts are missing team size and industry, we’re going to bias the results. Also, our usage event taxonomy changed mid-year, so even that’s messy.",
      "link": "https://www.onyx.app/5485394-6"
    },
    {
      "text": "Mina Park: Understood. On the event taxonomy change—Customer_Analyzer can map events into a normalized set, but it does require some upfront definition. On missing CRM fields, you can still run scoring with partial data, but you’re right: it can reduce accuracy. The reason I’m still optimistic is that the positioning recommendation feature can pull language and themes from support tickets and interview notes, which are often richer than CRM fields. So even if scoring is imperfect early, you can still extract “what do high-retention customers say they value” and package that into segment messaging.",
      "link": "https://www.onyx.app/5485394-7"
    },
    {
      "text": "Natalie Collins: That sounds nice, but we don’t have interview notes in a central place. Support tickets exist, yes, but they’re also inconsistent. And honestly, we don’t want a tool telling us what our messaging is—our marketing team is pretty particular.",
      "link": "https://www.onyx.app/5485394-8"
    },
    {
      "text": "Mina Park: For sure—this isn’t meant to replace your team’s judgment. Think of positioning recommendations as a draft that’s anchored in evidence and editable. The outputs come as messaging blocks—website hero copy options, sales deck bullets, email openers—tied back to fit drivers and the customer language it’s drawing from. Marketing can accept, edit, or reject, but it speeds up the iteration cycle and keeps sales and product aligned on what’s resonating.",
      "link": "https://www.onyx.app/5485394-9"
    },
    {
      "text": "Natalie Collins: Okay, but how do you avoid it just generating generic copy? We’ve tried “AI positioning” tools and they end up sounding like every other SaaS product: “increase efficiency,” “streamline workflows,” all that.",
      "link": "https://www.onyx.app/5485394-10"
    },
    {
      "text": "Mina Park: The difference is that our recommendations are constrained by observed inputs—your actual customer signals and the phrases coming from tickets, surveys, notes—plus the fit drivers. So instead of generic “efficiency,” it might surface that a specific segment keeps referencing “audit-ready reporting in two days,” or “fewer handoffs between lab ops and compliance,” and then it builds value props and proof points around that. And it also produces an objection-handling playbook—like “if this segment worries about implementation time, here’s the evidence to collect and the framing that has worked.”",
      "link": "https://www.onyx.app/5485394-11"
    },
    {
      "text": "Natalie Collins: I get the concept. I’m just skeptical we can feed it enough consistent data for that to be meaningful. Our support system has a lot of duplicates and weird categorization. And our sales notes are in free text in the CRM—some reps barely write anything.",
      "link": "https://www.onyx.app/5485394-12"
    },
    {
      "text": "Mina Park: Makes sense. Can I ask: if you had to pick one near-term win, would it be (a) improving how you prioritize segments for roadmap decisions, or (b) tightening sales and marketing messaging for a segment you already know is attractive?",
      "link": "https://www.onyx.app/5485394-13"
    },
    {
      "text": "Natalie Collins: Roadmap. We’re debating two big bets and we don’t agree on which customer type we should optimize for. But again, the data foundation is shaky.",
      "link": "https://www.onyx.app/5485394-14"
    },
    {
      "text": "Mina Park: If roadmap is the priority, we can keep scope tight. For example: define 2–3 candidate segments you’re already debating, pull whatever consistent signals exist for those accounts, and run a fit analysis just within that cohort. Then the positioning recommendations can summarize the top use cases and differentiators for each segment, and—importantly—highlight what proof points you’d need to collect to validate the bet. It can even call out where evidence is thin.",
      "link": "https://www.onyx.app/5485394-15"
    },
    {
      "text": "Natalie Collins: That last part is interesting—calling out where evidence is thin. But I’m still thinking about effort. We don’t have bandwidth for a big data cleanup project just to make a tool work.",
      "link": "https://www.onyx.app/5485394-16"
    },
    {
      "text": "Mina Park: Totally. The implementation usually isn’t “clean everything.” It’s more: pick the minimum viable set of fields and signals, map them, and start. Typically a couple CRM fields, one or two product events, and one text source like tickets. If we did a pilot, we’d timebox it to, say, a few weeks and measure whether the outputs are actionable for product planning.",
      "link": "https://www.onyx.app/5485394-17"
    },
    {
      "text": "Natalie Collins: A pilot sounds fine in theory, but we’ve been burned. Vendors say “few weeks” and then it’s a slow integration slog. Plus, security review alone can take us a month.",
      "link": "https://www.onyx.app/5485394-18"
    },
    {
      "text": "Mina Park: Understood. If security and integration lead times are a blocker, one option is to start with a lightweight dataset export—CSV from CRM plus a support ticket export—no live integration at first. That can produce an initial fit score and positioning recommendations to prove value before you invest in deeper connections.",
      "link": "https://www.onyx.app/5485394-19"
    },
    {
      "text": "Natalie Collins: Exporting could work, but then we’re back to: are those exports even reliable? Our CRM exports miss fields because reps don’t fill them in, and support tickets often don’t map cleanly to customer accounts. I’m worried we’ll spend time and end up with a fancy output that we can’t trust enough to bet the roadmap on.",
      "link": "https://www.onyx.app/5485394-20"
    },
    {
      "text": "Mina Park: That’s fair. Let me ask bluntly: what would you need to see to believe the outputs are trustworthy? Is it accuracy of the fit score, alignment with your internal intuition, or some correlation with retention or expansion?",
      "link": "https://www.onyx.app/5485394-21"
    },
    {
      "text": "Natalie Collins: Correlation with retention would be the big one. If you can show that the “high fit” group is actually the group that renews or expands, then we’re talking. But with missing fields and messy tagging, I don’t know how you’d prove that quickly.",
      "link": "https://www.onyx.app/5485394-22"
    },
    {
      "text": "Mina Park: We could use renewal status or expansion as an outcome variable, if you have that reliably captured. Even with imperfect feature data, the model can sometimes still find drivers that separate retained vs churned accounts. But yes—if renewal data is also messy, that’s tough.",
      "link": "https://www.onyx.app/5485394-23"
    },
    {
      "text": "Natalie Collins: Renewal data is in finance systems, not the CRM. And we don’t have a clean way to join it. So… that’s kind of the problem.",
      "link": "https://www.onyx.app/5485394-24"
    },
    {
      "text": "Mina Park: Got it. Given that, it may be hard to run a pilot that meets your “trust” bar without some foundational work. We can still generate positioning blocks and an objection playbook from tickets and notes, but if your main decision is roadmap bets, you’ll probably want that retention linkage.",
      "link": "https://www.onyx.app/5485394-25"
    },
    {
      "text": "Natalie Collins: Exactly. Marketing might like the messaging blocks, but I’m not buying a platform primarily for that. And product planning is where we need rigor, not just plausible-sounding insights.",
      "link": "https://www.onyx.app/5485394-26"
    },
    {
      "text": "Mina Park: That makes sense. If we can’t get to outcome correlation, another path is to use Customer_Analyzer to identify “unmet needs” by clustering themes in tickets and surveys—more qualitative, less scoring-dependent—and then treat the fit score as directional only. But I hear you: that might not be sufficient for executive-level roadmap decisions.",
      "link": "https://www.onyx.app/5485394-27"
    },
    {
      "text": "Natalie Collins: Right. Directional is not what leadership is asking for right now. We’re being pushed to justify decisions with numbers, and we’re not set up for that.",
      "link": "https://www.onyx.app/5485394-28"
    },
    {
      "text": "Mina Park: I appreciate the clarity. It sounds like the blocker isn’t interest in the capability—it’s the data readiness and the ability to validate against retention. If we were to take a next step, would it be helpful if I sent a short checklist of the minimum data needed to do the retention correlation, so you can assess feasibility with your ops team?",
      "link": "https://www.onyx.app/5485394-29"
    },
    {
      "text": "Natalie Collins: You can send it, sure. But I’m being honest: I don’t think we’re going to prioritize stitching finance outcomes to CRM in the next quarter. We have other initiatives underway.",
      "link": "https://www.onyx.app/5485394-30"
    },
    {
      "text": "Mina Park: That’s helpful. I don’t want to force a timeline that doesn’t match your reality. How about this: I’ll send the checklist and a sample of what the positioning recommendations and objection playbook look like, so marketing can react. And if later you get to a point where renewal outcomes are accessible, we can revisit a scoped pilot focused on product planning.",
      "link": "https://www.onyx.app/5485394-31"
    },
    {
      "text": "Natalie Collins: That works. Send it over. I’m not saying “no forever,” but I can’t move forward to purchase without confidence we can prove the fit scoring is meaningful for us.",
      "link": "https://www.onyx.app/5485394-32"
    },
    {
      "text": "Mina Park: Completely understood. I’ll follow up today with the checklist, the sample outputs, and a suggested low-lift pilot plan—clearly labeled as “only if data is available.” Thanks for being candid, Natalie.",
      "link": "https://www.onyx.app/5485394-33"
    },
    {
      "text": "Natalie Collins: Thanks, Mina. Talk soon.",
      "link": "https://www.onyx.app/5485394-34"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mina_park@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "natalie_collins@ultraviolet_summit_labs.onyx.app"
    }
  ]
}