{
  "id": "4056725eb0d84e0bbce7997e05012cf5",
  "semantic_identifier": "Design--Add “Unmatched identities” review queue with match suggestions and bulk linking.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-05-07",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Add “Unmatched identities” review queue with match suggestions and bulk linking.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "## Overview / Goal\nAdd an admin-only “Unmatched identities” review queue for identities that fail automatic account linking during ingest. The queue should surface each identity’s raw signals (e.g., name, email, domain, company) alongside canonicalized/normalized values used by the linker, plus a ranked list of suggested account matches with confidence explanations. Admins can resolve each item by linking to an existing account, creating a new account, or marking the identity as ignore/unknown, and can apply actions in bulk for repeated patterns (same email, domain, or company).\n\n## UX / Workflow\nProvide an admin page with filters (source, date range, signal type, confidence band) and grouping modes (by exact email, by domain, by canonical company). Each row shows identity metadata, failure reason (e.g., ambiguous match, missing signal), canonicalization diffs, and top N suggested accounts with key match signals. Actions: (1) Confirm link to a suggested account or search/select another account, (2) Create account prefilled from canonicalized identity fields, (3) Mark ignore/unknown with optional note and scope (single identity vs pattern). Bulk actions operate on selected rows or entire groups (e.g., “link all @acme.com to Account X”), with a confirmation modal summarizing impact.\n\n## Data Model / Persistence\nIntroduce an `unmatched_identities` store (or queue table) capturing the identity payload, canonicalized fields, ingest metadata, and the linker’s candidate set + scores at time of failure. When an admin resolves an item, persist the decision as an explicit mapping rule (e.g., `identity_mapping_rules`) that can match future identities by deterministic criteria (exact email, domain + company, or other normalized keys) and assign an account_id or an ignore disposition. The ingest/linking pipeline should consult mapping rules first, then run standard matching; resolved items are marked complete and remain auditable. Ensure rules are versioned and scoped (org/environment) and support rollback/disable.\n\n## Implementation Notes / Guardrails\nMatching suggestions can reuse the existing linker candidate generator/scorer; store only top N candidates to bound storage. Bulk linking should create one rule per pattern (preferred) rather than per-identity overrides, but fall back to per-identity when ambiguity exists. Add permissions and audit logging for all actions (who, when, before/after), plus metrics (queue size, time-to-resolution, auto-link rate uplift, rule hit rate). Provide safe defaults: require explicit confirmation for wide-scope rules (domain/company), show estimated affected future ingests, and prevent rules that conflict with existing higher-priority mappings without an override flow.",
      "link": "https://www.onyx.app/40911"
    }
  ],
  "primary_owners": [
    "kevin_sullivan"
  ],
  "secondary_owners": []
}