{
  "id": "cad4715bb89a4024b64f71b2e22e3bd9",
  "semantic_identifier": "Design--Detect and redact PII in raw customer signal views and exports.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-10-19",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Detect and redact PII in raw customer signal views and exports.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "We will add a PII detection + redaction layer to the customer-signal ingestion and retrieval path so that raw-record views in the UI and any export/download payloads return masked values by default. The scope includes structured fields (e.g., `email`, `phone`, `address`) as well as free-text fields (e.g., notes) where PII may appear inline. Redaction will replace sensitive substrings with a consistent token (e.g., `[REDACTED]`) while preserving non-sensitive context where possible, and will be applied before data reaches any UI-facing “raw customer signal” view or export serializer.\n\nDetection will be implemented as a two-part classifier: (1) schema-aware rules for known sensitive field names/paths in ingested payloads, and (2) pattern-based scanning for free-text using common PII regexes (email, phone, postal address heuristics) with configurable allow/deny lists and thresholds to reduce false positives. We will store the original raw payload encrypted at rest, and store a derived “redacted view” representation (or apply redaction on read) to ensure consistent behavior across endpoints. We will also annotate redacted fields in the response (e.g., `isRedacted: true` or per-field metadata) so UI can render appropriate affordances without revealing content.\n\nAccess to unredacted data will be controlled by a workspace-level RBAC permission, “View sensitive data,” assignable by admins per role. When the permission is present, the same APIs used by the UI and exports will return unredacted values; otherwise they will return redacted values, ensuring we don’t rely on client-side masking. We will ensure this permission is enforced uniformly across: raw record detail APIs, list APIs that include raw payload snippets, export/download endpoints (CSV/JSON), and any internal services invoked by these endpoints.\n\nTesting will include unit coverage for the classifier/redactor with representative PII fixtures (emails with plus-addressing, international phone formats, multiline addresses, PII embedded in notes) and negative cases to guard against over-redaction. Integration tests will validate that UI raw views and exports are redacted by default, unredacted only with the explicit permission, and that API responses match expected shapes/metadata. Finally, we will verify no regressions in fit-score/positioning pipelines by confirming they consume non-PII features only (or that any required fields are unaffected), adding a regression test that compares pipeline outputs before/after redaction changes on a fixed dataset.",
      "link": "https://www.onyx.app/59794"
    }
  ],
  "primary_owners": [
    "jason_morris"
  ],
  "secondary_owners": []
}