{
  "id": "7cd0b9a8f0ce48ee8313d4d128c32da3",
  "semantic_identifier": "Design--Debounce sales/opportunity signals to prevent one-off deal asks from boosting issue priority.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-06-27",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Debounce sales/opportunity signals to prevent one-off deal asks from boosting issue priority.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "### Overview\nToday, a single Sales_Accelerator opportunity link can materially increase an issue/theme priority score, creating disproportionate prioritization from one-off deal asks. We will add a debounce/gating layer to “sales-driven uplift” so uplift is only applied once there is sufficient evidence that the request reflects broader demand. The feature will preserve current workflows (Sales links still attach) while preventing premature score inflation.\n\n### Evidence threshold + scoring behavior\nIntroduce an “Opportunity Evidence” evaluator that runs whenever an opportunity is linked/unlinked or related support signals change. By default, sales uplift is **suppressed** unless the issue/theme meets a minimum threshold such as: (a) at least *N* distinct opportunities (unique account/opportunity IDs) within a configurable time window, and/or (b) at least *M* corroborating support conversations (e.g., tagged tickets) referencing the same theme. If the threshold is met, we apply the existing uplift calculation unchanged; if not met, we apply **zero** uplift and store the computed-but-suppressed uplift value for transparency and analytics.\n\n### Data model + UI transparency\nExtend the issue/theme object with fields like `sales_uplift_status` (Applied/Suppressed), `sales_uplift_suppression_reason` (e.g., “insufficient distinct opportunities”, “missing corroborating support”), `sales_uplift_required_threshold`, and `sales_uplift_candidate_value`. In the UI, show a small “Sales uplift” panel indicating whether uplift was applied; if suppressed, display the reason and what additional evidence is needed (e.g., “1/3 opportunities linked”). This ensures prioritization remains defensible and auditable during roadmap reviews.\n\n### Implementation notes + rollout\nImplement the evaluator as a deterministic service/module used by both async event handlers (opportunity link updates) and periodic backfill (to correct historical data). Add metrics for suppressed vs applied uplifts and track downstream priority-score deltas to validate impact. Roll out behind a feature flag with configurable thresholds per workspace, starting with conservative defaults; provide an admin setting to tune N/M and the time window, and add a one-time migration to populate new fields for existing issues/themes.",
      "link": "https://www.onyx.app/14962"
    }
  ],
  "primary_owners": [
    "tyler_jenkins"
  ],
  "secondary_owners": []
}