{
  "id": "9f5f07eb40ce4448819f071d2dfc6ae5",
  "semantic_identifier": "Design--Define scheduled CRM sync refresh scope and configuration (Salesforce/HubSpot).docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-08-22",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Define scheduled CRM sync refresh scope and configuration (Salesforce/HubSpot).docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "We will define an implementation-ready “scheduled CRM sync contract” for our native Salesforce and HubSpot integrations. This contract will specify (a) the cadence and triggering model for scheduled refresh (e.g., per-workspace interval with jitter/backoff, incremental vs full refresh expectations), (b) the canonical list of CRM objects and fields included in the refresh scope, and (c) the directional boundaries between read-only ingestion and any write-back behavior. The output of this work is primarily documentation plus a structured configuration schema that later tickets (dedupe, conflict resolution, write-back) can depend on without re-litigating scope.\n\nScheduled refresh behavior will be standardized across CRMs while allowing connector-specific nuances. We’ll define supported sync frequencies (default + min/max), whether jobs are per-connector or per-workspace, and what constitutes an incremental refresh (e.g., “modified since last successful run” semantics, pagination limits, and failure retry strategy). We’ll explicitly enumerate in-scope objects (e.g., Accounts/Companies, Contacts, Leads, Opportunities/Deals, Activities where applicable) and in-scope fields required for product functionality, including fields like “next step” and “close plan status” where they exist, with a mapping table that notes field availability differences between Salesforce and HubSpot and how we represent missing/unsupported fields.\n\nWe will also define read vs write-back boundaries for the scheduled job: what data we only read and cache/enrich internally, and what data (if any) is eligible for automated write-back during scheduled runs. If write-back is excluded from scheduled refresh by default, we will document that scheduled sync is strictly read-only and reserve write-back for explicit user actions or separate workflows. If limited write-back is allowed, we will specify which fields, what ownership rules apply, how we detect conflicts, and the source-of-truth precedence; however, the contract will stop short of implementing dedupe/conflict logic and instead provide the required invariants and metadata those later components will use.\n\nConfiguration will include defaults plus environment-level toggles to enable/disable scheduled sync per workspace. We’ll define a workspace-level setting schema (e.g., `scheduled_sync.enabled`, `scheduled_sync.frequency_minutes`, optional per-CRM overrides) with safe defaults (enabled/disabled depending on rollout strategy), and environment flags for global kill-switch and staged rollout (e.g., allowlist workspaces, connector-specific disable). The deliverables are: a written spec, field/object scope tables for Salesforce and HubSpot, configuration schema + defaults, and a clear set of guarantees (timestamps, cursor semantics, idempotency expectations) that subsequent tickets can treat as the source contract for dedupe and write-back implementation.",
      "link": "https://www.onyx.app/49022"
    }
  ],
  "primary_owners": [
    "ryan_murphy"
  ],
  "secondary_owners": []
}