{
  "id": "18d24c86de4f44da850b53a5de9f6296",
  "semantic_identifier": "Design--Forecasting: Implement segment-weighted forecast totals using Customer_Analyzer fit tiers.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-09-22",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Forecasting: Implement segment-weighted forecast totals using Customer_Analyzer fit tiers.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "We will extend the forecasting aggregation pipeline to compute *segment-weighted* forecast totals by applying configurable weights per `Customer_Analyzer` fit tier (e.g., A/B/C) to the opportunity contribution used in rollups (amount × probability, or whatever the existing pipeline uses as the per-opportunity “forecast value”). The goal is to centralize weighting in the backend so the UI can request both raw and weighted totals and render weighted views without re-implementing business logic client-side.\n\nOn ingestion/aggregation, each opportunity will be associated with a fit tier derived from `Customer_Analyzer` (using the existing field/source of truth used elsewhere). For each scenario bucket (baseline/commit/best-case), we compute current raw totals exactly as today, and in parallel compute weighted totals by multiplying the opportunity’s contribution by a tier weight: `weighted_value = raw_value * weight[tier]`. We will support weights as a configuration object (environment/config service), keyed by tier name, with an explicit default weight of `1.0` to preserve existing behavior when weighting is disabled or unknown tiers appear.\n\nThe forecast API response will be extended to include both raw and weighted totals side-by-side for every level of aggregation the UI currently consumes (e.g., overall totals and any existing groupings): `{ totals: { raw: ..., weighted: ... }, scenarios: { baseline: { raw, weighted }, commit: { raw, weighted }, bestCase: { raw, weighted } } }`. This is an additive change: existing fields remain intact, and clients can opt into using the new weighted fields. We’ll also include the resolved weight config metadata (e.g., `weightsApplied: { A: 1.0, B: 0.8, C: 0.5, default: 1.0 }`) to aid UI display/debugging.\n\nFor missing/invalid fit tier values, the pipeline will fall back gracefully to the default weight (1.0) and optionally emit a metric/log counter for observability. We will add tests covering: correct application of weights by tier, correctness across baseline/commit/best-case buckets, behavior when tier is missing/unknown, and ensuring raw totals remain unchanged. A small migration plan will gate rollout behind a feature flag/config toggle so we can deploy the API changes safely before switching UI to weighted views.",
      "link": "https://www.onyx.app/15899"
    }
  ],
  "primary_owners": [
    "tyler_jenkins"
  ],
  "secondary_owners": []
}