{
  "id": "2bb24ef4d0b04e4ea4fa5495efba76c4",
  "semantic_identifier": "Design--Add CRM field mapping auto-discovery and mapping suggestions during setup.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-05-04",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Add CRM field mapping auto-discovery and mapping suggestions during setup.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "## Feature: CRM field mapping auto-discovery + suggestions (Setup)\n\nDuring CRM integration setup, add a dedicated onboarding step that automatically discovers standard and commonly used opportunity/deal fields (e.g., stage, close date, amount, owner, last activity) and proposes default mappings into Sales_Accelerator’s canonical schema. The step runs immediately after a successful CRM connection (and initial object selection, if applicable), fetches available field metadata (API “describe”/schema endpoints), and generates per-canonical-field recommendations (including the specific CRM field, data type compatibility, and any required transforms like currency/enum normalization).\n\nThe suggestion engine should score candidates using a mix of signals: exact/normalized name matches (e.g., `CloseDate`, `close_date`), CRM-native standard field identifiers, data type alignment (date → date, currency/number → amount), picklist/enum similarity for stage, and usage heuristics where available (non-null rate, recently updated, present on most records). For each canonical field, we propose the top match plus alternates, and show a confidence indicator (e.g., High/Med/Low) along with a short reason (“Standard CRM field”, “Name + type match”, “Picklist overlap 80%”). If no strong match exists, we leave it unmapped and prompt the user to choose manually.\n\nThe UI presents a table of canonical fields with suggested mappings, confidence, and an inline control to Accept, Edit (select a different CRM field), or Skip. Editing should validate compatibility (e.g., cannot map text to date) and show warnings rather than blocking where minor transforms can be applied. Users can bulk-accept all High-confidence suggestions, then review the rest. On save, we persist the final mapping configuration and any transform rules, and (optionally) run a lightweight validation pass against a small sample of records to confirm the mapping yields plausible values (e.g., stage not empty, close date parses).\n\nThis step’s output becomes the foundation for downstream setup (benchmarks, stage-based guidance). We should log telemetry on suggested vs. accepted mappings, edit rates, and fields most commonly unresolved to continuously improve heuristics. Failure modes include limited CRM permissions or slow schema endpoints; in those cases, we fall back to manual mapping with clear messaging and allow the user to continue, but flag that certain later features may be degraded until mappings are completed.",
      "link": "https://www.onyx.app/31090"
    }
  ],
  "primary_owners": [
    "jiwon_kang"
  ],
  "secondary_owners": []
}