{
  "id": "29cce8219a1c4b33a80ee89b3ae5f2bc",
  "semantic_identifier": "Design--Add Fit Driver Selection Wizard with recommended defaults.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-05-19",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Add Fit Driver Selection Wizard with recommended defaults.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "### Fit Driver Selection Wizard with Recommended Defaults — Brief Design\n\nWe will add a guided “Fit Driver Selection” step to the workspace setup flow that recommends an initial set of fit drivers based on the workspace’s connected data sources (e.g., CRM fields, survey responses, product usage events, and support tickets). The goal is to reduce time-to-value by pre-populating a sensible default configuration while still letting users control which drivers are used for fit scoring.\n\nOn entry to the step, the backend will compute a recommendation set by inspecting available signals and mapping them to our canonical driver taxonomy (e.g., “Usage frequency” from product events, “Plan tier” from CRM, “NPS/CSAT” from surveys, “Ticket volume/severity” from support). Each recommended driver will include a short explanation (“Recommended because we found X in Y”) and a confidence/strength indicator used only for ordering. The UI will present a list of recommended drivers (checked by default), allow add/remove from the broader driver catalog, and include an “Accept all” action that selects all recommended items and proceeds.\n\nWhen the user continues, we will persist the selected driver set and any default parameters (e.g., which field/event powers a driver, aggregation window, thresholds) to the workspace configuration so downstream fit scoring runs against exactly the same configuration. This configuration should be versioned (or at least timestamped) to support auditing and future migration, and setup completion should be unblocked even if no sources are connected (in which case we fall back to a small generic default set and explain the limitation).\n\nImplementation-wise, we’ll introduce a recommendation service (or module) that takes `workspace_id` and returns `recommendedDrivers[]` with metadata (driver key, source mapping, rationale, suggested defaults). The setup flow will call this endpoint, render the wizard state client-side, then save via a single “upsert workspace fit config” API that stores: selected drivers, per-driver source bindings, and default parameters. We’ll instrument key events (view step, accept all, add/remove, save) to measure adoption and iterate on recommendation quality.",
      "link": "https://www.onyx.app/52577"
    }
  ],
  "primary_owners": [
    "tyler_jenkins"
  ],
  "secondary_owners": []
}