{
  "id": "5081a6b026714d8ab6a88425e33c09d8",
  "semantic_identifier": "Design--Enforce published-only positioning usage in Sales_Accelerator with clear UX when a version is unavailable.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-08-14",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Enforce published-only positioning usage in Sales_Accelerator with clear UX when a version is unavailable.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "### Overview  \nSales_Accelerator currently risks generating messaging from Customer_Analyzer positioning content that may be draft, unversioned, or otherwise not approved for use. This feature enforces “published-only” usage end-to-end: the backend will only allow message generation/sending when the referenced positioning block version is explicitly marked `published/approved`, and the frontend will surface a clear blocking UX when that condition is not met. The goal is to prevent silent content drift and ensure Sales always knows exactly which approved positioning version is being used.\n\n### Backend changes (validation + error contract)  \nIntroduce server-side validation on all Sales_Accelerator endpoints that generate recommendations or send messaging that depends on positioning content. The request must reference a specific positioning block `version_id` (the pinned version); the service will reject any request where the version is missing, does not exist, or is not `published/approved`. In these cases, return a structured error (e.g., `POSITIONING_VERSION_UNAVAILABLE`) that includes: `reason` (missing/unpublished/not_found), `pinned_version_id` (if known), `pinned_version_status`, and `last_known_published_version_id` (optional, only if it matches the pinned version or is explicitly allowed as fallback). Critically, we do not auto-select a different version; the only permitted fallback is the last known pinned version if it is still published, otherwise the operation is blocked.\n\n### Pinned version resolution and data integrity  \nSales_Accelerator should persist and reuse a pinned positioning version per relevant scope (e.g., account/campaign/workflow—matching current pinning behavior). All downstream usage must flow through a single resolver that loads the pinned `version_id` and checks publication state at request time to avoid stale caches. If a pinned version becomes unpublished or deleted, the resolver returns the structured error rather than falling back to the latest version. Add logging/metrics for rejection rates and reasons to quantify how often Sales is blocked due to content state.\n\n### Frontend/UX updates  \nUpdate the messaging/recommendation UI to always display the pinned positioning version identifier (and optionally a friendly label/timestamp) used to generate content. When the backend returns `POSITIONING_VERSION_UNAVAILABLE`, render a blocking state that explains why messaging can’t be generated/sent (e.g., “Pinned positioning version is not published”) and provides a clear call-to-action: “Request Marketing to publish a new approved variant,” rather than silently switching content. If the last known pinned version is still valid, the UI may allow proceeding only with that exact version; otherwise, it must block with explicit guidance and no automatic substitution.",
      "link": "https://www.onyx.app/51265"
    }
  ],
  "primary_owners": [
    "andre_robinson"
  ],
  "secondary_owners": []
}