{
  "id": "34c94cf751874dd28bb881df0c57a5e3",
  "semantic_identifier": "Design--Issue prioritization v2: UI for scoring profile selection + tuning controls.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-09-05",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Issue prioritization v2: UI for scoring profile selection + tuning controls.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds a “Scoring profile” selector and tuning controls to Issue Prioritization v2 so users can choose which scoring profile (org-level or user-level) is active and optionally adjust per-dimension weights for the three current dimensions: Support SLA risk, Product impact, and Sales deal blockers. The active profile determines how issue scores are computed and displayed throughout the UI. If no profile is selected, we must preserve today’s behavior by applying a default profile configuration that reproduces the existing single-score output.\n\nOn the UI surface area, we’ll introduce (1) a profile dropdown (showing org profiles and, when available, user profiles with clear labeling), and (2) a compact tuning panel that exposes weight controls per dimension (e.g., sliders or numeric inputs with validation and a clear “reset to profile defaults” action). In both the issue list and issue detail view, we’ll display each per-dimension score and the resulting aggregated score computed from the active profile’s weights; the aggregated score becomes the primary sort/display score consistent with current prioritization. The list view should remain scannable (e.g., aggregated score prominent, dimension breakdown available inline or via hover/expand), while the detail view can show the full breakdown and weight context.\n\nFor backend integration, the frontend will wire to the saved profiles APIs delivered in GOLD-166: list profiles to populate the selector; apply a selected profile as the active profile for the current user/session (depending on API semantics); and update a profile when a user adjusts weights (either directly persisting edits or via an explicit “Save” action). The scoring UI should treat the active profile as the source of truth: when the profile changes, we refetch/recompute and update the issue list/detail scores accordingly. We’ll also handle empty/unauthorized states (no profiles available, cannot edit org profile) by falling back to default behavior and disabling editing where appropriate.\n\nKey considerations are state management and consistency: the selected profile and any unsaved tuning changes must be clearly represented, not silently lost on navigation, and must not cause inconsistent scores between list and detail. We’ll define a deterministic aggregation function (dimension score × weight, normalized as needed to match existing scoring scale) and ensure the “default profile” is constructed to match the current single-score behavior exactly. Success criteria: users can select/apply profiles, adjust weights, see immediate score breakdown updates across list and detail, and the system behaves identically to today when no profile is selected or profiles are unavailable.",
      "link": "https://www.onyx.app/16013"
    }
  ],
  "primary_owners": [
    "andre_robinson"
  ],
  "secondary_owners": []
}