{
  "id": "d54b7fd2d0fa4278ba111b677c184b4c",
  "semantic_identifier": "Design--issue_clustering v2: Add multilingual normalization + embeddings pipeline for cross-language clustering.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2026-01-15",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--issue_clustering v2: Add multilingual normalization + embeddings pipeline for cross-language clustering.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "## issue_clustering v2: Multilingual normalization + embeddings pipeline for cross-language clustering\n\nWe will extend the issue clustering ingestion path to support cross-language clustering by detecting the language of each customer conversation (or message chunk) and routing it through a multilingual text representation pipeline. The goal is that semantically equivalent issues reported in different languages (e.g., “app crashes on launch” in English/Spanish/Japanese) produce comparable vectors and can co-cluster, while preserving current English-only clustering behavior and quality.\n\nAt ingest time, we will add a language detection step that produces `detected_language` (BCP-47 tag + confidence) and store it alongside the raw text. For representation, we will support two modes behind a config flag: (1) multilingual embeddings directly on the original text using a multilingual embedding model, and (2) optional normalization via translation-to-English (or canonical language) followed by the existing English embedding model. Regardless of mode, we will persist both `original_text` and the `normalized_text` (translated and/or otherwise normalized) used for embedding, plus `embedding_model_id` and `normalization_strategy`, so clustering decisions are auditable and searchable.\n\nDownstream clustering inputs will be updated to include these new fields and to ensure embeddings are generated consistently per strategy. Clustering should operate on the chosen embedding vectors, but indexing/search should allow filtering by detected language and optionally searching across original vs normalized text. We’ll add guardrails for low-confidence language detection (fallback to multilingual embedding on original, or skip translation) and for mixed-language messages (choose dominant language at chunk-level, or embed per chunk and aggregate at conversation-level).\n\nFor validation, we will add a lightweight evaluation suite: a fixed multilingual test set of issue pairs/groups across supported languages with expected co-clustering, and a regression set of existing English-only examples to ensure cluster purity/precision does not regress. Checks will run in CI and in staging with metrics such as cross-language recall@k (do translations land in the same cluster), English cluster stability (ARI/NMI vs baseline), and manual spot-check outputs including the stored `detected_language`, `original_text`, and `normalized_text` for auditability.",
      "link": "https://www.onyx.app/85658"
    }
  ],
  "primary_owners": [
    "andre_robinson"
  ],
  "secondary_owners": []
}