{
  "id": "98530f5b25dc417d8bf3b6856f938b8f",
  "semantic_identifier": "Design--Add auditable change history + source provenance for Attribution Evidence fields.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-11-12",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Add auditable change history + source provenance for Attribution Evidence fields.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "### Overview / Goals\nWe will add an auditable change history for all Attribution Evidence fields on `Issue` objects, capturing (a) previous and new values, (b) timestamp, (c) actor identity and type (human user vs. system enrichment job), and (d) source provenance references (e.g., CRM account/contact IDs, opportunity ID, conversation/thread IDs). The primary goal is to make attribution inputs verifiable and reduce disputes by showing when values changed and what upstream artifacts informed the change. A secondary goal is to ensure enrichment writes always attach stable “source pointers” so data origin is consistent even if upstream text changes.\n\n### Data model / Write path\nIntroduce an append-only `IssueAttributionEvidenceChange` (or `IssueFieldChange`) record keyed by `issue_id`, with fields: `field_key`, `old_value` (JSON), `new_value` (JSON), `changed_at`, `actor_type` (`USER|ENRICHMENT`), `actor_id` (nullable for system), `job_run_id` (nullable), and `source_refs` (array of typed references like `{type: CRM_OPPORTUNITY, id: \"...\"} `). All writes to Attribution Evidence fields (UI edits, API updates, background enrichment) will go through a single service layer that (1) computes a diff per field, (2) persists the `Issue` update, and (3) inserts corresponding change records in the same transaction. Enrichment jobs must provide `source_refs` (and `job_run_id`) on every update; if unknown, we store an explicit `UNKNOWN` ref rather than omitting provenance.\n\n### Read path / UI\nIn the Issue detail view, add an “Attribution Evidence History” section that lists changes chronologically (most recent first) and groups by field. Each entry shows: field name, old → new (with compact rendering for structured values), timestamp, actor label (“Edited by Alice” / “Updated by Enrichment Job <name>”), and clickable source references (deep links where possible, otherwise copyable IDs). Provide basic filtering by field and actor type; pagination loads older entries on demand. This section is read-only and does not change existing edit flows besides routing them through the audited write path.\n\n### Operational considerations / Migration\nBackfill is optional; by default history starts at deployment time. If we need initial state provenance, we can insert a synthetic “initial value” change per field with `actor_type=SYSTEM` and `changed_at=issue.created_at`. Add guardrails: do not record no-op writes (old == new), redact or hash any sensitive free-text if Attribution Evidence can contain PII, and enforce retention/partitioning if volume is high (e.g., index on `issue_id, changed_at`). Add tests for: multi-field updates producing multiple change records, transactionality (no history without write and vice versa), enrichment writes requiring `source_refs`, and UI rendering for JSON/array fields.",
      "link": "https://www.onyx.app/17147"
    }
  ],
  "primary_owners": [
    "andre_robinson"
  ],
  "secondary_owners": []
}