{
  "id": "1b6cdea4556b425f9ed89195d33856da",
  "semantic_identifier": "Design--UI: Surface tag/priority change requests and enable owner approval/rejection.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-07-21",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--UI: Surface tag/priority change requests and enable owner approval/rejection.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "On the Issue detail page, we will surface any pending tag and priority change requests generated when a non-owner attempts to modify those fields (as introduced in GOLD-172). The UI will add a “Pending Changes” section near the existing Tags/Priority fields (and/or in the activity rail) that lists each request as a discrete item. Each item will clearly show: field type (Tag vs Priority), proposed value, requester (name + link), source (e.g., “Issue detail edit”, “bulk edit”, “API” if available), and timestamp.\n\nField owners will be able to action each request directly from this list via **Approve** and **Reject** controls. Approve will immediately apply the proposed value to the Issue (updating the visible Tag/Priority chips and triggering any existing side effects like notifications/activity entries). Reject will require (or strongly prompt for) a short rejection reason; the request will then be marked rejected and removed from the “pending” list while remaining visible in a “Request History” view for auditability.\n\nOn the backend/API integration side, the UI will rely on a change-request endpoint that supports: fetching pending + historical requests for an Issue, approving a request (atomic: approve + apply field update), and rejecting a request with a reason. We will handle optimistic updates for approvals (update UI immediately, revert on failure) and show inline errors per request item. Concurrency will be handled by disabling actions while a request is in-flight and by gracefully handling already-resolved requests (e.g., if two owners act simultaneously).\n\nAcceptance criteria: (1) Owners see pending tag/priority requests on the Issue detail page with requester/proposed value/source/timestamp. (2) Owners can approve/reject each request; approval updates the Issue immediately. (3) Rejections require a reason and are retained in request history alongside approvals. (4) Non-owners can view request status/history but cannot action requests. (5) Activity/audit trail clearly reflects request creation and resolution events.",
      "link": "https://www.onyx.app/72928"
    }
  ],
  "primary_owners": [
    "jason_morris"
  ],
  "secondary_owners": []
}