{
  "id": "427fa07353db43218eeb0dff0dd45e8b",
  "semantic_identifier": "Design--[BUG][Ticket 3/5] Implement inline editing UI for segment positioning templates.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-04-27",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--[BUG][Ticket 3/5] Implement inline editing UI for segment positioning templates.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "### Overview\nWe will add an inline editing experience for “segment positioning templates” within the Segment Detail view, covering four sections: value props, differentiators, proof points, and objections. The UI will reuse the template payload schema defined in GOLD-4 and support toggling between a read-only display and an edit mode per section (or for the full template, depending on existing page patterns). This ticket intentionally stops short of persistence: edits remain local to the client and are not saved to the server.\n\n### Data model & defaults\nThe Segment Detail view will derive the displayed template from either (a) an existing custom template attached to the segment (if present) or (b) server-provided defaults when no custom template exists. On entering edit mode, we initialize local form state from the currently displayed template (custom if present, otherwise defaults). If the user cancels, we revert local state to the last displayed source-of-truth and continue to show defaults when no custom template exists.\n\n### UI/UX & state management\nEach section renders as read mode by default (formatted list/text mirroring existing template rendering). In edit mode, fields become inputs (likely textarea or list editors consistent with schema), with inline error messages. We will implement local form state plus dirty tracking at both the field and section/template level (e.g., `isDirty` computed from initial snapshot vs current state). The UI will expose clear actions: Edit → (Save disabled/not implemented) + Cancel; additionally, we can show a non-blocking “Unsaved changes” indicator when dirty.\n\n### Validation & out of scope\nWe will implement basic client-side validation aligned to schema constraints: required fields and length limits (e.g., min/max characters or max items per list, as specified in GOLD-4), run on change/blur and on attempted “save” (even though persistence is not wired, we can validate and keep the user in edit mode). Out of scope: API endpoints, mutations, optimistic updates, server-side validation, and persistence; the “Save” affordance can be present but no-ops behind a feature flag or remains disabled with a tooltip until the next ticket wires it up.",
      "link": "https://www.onyx.app/93062"
    }
  ],
  "primary_owners": [
    "jiwon_kang"
  ],
  "secondary_owners": []
}