{
  "id": "10ddddb93d454b70a77652c1462de614",
  "semantic_identifier": "Design--Define alert types and trigger conditions for fit drift, segment changes, and emerging high-fit cohorts.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-10-30",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Define alert types and trigger conditions for fit drift, segment changes, and emerging high-fit cohorts.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature defines a versioned **Alert Contract** for three alert categories: **(1) Fit Drift**, **(2) Segment Membership Changes**, and **(3) Emerging High-Fit Cohorts**. The contract will specify: required inputs/signals (e.g., entity fit scores with timestamps, segment definitions + membership snapshots, cohort aggregation dimensions, volume/baseline metadata), standardized naming/IDs, evaluation cadence (e.g., hourly/daily), and suppression/dedup rules (e.g., minimum time between identical alerts, “resolved” vs “firing” states). The output is a single source of truth that downstream alert delivery (email/Slack/UI) and engineering implementation can rely on and QA against.\n\n**Fit Drift alerts** trigger when an entity’s fit distribution meaningfully shifts relative to a baseline window. The spec will define the drift metric (e.g., change in mean/median fit score, PSI/KS distance, or % above a threshold), baseline and lookback windows (e.g., trailing 14d baseline vs last 24h), minimum sample sizes, and thresholds (absolute and/or relative). It will also define whether drift is evaluated per segment, per account, or globally, and how to handle score recalibrations/model version changes (e.g., reset baseline on model version bump, tag payload with model version).\n\n**Segment Membership Change alerts** trigger on significant changes in membership for a defined segment (additions/removals, net change, churn rate) between two comparable snapshots. The contract will define snapshot cadence, comparison method (latest vs previous, or rolling average), and thresholds (e.g., >X% net change and >N absolute members). It will specify identity semantics (member uniqueness keys), how to treat segment definition edits (treat as “segment version” change and suppress/annotate), and how to attribute changes when upstream data sources lag.\n\n**Emerging High-Fit Cohort alerts** trigger when a new or previously low-signal cohort crosses a “high-fit” threshold with sufficient volume and sustained signal. The spec will define cohort dimensions (e.g., industry, geography, product usage band), “high-fit” definition (e.g., % of members with fit ≥T, or cohort mean fit ≥T), emergence logic (first time crossing threshold, or growth rate vs baseline), and guardrails (minimum N, minimum persistence across K evaluations, multiple-testing control if scanning many cohorts). For all alert types, we will document edge cases (missing/late data, low-volume noise, backfills, partial recomputations), and define the required alert payload fields: `alert_type`, `alert_version`, `scope` (account/segment/cohort IDs + version), `detected_at`, `evaluation_window`, `baseline_window`, `metrics` (computed values + thresholds), `severity`, `state` (firing/resolved), `dedupe_key`, `top_contributors` (optional), and `links/context` for downstream UI.",
      "link": "https://www.onyx.app/31967"
    }
  ],
  "primary_owners": [
    "andre_robinson"
  ],
  "secondary_owners": []
}