{
  "id": "7e2619f899ef4efdafd2c4ee1929528e",
  "semantic_identifier": "Design--Implement CRM-embedded Guidance panel shell for Account & Opportunity views.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-04-12",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Implement CRM-embedded Guidance panel shell for Account & Opportunity views.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "We will implement an in-CRM “Guidance” panel shell (per GOLD-72) that embeds directly within Salesforce and HubSpot record pages for **Account** and **Opportunity** objects, without redirecting users to Sales_Accelerator. The goal of this ticket is to deliver a functioning container surface that can be mounted in the CRM UI, sized appropriately for the record page layout, and ready to host future guidance content blocks. The panel will be a lightweight web component/iframe-based embed (depending on existing CRM integration patterns) that renders a consistent header + body region and can be reused across both CRMs and both object types.\n\nOn load, the embedded panel will resolve the **record context**: `{crmProvider, objectType, recordId}`. For Salesforce, this comes from the record page context (e.g., Lightning page parameters); for HubSpot, from the CRM card/extension context. The panel will call a shared “context bootstrap” endpoint in our backend with those identifiers to validate access and fetch minimal metadata needed for container readiness (e.g., object existence, permissions flags, and any feature gating). This establishes the contract that future guidance services can rely on, while keeping this ticket scoped to wiring + shell.\n\nFor authentication/session handoff, the embed will use the existing CRM OAuth/session integration (or SSO token exchange) to obtain an app session without interactive login. The panel will attempt silent auth on initialization (token exchange or signed context), persist the resulting app session (cookie or storage per our current web auth model), and refresh as needed. Failure modes must be explicit: unauthenticated (prompt to re-auth in a safe inline way or show an error state), unauthorized (no access to record), and transient errors (retry affordance). No navigation away from the CRM record page should occur.\n\nThe UI will implement basic container states: **Loading** (skeleton/spinner while auth+bootstrap resolve), **Empty** (no guidance configured/available for this record yet), and **Error** (network/auth/unsupported object with a retry + diagnostics marker). The “empty” state should be deterministic based on bootstrap response (e.g., guidance not enabled for org/object) and should not attempt to render any guidance blocks yet. This establishes the embedded surface, context wiring, and state machine that subsequent tickets will extend to render guidance blocks and perform copy/actions.",
      "link": "https://www.onyx.app/65495"
    }
  ],
  "primary_owners": [
    "jason_morris"
  ],
  "secondary_owners": []
}