{
  "id": "a1bca885080648c9a9a0b4f347961dfa",
  "semantic_identifier": "Design--Forecasting: Add commit & best-case scenario buckets to forecast model and UI.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-08-17",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Forecasting: Add commit & best-case scenario buckets to forecast model and UI.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds explicit **Commit** and **Best-Case** scenario buckets to our forecasting model and UI, alongside the existing baseline forecast. The goal is to let users see three totals (Baseline / Commit / Best-Case) at every level of aggregation (opportunity, account, team rollups, and time buckets) with consistent scenario assignment across the entire pipeline.\n\nOn the data/model side, we will extend the forecast schema to store per-opportunity (or per-line) scenario attribution and aggregated scenario totals. Concretely, we’ll add a `forecastScenario` dimension (enum: `BASELINE`, `COMMIT`, `BEST_CASE`) derived from the CRM’s stage/forecast category, with a deterministic mapping table and a fallback default (e.g., unknown/unmapped categories → `BASELINE`). Aggregation jobs will be updated to compute totals per scenario and time period, ensuring idempotency and preventing double counting when opportunities change stage/category.\n\nOn the API side, the forecast read endpoints will return scenario-broken-down totals in a backwards-compatible shape (either adding new fields or a `scenarios` object keyed by scenario). The API will preserve existing baseline fields for current consumers while enabling the UI to render all three. We’ll also expose the effective scenario mapping metadata (optional) so the UI can explain why an opportunity is counted as Commit vs Best-Case when needed.\n\nOn the UI side, we will update the forecast views to display Commit and Best-Case totals alongside baseline in all relevant summaries and charts, with clear labeling and consistent colors. Users should be able to compare scenarios at a glance without changing filters; existing filters (time range, owner/team, account) apply uniformly across scenarios. We will add lightweight validation/monitoring to detect unmapped CRM categories and ensure scenario assignment remains consistent across accounts/opportunities as CRM stages evolve.",
      "link": "https://www.onyx.app/34039"
    }
  ],
  "primary_owners": [
    "kevin_sullivan"
  ],
  "secondary_owners": []
}