{
  "id": "347aea5c1c124ff7b7c7b24c35fe7bba",
  "semantic_identifier": "Design--Adjust priority scoring to weight sales/opportunity signals by quality and cap their influence.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-06-23",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Adjust priority scoring to weight sales/opportunity signals by quality and cap their influence.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "We’ll update the priority scoring model to make sales/opportunity signals more representative of true business impact and less able to overwhelm other evidence. Today, linking an issue to an opportunity can disproportionately inflate its score; this change introduces (1) quality-weighted opportunity influence, (2) a hard cap on sales contribution, and (3) time decay so stale opportunities fade out. The goal is to preserve the value of sales signals while keeping prioritization anchored to current, credible customer evidence.\n\nOn ingestion, each linked opportunity will produce a normalized “opportunity quality score” derived from configurable factors such as stage (e.g., discovery vs. negotiation), ARR magnitude (log-scaled / bucketed to avoid cliffs), and ICP fit (boolean or tiered). If multiple opportunities are linked, we’ll aggregate with a saturating function (e.g., sum then apply diminishing returns) so many small opportunities don’t outscore one strong one. We’ll apply time decay based on last meaningful activity date (or close date if unavailable), using an exponential or piecewise decay that reduces contribution after a defined half-life and approaches zero after a max age.\n\nIn scoring, the sales component becomes: `SalesScore = min(SalesCap, f(aggregated_quality * time_decay))`. Separately, we’ll enforce a “support dominance” rule: when support/customer evidence is sparse (below a threshold of signals such as ticket volume, affected accounts, or qualitative confirmations), the maximum allowable SalesScore is additionally capped to not exceed the available support/customer contribution (e.g., `SalesScore <= SupportScore` or `<= SupportScore * k`, with k configurable and default 1.0). This ensures sales linkage can’t elevate an issue beyond what customer evidence can substantiate, especially in early/low-signal cases.\n\nImplementation will update the scoring service/model with new fields for opportunity metadata (stage, ARR, ICP fit, last activity) and a migration/backfill for existing linked opportunities where data is available. We’ll add configuration knobs (caps, decay half-life, sparse-evidence thresholds, factor weights) with safe defaults, plus instrumentation to compare old vs. new scores, monitor distribution shifts, and detect regressions (e.g., top-N issue rank changes). Rollout will be behind a feature flag with side-by-side scoring for validation, then gradual enablement once the ranking impact aligns with expectations.",
      "link": "https://www.onyx.app/36083"
    }
  ],
  "primary_owners": [
    "andre_robinson"
  ],
  "secondary_owners": []
}