{
  "id": "5981bcd6ad3842469e6e3ce05b2ce7f3",
  "semantic_identifier": "Design--Sales_Accelerator v2: Ingest deal-risk context and map to Issue_Tracker issue objects.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2026-01-01",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Sales_Accelerator v2: Ingest deal-risk context and map to Issue_Tracker issue objects.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds the first “wiring” between Sales_Accelerator v2 and Issue_Tracker by ingesting deal-risk signals and attaching them to the correct Issue_Tracker issue objects (typically a theme/root-cause issue). The core goal is to make deal-risk context available on the issue’s context record—without changing prioritization yet—so downstream logic can later boost priority using reliable, normalized inputs. The integration will run as a background job (scheduled and/or event-driven depending on SA v2 availability) that pulls new/updated risk signals since the last successful checkpoint and processes them idempotently.\n\nMapping is based on stable identifiers: (1) account/customer identity (e.g., CRM account ID or canonical customer ID) and (2) related conversations (e.g., conversation IDs that can be traced to the same account and to an Issue_Tracker issue via existing conversation→issue linking). The mapper will attempt to resolve each incoming signal to a single Issue_Tracker issue object; when multiple candidate issues exist (ambiguous) or none exist (missing), we will not attach the signal and instead emit structured logs/metrics. The mapping layer should be explicit and deterministic, preferring exact ID matches, then strongest conversation linkage, and rejecting fuzzy matches to avoid corrupting issue context.\n\nOnce mapped, we persist a normalized deal-risk payload onto the issue context record (or a dedicated child table keyed by issue_id + source + external_signal_id). Normalized fields include at minimum: risk_score (numeric + optional band), impacted_deal_ids (array), deal_stage, ARR (currency + amount), signal_timestamp, source identifiers, and any provenance needed for traceability (SA v2 signal ID, account ID, conversation IDs used for mapping). Writes are upserts to support replay and updates; we keep the latest snapshot and optionally append a small history for audit/debug if storage allows, but no consumers are required in this phase.\n\nValidation and observability are included from day one: schema validation on inbound payloads, required identifiers (account/customer, deal IDs), and sanity checks (e.g., non-negative ARR, bounded risk score). For failures we log structured events with error codes (MAPPING_NOT_FOUND, MAPPING_AMBIGUOUS, VALIDATION_FAILED, WRITE_FAILED) and capture counters + sample payloads with PII-safe redaction. Success paths log mapping resolution and write outcomes at debug level. The feature explicitly does not modify prioritization logic; it only enriches issue context for future priority boosting and provides enough telemetry to evaluate mapping coverage and data quality.",
      "link": "https://www.onyx.app/91476"
    }
  ],
  "primary_owners": [
    "brooke_spencer"
  ],
  "secondary_owners": []
}