{
  "id": "e8f646de14f246d39b31aad99c0e1a55",
  "semantic_identifier": "Design--[BUG][Ticket 4/5] Wire inline positioning template edits to save/update via segment-scoped API.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-05-11",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--[BUG][Ticket 4/5] Wire inline positioning template edits to save/update via segment-scoped API.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "### Overview\nWe need to wire the inline positioning template editor UI (GOLD-6) to the segment-scoped positioning template CRUD API (GOLD-4) so edits persist per segment. Today the editor can be modified locally but does not reliably save/update via the correct segment API or re-hydrate from the server. This work adds the full save/cancel lifecycle, correct dirty-state management, and consistent post-save refresh behavior while preserving default templates when no segment override exists.\n\n### UX + State Model\nThe editor will load an “effective template” for a given segment: if a custom segment template exists, use it; otherwise render the product default template in a read-only “baseline” sense but still allow creating an override on edit. We’ll track `initialValue` (last server-sourced effective template), `draftValue` (local edits), and `isDirty = !deepEqual(draftValue, initialValue)`. **Cancel** reverts `draftValue` to `initialValue` and clears errors. **Save** is enabled only when dirty and not already saving; on success we replace both `initialValue` and `draftValue` with the server response to ensure formatting/normalization matches backend behavior.\n\n### API Wiring + Error Handling\nOn save, call the segment-scoped endpoint using “upsert” semantics: if there is an existing segment template id, call update; otherwise call create for that segment. If the user clears back to “exactly default” (if supported by product), we should delete the segment override instead of saving a redundant copy; otherwise we always maintain the override. Server-side validation errors (e.g., invalid placeholders/structure) will be mapped to field-level inline errors where possible, and otherwise shown as a banner/inline message at the editor level. Network/unknown errors will show a toast with a retry affordance and keep the draft dirty.\n\n### Post-Save Refresh + Edge Cases\nAfter any successful create/update/delete, the UI must refresh from the API response (or refetch) and reset dirty state, ensuring the editor reflects backend canonicalization and any computed defaults. If no custom template exists after refresh, we fall back to the default template while indicating “Using default” state. We should also handle stale writes (optional): if the API returns a version conflict, show a toast and refetch to reconcile. Telemetry/logging should capture save success/failure and validation error types to help monitor rollout.",
      "link": "https://www.onyx.app/12634"
    }
  ],
  "primary_owners": [
    "andre_robinson"
  ],
  "secondary_owners": []
}