{
  "id": "92bf140a1c754d78a6b69e137e732414",
  "semantic_identifier": "Design--Issue prioritization v2: Backend support for saved scoring profiles (CRUD + apply).docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-06-22",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Issue prioritization v2: Backend support for saved scoring profiles (CRUD + apply).docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "### Overview\nWe will add backend support for **saved scoring profiles** to power Issue Prioritization v2. A scoring profile encapsulates (a) per-dimension weights (e.g., Support SLA risk, Product impact, Sales deal blockers) and (b) aggregation settings used to compute an issue’s aggregated priority score. Profiles will be persisted and selectable so that teams can standardize scoring across an org, while still allowing an optional user default.\n\n### Data model & persistence\nIntroduce a `scoring_profiles` table (or equivalent store) keyed by `org_id` with fields like `id`, `name`, `description`, `weights` (JSON map of dimension → weight), `aggregation` (e.g., method + normalization options), `scope` (org), `created_by`, `updated_by`, timestamps, and a soft-delete flag if needed. Optionally support a user default via a `user_settings` field `default_scoring_profile_id` (or a small `user_scoring_defaults` table) constrained to profiles in the same org. Add validation at write time (known dimensions, weight ranges, aggregation config schema) and enforce unique profile names per org if desired.\n\n### APIs (CRUD + apply)\nAdd REST endpoints under `/orgs/:orgId/scoring-profiles`:\n- `POST /scoring-profiles` create a profile\n- `GET /scoring-profiles` list profiles (optionally include the default flag for the requesting user)\n- `GET /scoring-profiles/:id` fetch a profile\n- `PATCH /scoring-profiles/:id` update\n- `DELETE /scoring-profiles/:id` delete (soft delete recommended)\nAdd an “apply” surface in scoring computation: when requesting an issue’s aggregated score (existing compute endpoint or service), accept `scoringProfileId` (explicit) and otherwise fall back to the user default, then org default, then system default. The scoring service will load the chosen profile, apply weights and aggregation settings, and return both the computed score and the profile metadata used (id/name/version) for traceability.\n\n### Backward compatibility & rollout\nTo preserve current behavior, we will provide a **built-in default profile** per org (materialized or virtual) that mirrors the existing single-score logic and is used when no profile is selected. Existing clients that do not send `scoringProfileId` will see unchanged results. Rollout can be phased: ship persistence + CRUD first, then enable selection in the scoring pipeline, and finally expose profile selection in the UI. Add basic audit logging for profile changes, and ensure deletes do not break historical computations by either preventing deletion of “in use” profiles or retaining soft-deleted profiles for lookup.",
      "link": "https://www.onyx.app/86396"
    }
  ],
  "primary_owners": [
    "tyler_jenkins"
  ],
  "secondary_owners": []
}