{
  "id": "e95f7a35734c4acebe7a13e563f13273",
  "semantic_identifier": "Design--Pin positioning block version per recommendation to prevent drift on Marketing updates.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-08-01",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Pin positioning block version per recommendation to prevent drift on Marketing updates.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "### Pin positioning block version per recommendation to prevent drift on Marketing updates\n\nWe will update recommendation/message generation to always use an explicit `positioningBlockVersionId` chosen at generation time, instead of resolving “latest” at render/runtime. The source of truth for selectable versions will be the stored Customer_Analyzer positioning block versions. When we generate a recommendation (or any message content derived from these blocks), we will select a specific version id deterministically (e.g., from the analyzer output for that customer/context) and treat it as immutable for that recommendation’s lifetime.\n\nData model changes: add a required `positioningBlockVersionId` column/field on the generated `Recommendation`/`Message` record (and any child records that can be rendered independently, if applicable). Rendering, edits, and follow-up sequences will read this pinned id and fetch the corresponding positioning block version content directly, ensuring the same recommendation renders identically over time regardless of newer Marketing-published versions. Any APIs or internal services that currently accept “latest” semantics will be refactored to require an explicit version id for these flows.\n\nError handling and fallback: if the pinned `positioningBlockVersionId` cannot be fetched (deleted, permissions, corruption), we will fail the operation with a clear error stating that the pinned version is unavailable. We will also implement an explicit fallback path to the last known pinned version for that recommendation/message (e.g., the most recent successful render’s pinned id stored on the record or an audit trail), but we will not silently auto-upgrade to “latest.” If no fallback pinned version exists, we hard-fail and surface actionable remediation (e.g., regenerate recommendation with a newly selected version).\n\nMigration and rollout: backfill existing recommendations/messages by resolving the version that was used at the time of creation when possible (e.g., from analyzer metadata, render logs, or stored snapshot references); otherwise pin to the then-current version at migration time and mark records with a migration flag for visibility. We’ll gate the change behind a feature flag, add logging/metrics for “missing pinned version” and “fallback invoked,” and add tests to ensure (1) new Marketing versions do not change existing recommendation renders, (2) re-renders/edit flows always reuse the pinned id, and (3) missing versions produce explicit errors without upgrading to latest.",
      "link": "https://www.onyx.app/96860"
    }
  ],
  "primary_owners": [
    "jason_morris"
  ],
  "secondary_owners": []
}