{
  "id": "17cbe75191544a57be71630337b9adc2",
  "semantic_identifier": "Design--Add counterfactual “what would improve fit” suggestions to Fit Score explainability.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2026-01-20",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Add counterfactual “what would improve fit” suggestions to Fit Score explainability.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "We will extend the Fit Score explainability service to return counterfactual guidance: “what would need to change for this segment/account to materially increase Fit Score.” Given an entity’s current feature vector and the scoring model, the service will compute a small set of minimal, actionable adjustments across supported signal groups (firmographics, product usage, integrations, support volume, etc.) and present them as ranked suggestions. This is intended to complement existing “why this score” explanations with “how to improve it,” without changing the Fit Score itself or the underlying model behavior.\n\nThe API will add a deterministic, bounded output schema: `suggestions: [{rank, signal_key, current_value, suggested_value, change_type, expected_fit_delta, confidence, constraints, rationale}]` plus metadata (model version, generated_at, truncation flag). We will return at most `N` suggestions (configurable; default 5), each with an expected score delta derived from a local sensitivity analysis (e.g., one-at-a-time perturbation with guardrails) and a concrete required field/value change. Determinism and stability are enforced by fixed ordering (expected delta desc, then stable key sort), fixed rounding, and avoiding stochastic sampling; if multiple suggestions are equivalent, tie-breaking is stable and documented.\n\nSafety/quality constraints will be applied before any suggestion is emitted: no PII fields (explicit allowlist of eligible signals), no recommendations that require impossible or non-actionable changes (e.g., “change country,” “increase employee count” unless explicitly permitted; integrations only if available and compatible), and no advice that implies individual user actions or support content. Suggestions will be bounded to sane ranges (caps, monotonic constraints), and a “no good suggestions” outcome will be allowed when signals are low or the model is saturated. We will also ensure we do not leak raw underlying values where that might expose sensitive information, favoring bucketed/normalized representations when needed.\n\nTesting will include unit coverage for (1) low-signal entities where the output should be empty or contain low-confidence, capped suggestions, (2) conflicting signals where proposed changes fight each other and must be de-duplicated/filtered, and (3) capped output size and deterministic ordering across repeated calls. We’ll add golden tests for schema stability and rounding, and guardrail tests ensuring disallowed fields never appear and that impossible changes are rejected. Rollout will be behind a feature flag with logging of suggestion counts, truncation rate, and rejection reasons to validate quality before enabling broadly.",
      "link": "https://www.onyx.app/68841"
    }
  ],
  "primary_owners": [
    "ryan_murphy"
  ],
  "secondary_owners": []
}