{
  "id": "3d7c276f81c04de781a31ea7560e0f43",
  "semantic_identifier": "Design--Add diagnostics for missing/invalid Customer_Analyzer data in sales initiation recommendations.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-04-06",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Add diagnostics for missing/invalid Customer_Analyzer data in sales initiation recommendations.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "### Overview\nSales initiation recommendations depend on `Customer_Analyzer` inputs (fit score, segment, positioning block) to rank accounts and select messaging templates. Today, when these inputs are missing/invalid at render time, we silently apply fallbacks, which can produce confusing ordering or unexpected copy with no way for SDRs/Sales Ops to understand why. This feature adds render-time diagnostics: structured logging + lightweight UI debug information (feature-flagged) and basic metrics that quantify how often fallbacks occur.\n\n### Instrumentation & Validation\nAt recommendation render time, we will validate the presence and basic correctness of required inputs per account: `fit_score` (present, numeric, within allowed range), `segment` (present, in known enum), and `positioning_block` (present, non-empty, matches expected schema/version). For each account, we will compute a “field status” map (`used`, `missing`, `invalid`, `fallback_applied`) and emit a single structured log event (e.g., `sales_initiation.reco.customer_analyzer_diagnostics`) including account id, recommendation id, field status, and which fallbacks were applied. Logs should be sampled (configurable) to control volume and must exclude any sensitive freeform content from positioning blocks (store only presence/validity + hash/version).\n\n### Debug Payload / Tooltip (Feature Flag)\nBehind a feature flag (e.g., `reco_ca_debug_tooltip`), the backend will optionally attach a small debug payload to each recommendation card: `fields_used[]`, `fields_fallbacks[]`, and `reason_codes[]` (e.g., `FIT_SCORE_MISSING_DEFAULTED`, `SEGMENT_INVALID_DEFAULTED`, `POSITIONING_EMPTY_DEFAULTED`). The frontend will render this as a compact tooltip or “debug” link visible only to enabled users (Sales Ops/SDR power users), allowing them to quickly see which inputs drove the ranking/template versus what was substituted. The UI will avoid exposing raw analyzer text; it will only show field-level diagnostics and fallback types.\n\n### Metrics & Success Criteria\nWe will add basic counters/gauges for fallback behavior: overall fallback rate, per-field fallback rate, and “any invalid/missing” rate, segmented by environment and optionally by workspace/customer. These will be emitted via our standard metrics pipeline and dashboarded with alerts for regressions (e.g., sudden spike in missing `segment`). Success is defined by (1) ability to explain unexpected recommendation output via logs/tooltips, and (2) measurable stability over time: fallback rates within an expected baseline and actionable alerts when the `Customer_Analyzer` integration degrades.",
      "link": "https://www.onyx.app/74271"
    }
  ],
  "primary_owners": [
    "ryan_murphy"
  ],
  "secondary_owners": []
}