{
  "id": "96fec8a15e70434ba28d7641738067f7",
  "semantic_identifier": "Design--Add recommendation exposure logging (impression/click/apply) with stable IDs.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-07-12",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Add recommendation exposure logging (impression/click/apply) with stable IDs.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "We will instrument Sales_Accelerator to emit structured analytics events for recommendation **impression**, **click**, and **apply** so we can measure exposure separately from downstream outcomes. The instrumentation will fire at well-defined UI lifecycle points: an *impression* when a recommendation card is actually rendered/visible on a rep-facing surface, a *click* when the rep interacts with the recommendation (card click, “view details”, etc.), and an *apply* when the rep takes the in-product action that enacts the recommendation (e.g., creates/updates the suggested object). Each event will use a consistent event schema and naming convention to support reliable funnel analysis.\n\nEach event payload will include stable identifiers required for joining and attribution: `recommendation_id` (stable per recommended item), `model_version` (or `model_id` + `model_version`), `account_id` and/or `opportunity_id` (depending on recommendation target), `user_id` (rep), `timestamp` (client-generated with server receive time captured by the pipeline when available), and `surface` (e.g., Sales_Accelerator panel, modal, inline list). We will also include contextual fields as needed for debugging/segmentation (e.g., `session_id`, `org_id`, `position`/rank in list, `request_id` for the recommendation fetch) while keeping the required core identifiers non-null and stable across event types.\n\nEvents will be sent through the existing analytics client and persisted into the current analytics pipeline/data store with minimal changes to downstream infrastructure. To avoid double counting, impression logging will be deduped per `recommendation_id` + `surface` + `session_id` (or similar) and only emitted once per visibility window; click/apply are inherently discrete and will be logged per action. Apply events will be emitted only after the underlying action succeeds (or will include an `outcome` field with success/failure and error code if we decide to log attempts), ensuring we can separate intent from completion.\n\nWe will validate correctness in staging by adding schema validation (required fields present and correctly typed) and by creating a staging dashboard/query that confirms expected event volume and joins across the three stages (impression → click → apply) by `recommendation_id` and `user_id`. QA will include scripted flows that render recommendations across surfaces, interact with them, and apply them, verifying no missing identifiers and no unexpected duplicates. Rollout can be gated behind a feature flag and monitored via event counts and payload completeness before enabling in production.",
      "link": "https://www.onyx.app/84737"
    }
  ],
  "primary_owners": [
    "andre_robinson"
  ],
  "secondary_owners": []
}