{
  "id": "b4682ecc3cd8460b883f880268ca18de",
  "semantic_identifier": "Design--Implement segment/ICP weighting in priority scoring with configurable defaults.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-05-12",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Implement segment/ICP weighting in priority scoring with configurable defaults.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "## Overview\nWe will update the priority scoring algorithm for issues/themes to incorporate two newly persisted attributes: **customer segment** and **ICP fit**. These attributes will contribute a multiplicative (or additive, depending on the existing scoring model) adjustment to the base priority score, allowing the system to better reflect strategic focus (e.g., enterprise customers, strong ICP-fit requests). The goal is to improve ranking quality while keeping the scoring pipeline robust when these attributes are absent or inconsistent.\n\n## Approach\nIntroduce a **config-driven weighting layer** that maps `segment` and `icp_fit` values to numeric weights. At scoring time, we compute the existing base score, then apply an adjustment derived from these weights (e.g., `final_score = base_score * segment_weight * icp_weight`). Defaults will be “neutral” (1.0 multiplier) for all values unless specified, and a single global enable/disable flag will allow turning the feature on/off. Configuration will live in our existing runtime config system (where Product/Support can edit without deploys), and we’ll include sensible initial defaults (e.g., Enterprise slightly > SMB; High ICP-fit slightly > Medium > Low) that can be tuned over time.\n\n## Data Handling, Defaults, and Conflict Resolution\nScoring must not fail or meaningfully degrade when data is missing or conflicting. If either attribute is missing, unknown, or invalid, we treat it as **neutral** (weight = 1.0). If multiple segments/ICP values are present (e.g., conflicting sources), we will use a deterministic rule (e.g., “most recently set” or “highest confidence source” per current data model); if resolution cannot be determined, fall back to neutral. We will also clamp weights to a safe range (e.g., 0.5–2.0) to prevent extreme configuration from destabilizing rankings.\n\n## Rollout, Observability, and Testing\nWe will ship behind a feature flag and log the scoring breakdown (base score, chosen segment/icp values, applied weights, final score) to support tuning and debugging. Unit tests will cover: known mappings, unknown/missing values, conflicting values, and weight clamping; integration tests will validate that scores are produced for all records and that the ordering changes only as expected when weights are enabled. After rollout, we’ll compare rank deltas and monitor for anomalies (e.g., sudden score distribution shifts), then iterate on default weights based on Product/Support feedback.",
      "link": "https://www.onyx.app/78185"
    }
  ],
  "primary_owners": [
    "andre_robinson"
  ],
  "secondary_owners": []
}