{
  "id": "d4c30961ecac4fab8f16bc655dd46855",
  "semantic_identifier": "Design--Warning alerts v2: Generate and send Slack summary digests for managers.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-07-22",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Warning alerts v2: Generate and send Slack summary digests for managers.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds a scheduled Slack “digest” notification for Warning alerts v2, sent to each routed manager (routing handled by GOLD-92). Instead of emitting one Slack message per alert trigger, we will generate a periodic summary over a configurable digest window (e.g., hourly/daily) and deliver a single message per manager per window. The digest is intended to be quickly scannable, highlight what changed recently, and provide direct navigation back to the underlying records in Sales_Accelerator/CRM.\n\nOn the backend, a digest generation job will query Warning alerts v2 events/records updated within the digest window for the set of managers with routed recipients. Alerts will be grouped by entity (Account and/or Opportunity) and then by alert type/risk signal within each entity. To reduce noise, we will de-dupe repeated triggers within the window by collapsing multiple occurrences of the same (entity, alert type, risk signal) into one line item, tracking the most recent `lastUpdatedAt` and (optionally) a count of occurrences for context.\n\nFor Slack formatting, we will produce a Block Kit message with a header (time range + total entities/alerts), followed by sections per Account/Opportunity. Each section will include: entity name, a deep link to Sales_Accelerator/CRM, and bullet lines for each unique alert entry including alert type, risk signal, and last updated time (human-readable, timezone-aware). If content exceeds Slack limits, we will truncate with “and N more…” and/or split into multiple messages, keeping entity groupings intact.\n\nOperationally, the job should be idempotent per (manager, window) to avoid duplicate sends (store a digest send record keyed by manager + window start/end). Failures to format/send should be retried with backoff; partial failures (one manager) should not block others. This ticket excludes recipient routing and preferences; it assumes we receive a resolved list of Slack recipients per manager from GOLD-92 and focuses only on digest generation, grouping/de-dupe logic, and Slack message construction.",
      "link": "https://www.onyx.app/26810"
    }
  ],
  "primary_owners": [
    "kevin_sullivan"
  ],
  "secondary_owners": []
}