{
  "id": "a8ee69b6edb342b1895ba453ea1b770b",
  "semantic_identifier": "Design--Fix confidence bands not refreshing/aligning with selected forecast scenario.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-10-18",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Fix confidence bands not refreshing/aligning with selected forecast scenario.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "### Design: Refresh & Align Confidence Bands with Active Forecast Scenario\n\nWe will fix an inconsistency where confidence bands (e.g., P10/P50/P90) sometimes remain stale when the user switches forecast scenarios or changes the forecast horizon. The goal is that bands always reflect the *active* scenario inputs and horizon, and visually align with the currently rendered totals and segment breakdowns. This requires both correct recomputation (data layer) and guaranteed re-render (UI layer) whenever the scenario/horizon changes.\n\nOn the data side, we will make confidence band computation a pure, deterministic function of `(scenarioId, horizon, projectionInputs, segmentationConfig)` and ensure it is invoked from the same selector/derivation pipeline as totals. If bands are currently cached or memoized with incomplete dependencies, we will correct the dependency set so a scenario switch or horizon change invalidates the cache and triggers recomputation. We will also ensure requests/async computation are keyed by scenario+horizon and that in-flight results are ignored if they don’t match the latest selected key (preventing late responses from overwriting current state).\n\nOn the UI side, the chart component will render bands from the derived “active forecast state” rather than maintaining internal band state. We will remove any local caching of band series or ensure it reinitializes when `(scenarioId, horizon)` changes. The chart update path should be unified so totals, segments, and bands are driven by the same computed dataset and update atomically; if we currently update them in separate effects, we will consolidate or gate rendering on a single “ready” derived payload to avoid transient mismatches.\n\nWe will add a regression test that (1) loads scenario A, (2) verifies band values align with scenario A totals, (3) switches to scenario B, (4) changes horizon, and (5) asserts the band series corresponds to scenario B + new horizon (and that the rendered band domain matches the updated totals/segments). This test will run at the integration level (store + selectors + chart props) or E2E if that’s our standard, and will specifically catch stale memoization, incorrect request keying, and out-of-order async updates.",
      "link": "https://www.onyx.app/13088"
    }
  ],
  "primary_owners": [
    "jiwon_kang"
  ],
  "secondary_owners": []
}