{
  "id": "6cb62d8da4304c2cbbf7dbf6eddff1ea",
  "semantic_identifier": "Design--Admin UI: Add audit log viewer for customer signal/PII access events.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-12-14",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Admin UI: Add audit log viewer for customer signal/PII access events.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds an admin-only “Audit Logs” viewer to Workspace Settings for reviewing customer signal/PII access events emitted by GOLD-55 (e.g., reads, views, exports). The page will present a table of audit log entries with core fields such as timestamp, actor (user/service), action type, resource identifier/type, and any relevant context (e.g., workspace/project). The intent is to give workspace admins quick visibility into sensitive-data access while keeping the experience lightweight and consistent with existing settings navigation.\n\nThe UI will support basic filtering: time range (preset + custom), actor, action type, and resource, with server-side pagination. Filters will be reflected in the URL query params for shareable views and easy refresh, and the table will show total count and page controls. We’ll implement a backend query endpoint that accepts the same filter schema, enforces ordering (newest first), and returns a stable paginated result (cursor-based preferred) to avoid missing/duplicating rows when logs are appended.\n\nA “Download CSV” action will export exactly the filtered result set (same filters as the current view), producing a CSV with the same columns as the table and a deterministic ordering. The export will be generated server-side (to avoid leaking data via client-side overfetch), and will either stream the file directly or create a short-lived downloadable artifact; in both cases, the export request will reuse the identical filter contract used by the list endpoint to ensure parity between what’s seen and what’s downloaded.\n\nAccess control is enforced end-to-end: the settings nav item and route are visible only to workspace admins, and both the list and export endpoints validate the caller’s workspace admin role regardless of UI gating. We’ll log access to the audit log viewer/export itself (optional but recommended) for meta-auditing. Non-admins attempting to access the route receive a 403 (or redirect with an error), and exports are similarly blocked.",
      "link": "https://www.onyx.app/62910"
    }
  ],
  "primary_owners": [
    "jiwon_kang"
  ],
  "secondary_owners": []
}