{
  "id": "ed63ca4585164c39abb0dab5002b3e24",
  "semantic_identifier": "Design--Audit and document segment definition sources across CRM and Customer_Analyzer.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-09-05",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Audit and document segment definition sources across CRM and Customer_Analyzer.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature will audit and document how segment membership is defined and computed across two systems—CRM and Customer_Analyzer—to prevent drift that leads to inconsistent reporting in Issue_Tracker. The goal is to produce a single, concise mapping of each segment name to its underlying criteria (fields, filters, joins), computation method (batch vs realtime), refresh cadence, and owning team/system, and to explicitly call out where CRM and Customer_Analyzer disagree.\n\nImplementation will start with an inventory of “segment surfaces”: (1) segment definitions stored in CRM (e.g., saved views, dynamic lists, custom fields, workflows) and (2) segment logic in Customer_Analyzer (e.g., SQL models, feature flags, code paths, scheduled jobs). For each segment, we will extract the raw definition artifacts (query text or configuration), normalize them into a common schema (segment_name, criteria, data_sources, refresh_cadence, ownership, last_updated), and compute a diff between CRM vs Customer_Analyzer definitions to identify drift vectors such as mismatched field semantics, different inclusion/exclusion filters, inconsistent time windows, or different snapshot times.\n\nThe output will be a lightweight “Segment Definition Registry” document (and optionally a versioned YAML/JSON file in-repo) containing: a mapping table of segment → criteria/source, a mismatch report describing what differs and why it matters, and a list of Issue_Tracker reporting surfaces impacted (dashboards, alerts, exports, SLA metrics, etc.) with the exact segment(s) they use. Each mismatch entry will include a concrete impact statement (e.g., “Issue_Tracker SLA dashboard uses Customer_Analyzer counts; CRM list includes churned customers due to missing ‘active_subscription’ filter, inflating denominator by ~X%”).\n\nFinally, we will recommend a “source of truth” per segment (CRM, Customer_Analyzer, or a newly centralized definition) based on ownership, data correctness, latency requirements, and downstream dependencies. Any gaps that cannot be resolved in this ticket—missing lineage, ambiguous field definitions, unowned segments, or required code/config changes—will be captured as follow-up Linear tickets with a proposed fix path (e.g., migrate Issue_Tracker to use Customer_Analyzer for Segment A, add field parity mapping, align refresh schedule, or deprecate duplicate segment names).",
      "link": "https://www.onyx.app/72061"
    }
  ],
  "primary_owners": [
    "kevin_sullivan"
  ],
  "secondary_owners": []
}