{
  "id": "dc52b4bd9c41451487dfde0448c117e8",
  "semantic_identifier": "Design--Audit forecasting/recommendation scoring to quantify over-weighting of fit tier vs deal dynamics.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-06-02",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Audit forecasting/recommendation scoring to quantify over-weighting of fit tier vs deal dynamics.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "### Overview\nWe need to audit our forecasting and recommendation (best-next-action) scoring to quantify whether the “fit tier” component is overpowering deal-dynamics signals (procurement stage, competition, internal alignment). This feature will add scoring instrumentation plus a lightweight offline analysis script that produces a report over recent accounts/opportunities, correlating score breakdowns to downstream outcomes. The primary deliverable is evidence: where and how often high-fit opportunities receive high overall scores despite materially negative deal dynamics, and what weight thresholds would prevent that.\n\n### Instrumentation / Data Model\nIn both the forecasting scorer and the recommendation scorer, we will log a structured “score contribution breakdown” per scored entity (account/opportunity) at scoring time. The log payload will include: entity identifiers, timestamp/model version, final score, fit tier value and contribution, each deal-dynamics signal value and contribution (procurement stage, competition, internal alignment), and any gating/normalization factors (e.g., missing-signal defaults). Logs will be emitted to our existing analytics/event pipeline (or a dedicated table) with a stable schema so we can compare runs across code changes and create regression baselines.\n\n### Analysis Script + Report Output\nWe will add a small script (e.g., notebook or CLI) that pulls the last N days of scored entities, joins to ground-truth outcomes (e.g., stage progression, win/loss, time-to-close, no-progress), and computes: (1) correlation/association between each contribution and outcomes, (2) distributions of contribution ratios (fit vs deal dynamics), and (3) a “pathology” cohort: high-fit + negative deal dynamics where overall score remains above a chosen cutoff. The script will output a concise report (CSV + charts) listing aggregate metrics plus concrete examples (top K entities) to support qualitative review.\n\n### Success Criteria / Follow-ups\nSuccess is a reproducible report that quantifies overweighting (if present), highlights representative cases, and produces actionable targets: proposed max contribution share for fit tier, and threshold-based guardrails (e.g., when deal dynamics are strongly negative, overall score must drop below X). We will also produce a set of regression test cases from flagged entities (frozen inputs + expected contribution ranges) to be used by subsequent tickets that adjust weights, ensuring we don’t reintroduce the imbalance across releases.",
      "link": "https://www.onyx.app/22003"
    }
  ],
  "primary_owners": [
    "brooke_spencer"
  ],
  "secondary_owners": []
}