{
  "id": "6e7a2f880b8d4360b5053e66a5327688",
  "semantic_identifier": "Design--Add compliance requirements checklist to deployment readiness workflow.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-12-25",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Add compliance requirements checklist to deployment readiness workflow.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "We will add a lightweight, configurable “Compliance Requirements Checklist” that can be attached to an issue/theme and optionally enforced as a gate for deployment readiness. The checklist will consist of a small set of requirement items (e.g., Security Review, DPA, Retention Constraints), each with a status (Not Started / In Progress / Complete / Not Applicable) and optional metadata (owner, link to evidence, notes). Configuration will live in an admin-managed template system so different orgs or product areas can define their own checklist items and which ones are “required” to consider an issue deployable.\n\nOn the data model side, we will extend the Issue object to include `complianceChecklistTemplateId`, an embedded (or referenced) list of `complianceChecklistItems` with per-item status and metadata, and a computed `complianceChecklistSummary` (e.g., requiredCompleteCount/requiredTotalCount, isBlocked, lastUpdatedAt). Deployment readiness evaluation will incorporate this summary: if any required item is not Complete (or marked N/A only when allowed by template rules), the issue is “Blocked by Compliance” and cannot be marked ready (or is flagged as not ready, depending on existing workflow semantics). We will expose these fields via the public API and internal services that power readiness status.\n\nIn the UI/workflow, issues/themes will show a “Compliance” section with the checklist, clear required markers, and a compact summary badge (e.g., “2/3 required complete; blocked”). Deployment readiness views will surface compliance as a first-class blocker alongside other readiness criteria, and the transition to “Ready for Deployment” will either be prevented with an actionable message listing incomplete required items, or allowed with a warning if the org config chooses “soft gate.” We will also support attaching a checklist at issue creation and inheriting a default template based on team/project.\n\nFor downstream engineering tools (Jira/Linear), we will propagate checklist status via the existing link/integration layer by adding a structured status field (when supported) and a human-readable summary string (always) in the synced description/comment/custom field. This ensures teams see compliance blockers early without leaving their tracker. Rollout will be phased: behind a feature flag, with one default template and soft gating first, then optional hard gating once metrics show reduced late-stage compliance escalations; audit logging will capture checklist status changes for traceability.",
      "link": "https://www.onyx.app/95096"
    }
  ],
  "primary_owners": [
    "kevin_sullivan"
  ],
  "secondary_owners": []
}