{
  "id": "5c01ef36e8534658880309e89f059871",
  "semantic_identifier": "Design--Add admin-configurable segment/ICP weighting controls (UI + permissions).docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-05-06",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Add admin-configurable segment/ICP weighting controls (UI + permissions).docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "### Overview / Goals\nWe will expose the segment/ICP weighting configuration currently owned by the scoring service via an Admin Settings UI so authorized non-engineers (Product/Support, depending on role) can tune how segment and ICP signals influence priority scoring without code changes. The primary goals are: (1) safe, quick iteration on weights, (2) clear auditability of why scores changed, and (3) strong guardrails to prevent destabilizing or accidental extreme configurations.\n\n### UI / UX\nAdd a new “Scoring Weights” section under Admin Settings that displays the current active weight set (by signal, e.g., Segment, ICP, and any sub-signals the scoring service exposes) with inline editable numeric inputs and short descriptions. The UI will enforce validation (numeric only, required, bounded min/max per field) and provide a “Reset to defaults” action plus a “Restore previous version” selector for rollback. Saving will show a diff summary (old → new) and require a short change note to improve audit quality; the UI will also show the active version ID and last updated metadata (who/when).\n\n### Backend / API / Permissions\nIntroduce endpoints to (a) fetch the active configuration and its schema/constraints, (b) update weights, and (c) list prior versions. Updates will be persisted as immutable, versioned configurations (append-only with active pointer), including actor, timestamp, change note, and the validated payload; the scoring service will read the active version (with caching + explicit invalidation on update). Access will be enforced via RBAC in the API: only Admin and PM (configurable) can update; other users may view (optional) or be denied entirely depending on policy. Validation/guardrails live server-side as the source of truth: per-field min/max, optional sum constraints (if applicable), and a hard “kill switch” to reject obviously destabilizing values even if the UI is bypassed.\n\n### Audit Trail / Observability / Rollout\nEvery scoring run will record the weight configuration version ID in the score audit trail so downstream priority shifts can be traced to a specific change; when a config update occurs, we’ll emit an audit event with the diff, actor, and note. We’ll add metrics/logging for config fetch failures and scoring fallbacks (e.g., default weights if no active config is available) and alert if invalid configs are attempted. Rollout plan: ship read-only UI first (behind a feature flag), then enable editing for Admin/PM, and finally enable restore/rollback and reset-to-default once versioning and audit trail integration are verified in staging.",
      "link": "https://www.onyx.app/51859"
    }
  ],
  "primary_owners": [
    "kevin_sullivan"
  ],
  "secondary_owners": []
}