{
  "id": "4d01e16315654742abe95c5c2cabdc74",
  "semantic_identifier": "Design--Add default sales stage templates and guided stage mapping during setup.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-03-31",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Add default sales stage templates and guided stage mapping during setup.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "### Overview\nDuring initial setup, we will add a “Sales Stage Templates & Mapping” step that detects the customer’s CRM pipeline configuration and proposes a default canonical stage model for Sales_Accelerator (e.g., Prospecting → Qualification → Proposal → Negotiation → Closed Won/Lost). The step will guide the admin to map or merge each CRM stage into one canonical stage, establishing a consistent stage taxonomy required for forecasting, next-best-action, and risk alerts. This reduces time-to-value by avoiding a blank-slate stage definition and by reusing existing CRM structure.\n\n### Detection + Default Template Proposal\nOn entry, the setup flow will query the CRM for active pipelines and stages (including probability/“closed” flags where available) and pick an initial template based on common patterns: default “standard” template if we can’t infer, or a best-match template if the CRM already resembles a typical funnel. The UI will show the proposed canonical stages and the list of CRM stages per pipeline, pre-filled with suggested mappings using heuristics (name similarity, ordering, probability bands, and closed-status). Admins can adjust mappings, merge multiple CRM stages into one canonical stage, and optionally rename canonical stage labels (while preserving stable internal IDs).\n\n### Guided Mapping UX + Validation\nThe mapping screen will be a required checklist: every active CRM stage must be mapped exactly once to a canonical stage (allowing many-to-one), with clear error states for unmapped stages or duplicates where one CRM stage is mapped to multiple canonical stages. We’ll enforce milestone coverage: at least one stage mapped to “Commit/Negotiation” (or equivalent) and at least one each for “Closed Won” and “Closed Lost,” with additional warnings if early-funnel coverage is missing (e.g., no Prospecting). If multiple CRM pipelines exist, we’ll support per-pipeline mappings, with an option to “apply mapping to all pipelines” when stage sets are identical.\n\n### Storage + Downstream Integration\nWe will persist a `StageModel` (canonical stages + display labels) and `StageMappings` (crm_stage_id → canonical_stage_id, plus pipeline_id scope) in our configuration store, versioned for future edits and auditability. Downstream services (forecasting, NBA, risk alerts) will read only canonical stage IDs, ensuring consistent behavior across CRM variability. Post-setup, admins can revisit the mapping page in settings; edits will trigger a lightweight revalidation and a background reindex/recompute job for any stage-based aggregates affected.",
      "link": "https://www.onyx.app/70911"
    }
  ],
  "primary_owners": [
    "tyler_jenkins"
  ],
  "secondary_owners": []
}