{
  "id": "3ad74de1b87b4d3b858f748fa178f306",
  "semantic_identifier": "Design--Implement PII detection + redaction controls for ingested conversations and issue evidence.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-10-13",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Implement PII detection + redaction controls for ingested conversations and issue evidence.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "We will add workspace-level PII detection and redaction controls that apply to all ingested text artifacts: support conversations (raw messages + metadata fields that may contain PII), extracted evidence snippets, and issue notes. The system will detect common PII classes (emails, phone numbers, addresses, API keys/tokens, IDs as configured) and transform content according to workspace policy before it is written to our database or emitted to any downstream integrations. Policies will include per-PII-type actions (redact, allow, hash-only) plus optional allow/deny lists (e.g., known internal domains, specific token prefixes) to reduce false positives and ensure intentional retention.\n\nIngestion will be updated to run a “redaction pipeline” as the first step after payload receipt and normalization. This pipeline will produce: (1) a redacted text version used for persistence, indexing, LLM prompts, evidence extraction, and UI display; (2) a structured redaction manifest containing PII type, offset ranges, and replacement tokens; and (3) optional hashed identifiers for match/dedup use-cases when “hash-only” is enabled (e.g., store SHA-256(email) and discard the plaintext). All downstream sync/export paths (Jira/Linear updates, webhooks, CSV exports) will be sourced exclusively from the redacted representation to guarantee no plaintext PII leaves the system once the policy is active.\n\nTo preserve referential integrity, redactions will use stable placeholders (e.g., `[EMAIL:1]`, `[PHONE:2]`) within a single artifact so that evidence snippets and issue notes can still be traced back to the originating conversation and message timestamps/IDs without storing the underlying PII. The redaction manifest will be stored separately from the text and will never include plaintext; it will only include type + location + placeholder mapping and, when enabled, hashed identifiers. This allows us to (a) show what was changed, (b) support deterministic re-rendering for preview, and (c) correlate repeated values across messages via hashes without enabling recovery of the original.\n\nAdmin UI/API will expose: a workspace toggle to enable redaction, per-PII-type settings, allow/deny lists, and a “preview redaction” endpoint that runs detection on a sample input and returns the redacted text + manifest for review before saving policy changes. Policy changes will apply prospectively to new ingestions; we will optionally add a backfill job later to reprocess historical records under the new policy. Auditing will record policy edits and counts of redactions applied per ingestion to support compliance reporting and debugging false positives.",
      "link": "https://www.onyx.app/19941"
    }
  ],
  "primary_owners": [
    "jiwon_kang"
  ],
  "secondary_owners": []
}