{
  "id": "0e26cb94f47a4a8bb77a915f2725f001",
  "semantic_identifier": "Design--Warning alerts v3: Create alert scoring schema for slippage & loss risk.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-11-18",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Warning alerts v3: Create alert scoring schema for slippage & loss risk.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "### Overview\nThis feature defines and implements the core risk scoring schema used to generate predictive warning alerts for **slippage risk** and **loss risk**. The goal is to produce a consistent, normalized scoring output that downstream systems (alert generation, ranking, recommendations, UI) can consume without coupling to any specific model or interface. This scope is limited to the schema, required inputs, and a minimal baseline scoring implementation shipped behind a feature flag.\n\n### Inputs and data contract\nThe scorer will take a standardized input object composed of: (1) **CRM fields** (e.g., stage, amount, close date, next step date, renewal date, health fields as available), (2) **activity signals** (e.g., last customer touch, meeting/email frequency trends, response latency, stakeholder coverage), and (3) **Customer_Analyzer fit score** (and any related metadata needed to interpret it). We will define explicit required vs optional fields, defaults for missing data, and validation behavior (e.g., “insufficient data” paths) to ensure deterministic scoring. Assumptions about field definitions, time windows, and normalization (e.g., days since last touch capped at N) will be documented in code and in the design doc.\n\n### Scoring schema and output normalization\nThe scoring schema will output a normalized structure: `{ risk_type, score, confidence }`, where `risk_type ∈ {SLIPPAGE, LOSS}`, `score` is a bounded numeric value (e.g., 0–100) representing severity, and `confidence` represents data completeness / signal strength (also bounded, e.g., 0–1 or 0–100). The initial implementation will be a simple, transparent heuristic model (e.g., weighted rules over activity recency, stage/close date volatility, fit score thresholds) designed for correctness and stability rather than optimal predictive power. The schema will be versioned (v3) to support future iterations without breaking consumers.\n\n### Implementation, gating, and testing\nWe will implement the scorer as a small library/module callable from the alert pipeline and protected by a **feature flag** (on/off plus optional allowlist). Unit tests will cover: deterministic outputs given known inputs, handling of missing/partial data, boundary conditions (min/max score), and basic confidence behavior. The module will include inline documentation and a short README describing input mapping, assumptions, and examples of expected output. Explicitly out of scope: driver ranking, recommendations, and UI rendering; the scorer only provides the normalized risk outputs.",
      "link": "https://www.onyx.app/44571"
    }
  ],
  "primary_owners": [
    "andre_robinson"
  ],
  "secondary_owners": []
}