{
  "id": "c5c56feb5a0f40cf87b8188554072234",
  "semantic_identifier": "Design--Fix sales initiation prioritization to correctly consume Customer_Analyzer fit scores.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-04-19",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Fix sales initiation prioritization to correctly consume Customer_Analyzer fit scores.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "### Overview\nSales initiation recommendations are currently mis-ordered because the MVP rule-based prioritization does not reliably consume the latest `Customer_Analyzer` fit score per account. This causes accounts with higher fit to appear below lower-fit accounts, reducing the usefulness of the recommendations list. We will update the ranking pipeline to consistently fetch the most recent fit score for each candidate account, apply it deterministically in the sort order, and gracefully degrade when a score is unavailable.\n\n### Proposed change\nIn the sales initiation prioritization step, enrich each candidate account with a `fit_score` sourced from `Customer_Analyzer`. The fetch should return the latest score per account (e.g., by `updated_at`/version, depending on the data model) and be executed in batch to avoid N+1 queries. Sorting will incorporate `fit_score` as the primary (or explicitly placed) key in the existing rule-based ordering, with a stable tie-breaker (e.g., previous rank key, then account id) to ensure consistent results across runs.\n\n### Fallback and edge cases\nIf an account has no fit score, we will treat it as “unknown” and rank it below scored accounts while preserving the existing rule-based order among unscored entries. If the score service/data source is temporarily unavailable, the system should fail open by using the current MVP ordering (no fit influence) rather than returning an error or producing partial/random ordering; we’ll log and metric this path for visibility. We will also normalize score values (e.g., clamp/validate range) to prevent malformed data from distorting rankings.\n\n### Testing and rollout\nAdd a minimal regression test that builds a small candidate set with (a) two accounts with scores and (b) one account without a score, asserting that scored accounts are ordered by descending fit and the missing-score account is placed after them with stable ordering preserved. Include a second assertion for tie behavior (same score) to guarantee deterministic output. Roll out behind a small feature flag or staged deployment, and validate with a before/after ranking diff on a sample cohort to confirm the ordering now matches expected fit-driven prioritization.",
      "link": "https://www.onyx.app/69417"
    }
  ],
  "primary_owners": [
    "ryan_murphy"
  ],
  "secondary_owners": []
}