{
  "id": "994b570b05624cb28b31d899140d2555",
  "semantic_identifier": "Design--Add domain-vocabulary signals to clustering to reduce false merges.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-05-22",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Add domain-vocabulary signals to clustering to reduce false merges.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "### Overview / Problem\nOur current clustering sometimes produces false merges when two items share generic language (e.g., “can’t login”, “error”, “issue”) but differ on domain-specific intent (e.g., product SKU, internal codes, plan names). This shows up unevenly by domain/integration because the embedding/similarity pipeline effectively underweights specialized vocabulary and overweights common support phrasing, causing clusters to merge prematurely and reducing precision.\n\n### Proposed Approach\nAdd domain-vocabulary signals as explicit text features that participate in merge scoring alongside the existing semantic similarity. Concretely: (1) domain keyword lists (per integration/source) that act as “must-match or strong-boost” tokens; (2) structured identifier detection (SKU/ID/order numbers, ticket references, error codes, hex strings, etc.) extracted via regex + simple heuristics, treated as high-precision anchors; and (3) stopword overrides to downweight/ignore generic support terms that are currently driving merges. For each candidate merge, compute a domain-signal agreement score (overlap of domain keywords, exact/near-exact match of identifiers, and penalty if identifiers conflict) and combine it with the existing similarity using a weighted function and/or a merge gate (e.g., require at least one domain signal match when domain mode is enabled).\n\n### Configuration / Rollout\nIntroduce per-source configuration (e.g., Zendesk vs Intercom) to enable domain signals and tune weights/gates without changing global behavior. Config includes: enabled flag, keyword dictionary (with optional categories), stopword override list, identifier regex packs, and thresholds/weights for boosting vs gating. Default behavior remains unchanged unless explicitly enabled for a source; we will start with a conservative “boost + conflict-penalty” mode, then optionally move specific sources to stricter gating once metrics support it.\n\n### Validation / Success Metrics\nEvaluate on a labeled sample of historical clusters per integration: primary metric is reduced false merge rate (precision ↑) with minimal recall loss (splits not exploding). Add offline tests that simulate merges and verify that mismatched identifiers prevent merging, while true duplicates with shared identifiers/keywords still merge. In production, monitor cluster size distribution, merge rate deltas, and regression dashboards per source; include a kill switch to disable domain signals quickly for any integration showing degraded clustering quality.",
      "link": "https://www.onyx.app/75071"
    }
  ],
  "primary_owners": [
    "brooke_spencer"
  ],
  "secondary_owners": []
}