{
  "id": "82bb0bb018ba4539ac47b47ef8ef141a",
  "semantic_identifier": "Design--Display data sufficiency warnings and confidence cues in Fit Score UI.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-05-23",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Display data sufficiency warnings and confidence cues in Fit Score UI.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "### Design: Data sufficiency warnings + confidence cues in Fit Score UI\n\nWe will update the Fit Score UI to consume the backend “data sufficiency diagnostics” already returned with fit score results (sample size, recency, signal coverage) and translate them into a consistent confidence cue across the product. The UI will compute a `dataSufficiencyState` (`OK` vs `LIMITED`) based on backend-provided thresholds/flags (preferred) or, if only raw metrics are provided, by applying the agreed threshold rules client-side. When in `LIMITED`, the Fit Score presentation will remain visible but will be visually de-emphasized and paired with an explicit “Limited data” warning so users understand the score may be less reliable rather than “missing.”\n\nIn all Fit Score surfaces (segment list rows, segment detail header/card, and any export/screenshotable views), we will render a compact diagnostics summary adjacent to the score: `n=<count>`, `coverage=<%>`, `last updated=<date>`. When `OK`, the summary appears as a subtle secondary line; when `LIMITED`, we add a warning icon + label “Limited data” and style the score as low-confidence (e.g., muted color) while keeping the numeric value. Hover/click opens a tooltip (desktop) or modal (mobile) that explains what each diagnostic means, why the score may be unreliable, and actionable guidance (e.g., “Increase sample size by widening the segment or extending date range”). The tooltip/modal content is shared across surfaces to ensure consistent wording and to make exports/screenshots capture the warning label and summary even if interactive help isn’t included.\n\nImplementation will centralize rendering in a reusable `FitScoreWithConfidence` component that accepts `fitScore` plus `diagnostics` and is used by the segment list cell, segment detail view, and any export template components. We will add analytics events for tooltip/modal opens and for impressions of the `LIMITED` state to measure prevalence and user engagement. For exports/screenshots, we will ensure the non-interactive elements (“Limited data” + compact summary) are always rendered; the tooltip/modal will be excluded from export unless we explicitly support an “include explanation” option later.\n\nWe will validate behavior with unit tests for state calculation and formatting (count/percent/date), and integration/UI tests to ensure the warning appears consistently across all surfaces. Edge cases include missing diagnostics (fallback to hiding summary and showing no warning), partial diagnostics (render what’s available), and stale timestamps (formatting and timezone). The rollout can be guarded by a feature flag to verify backend payload coverage and UX before enabling broadly.",
      "link": "https://www.onyx.app/13271"
    }
  ],
  "primary_owners": [
    "jiwon_kang"
  ],
  "secondary_owners": []
}