{
  "id": "2d00a3e9e4d24ed48f8f11614ec67cd0",
  "semantic_identifier": "Design--Introduce “Simple Mode” defaults to reduce configuration complexity on first run.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-10-22",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Introduce “Simple Mode” defaults to reduce configuration complexity on first run.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "### Simple Mode Defaults (Backend/State) — Feature Design\n\nWe will introduce a “Simple Mode” onboarding path that applies a minimal, recommended default configuration on first run to reduce setup complexity for small teams. Simple Mode will preselect a curated set of alerts, templates, and models and auto-enable only the core **Sales_Accelerator** workflows: **forecasting**, **next-best-action**, and **risk alerts**. Users can later switch to “Advanced” mode to unlock the full configuration surface, but this ticket focuses on backend defaults and state management (UI/progressive disclosure is out of scope).\n\nOn first run, the system will determine an onboarding “mode” and apply a corresponding **default config bundle**. For Simple Mode, the bundle will (1) enable the three core workflows, (2) bind workflow inputs to **Customer_Analyzer** fit/positioning outputs as the primary signals, and (3) select a small set of recommended alert types and message templates with safe thresholds that do not require manual tuning. The bundle will be versioned (e.g., `simple_v1`) to allow iteration over time, and persisted as an applied “baseline” so we can distinguish user customizations from defaults.\n\nState management will include a durable `onboardingMode` (Simple/Advanced), an `appliedDefaultBundleVersion`, and per-feature enablement flags stored in the customer/org configuration store. The first-run initializer will be idempotent: if any of these fields are already set (or if the org has existing config/customizations), it will not overwrite them. Switching to Advanced later will update only the mode flag and unlock additional capabilities without disabling the already-enabled core workflows; reverting to Simple (if supported) should avoid destructive changes and at most reapply missing Simple defaults, never removing user-enabled advanced features.\n\nImplementation will add a backend “default config applier” that assembles the Simple bundle, writes config + flags in a single transaction, and records an audit event for traceability. We will expose a minimal internal API for reading/writing the onboarding mode and for retrieving the resolved defaults (for future UI tickets). Key success criteria: new orgs start with working core workflows using Customer_Analyzer inputs, require zero manual tuning to generate initial outputs/alerts, and no existing org configuration is clobbered by the initializer.",
      "link": "https://www.onyx.app/41479"
    }
  ],
  "primary_owners": [
    "andre_robinson"
  ],
  "secondary_owners": []
}