{
  "id": "58b7dd29e8e54081bac943946e435479",
  "semantic_identifier": "Design--Prevent overlapping scheduled sync runs per integration connection (CRM/Support/Product Analytics).docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-07-18",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Prevent overlapping scheduled sync runs per integration connection (CRM/Support/Product Analytics).docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "We will prevent overlapping scheduled sync runs for the same integration connection (CRM/Support/Product Analytics) by introducing a per-connection distributed lock implemented as a time-bounded lease (TTL). Each scheduled sync attempt will first attempt to acquire a lease keyed by `(integration_type, connection_id)`; only the holder may execute the sync. The lease will include metadata (run_id, worker_id, acquired_at, expires_at) to support debugging and to make lock ownership explicit.\n\nAt scheduling/dispatch time, if the lease acquisition fails because an active lease already exists, the scheduler will not enqueue/launch the sync and will instead record a “deferred_due_to_active_run” outcome with the current lease holder’s run_id and remaining TTL. This ensures we avoid concurrent paging/ingestion for the same connection, reducing skipped pages, partial ingestion, and rate-limit cascades. We will treat this as a normal, expected state (not an error) but make it visible via existing observability: structured logs, metrics counters, and a trace/span annotation for “lock_not_acquired”.\n\nDuring execution, the sync worker will periodically renew the lease (heartbeat) to prevent expiration mid-run for long syncs; if renewal fails (e.g., lock stolen/expired), the run will halt safely to avoid two active runners. On completion, the worker will release the lease only if it still owns it (compare-and-delete), and on failure it will also attempt safe release; the TTL guarantees eventual recovery if the worker crashes or cannot release. We will set TTL/renewal intervals based on observed sync durations (e.g., TTL 2–3× p95 run time, renewal every ~TTL/3) and validate with integration-specific characteristics.\n\nRollout will be incremental: add the lock/lease check to all scheduled sync entrypoints for CRM/Support/Product Analytics connections, initially with metrics-only “dry run” to measure overlap frequency, then enforce. Success criteria are: zero concurrent runs per connection, reduced partial/duplicated ingestion incidents, and reduced rate-limit cascades. We will add dashboards/alerts for high deferral rates (potentially indicating stuck runs or undersized TTL) and for lease renewal failures, enabling quick diagnosis using the recorded deferral reasons and lock metadata.",
      "link": "https://www.onyx.app/25271"
    }
  ],
  "primary_owners": [
    "kevin_sullivan"
  ],
  "secondary_owners": []
}