{
  "id": "8ecfd911bd4741f797c34bb55289646d",
  "semantic_identifier": "Design--Harden Jira/Linear two-way sync: retries, backoff, and dead-letter handling for failed sync runs.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-04-09",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Harden Jira/Linear two-way sync: retries, backoff, and dead-letter handling for failed sync runs.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "### Overview\nWe will harden the Jira ↔ Linear two-way sync by introducing resilient failure handling around inbound/upstream sync runs. The goal is to prevent transient errors (rate limits, intermittent network/API failures) from causing repeated noisy failures, while ensuring permanent errors (permission revoked, issue deleted) are surfaced clearly and stop burning cycles. The system should preserve existing link mappings even when sync cannot progress, and it should automatically recover and clear error state once conditions improve.\n\n### Retry + backoff + idempotency\nFor each link sync job, we will add automatic retries with exponential backoff and jitter, keyed by a stable idempotency identifier (e.g., link_id + direction + upstream revision marker) to avoid duplicate side effects when a retry occurs after a partial write. We will cap attempts and apply per-provider retry rules (e.g., retry on 429/5xx/timeouts; do not retry on 401/403/404 where appropriate). Sync execution will remain “at least once,” but outcomes will be made effectively once-per-revision through idempotent upserts and conflict-safe writes.\n\n### Dead-letter state and persisted error details\nIf a job exceeds retry limits or encounters a non-retriable error, we will transition the link to a “dead-letter” (DLQ) state for that sync direction. We will persist per-link fields: `last_sync_error_code`, `last_sync_error_message` (sanitized), `last_sync_error_at`, and `failure_count`, plus `next_retry_at` while in backoff. The worker will stop attempting sync for that direction while in dead-letter, preventing repeated failing calls, but will keep the link mapping intact. The status panel will read these persisted fields to show actionable errors (e.g., “Re-authorize Jira”, “Issue not found”, “Rate limited—retrying at …”) without triggering new API calls.\n\n### Recovery, clearing state, and operational hooks\nAny successful subsequent sync run will reset `failure_count`, clear the persisted error fields, and remove dead-letter status for that direction. We will add metrics and logs for retry counts, dead-letter transitions, and recoveries, plus an admin/manual “retry now” action that clears dead-letter state and enqueues a run (guarded by idempotency). This design ensures the sync remains robust under transient failures, provides clear UI visibility for persistent failures, and avoids breaking or losing the established Jira/Linear link relationship.",
      "link": "https://www.onyx.app/53540"
    }
  ],
  "primary_owners": [
    "tyler_jenkins"
  ],
  "secondary_owners": []
}