{
  "id": "b7884b58f2764fa8b4b3e731df896a25",
  "semantic_identifier": "Design--Detect and flag manually pasted positioning blocks that are stale vs Customer_Analyzer.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-04-11",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Detect and flag manually pasted positioning blocks that are stale vs Customer_Analyzer.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "We’ll add a validation step to the positioning-block editor pipeline that runs whenever a user pastes or manually edits a positioning block. On paste/edit commit, the client will call a lightweight “compare” endpoint with the current account/opportunity identifiers and the pasted block content (or a hash plus extracted metadata, if available). The service will fetch the latest canonical positioning block generated by Customer_Analyzer for the same account/opportunity and compute a mismatch result (exact match, semantically same, or stale/different) based on normalized text comparison and, when present, embedded version/timestamp markers from Customer_Analyzer.\n\nIf the pasted block is detected as stale, we’ll surface a non-blocking inline warning in the editor (e.g., “This block doesn’t match the latest from Customer_Analyzer”) that does not prevent saving. The warning will include a single primary action: “Replace with latest from Customer_Analyzer,” which swaps the editor content with the canonical block and preserves undo/redo. If we can’t fetch the latest (missing IDs, analyzer unavailable), we’ll skip the warning and allow the edit to proceed normally.\n\nOn the backend, the compare endpoint will return: latest analyzer version/timestamp (if available), the detected status, and the canonical block payload for the replace action. We’ll avoid excessive analyzer reads by caching latest blocks per account/opportunity for a short TTL and by debouncing compare calls on rapid edits (only run on paste and on edit “blur”/save). This keeps latency low and prevents noisy warnings while users are actively typing.\n\nWe’ll add structured analytics for follow-on fixes and measurement. For each compare result that is “stale/different,” we’ll log an event containing account_id, opportunity_id, analyzer_version/timestamp, detected_status, and user_action (ignored/kept, replaced, or not_shown due to error). We’ll also log fetch/compare failures with reason codes to understand coverage gaps and reliability issues.",
      "link": "https://www.onyx.app/77152"
    }
  ],
  "primary_owners": [
    "andre_robinson"
  ],
  "secondary_owners": []
}