{
  "id": "249b5446b8e4488596962eb96533410e",
  "semantic_identifier": "Design--Normalize CRM stage/field mappings into a canonical lifecycle model.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-07-25",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Design--Normalize CRM stage/field mappings into a canonical lifecycle model.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "We will introduce a canonical **Sales_Accelerator lifecycle model** that defines the supported opportunity stages (an ordered stage set with stable IDs) and a corresponding set of required fields per stage (e.g., close date required at “Commit”). This canonical schema will be versioned and treated as the single contract for downstream consumers (analytics, reporting, ML), so they never read raw CRM-specific stage names or field labels. The schema will live in a central config/service module and be exposed via an internal API for validation and UI consumption.\n\nOn ingestion (or at analytics read time, depending on current architecture), we will add a **normalization layer** that translates each connected CRM instance’s custom stage names and field identifiers into the canonical lifecycle. Mappings will be stored **per CRM instance** (and optionally per pipeline/record type if the CRM supports multiple) and will support explicit overrides: default mappings can be inferred from common stage/field patterns, but instance-specific overrides always win. Normalization will output only canonical stage IDs and canonical field keys, while retaining raw values for debugging/audit.\n\nWe will persist mappings in a dedicated data model, e.g., `crm_lifecycle_mappings(instance_id, schema_version, stage_map, field_map, updated_at, updated_by)` plus optional metadata for confidence/source (inferred vs user-defined). A lightweight admin UI (or API-first tooling if UI is out of scope) will allow operators to view/edit mappings, apply overrides, and run a “preview” against recent opportunities to verify coverage. All normalized records will include the schema version used so analytics can be replayed safely if the canonical model evolves.\n\nFinally, we will add **validation and enforcement**: a validation job will detect unmapped stages/fields and missing required-field mappings for each instance, emitting actionable diagnostics (which stage/field, sample records, suggested canonical candidates). Analytics jobs will check mapping completeness for the target instance + schema version and **hard-block** execution when the lifecycle is partially mapped, preventing mixed canonical/raw values from entering downstream tables. We will also log/alert on newly observed unmapped values so mappings stay current as CRM admins change stages or rename fields.",
      "link": "https://www.onyx.app/71704"
    }
  ],
  "primary_owners": [
    "kevin_sullivan"
  ],
  "secondary_owners": []
}