{
  "id": "96fec8a15e70434ba28d7641738067f7",
  "semantic_identifier": "Impact--Add recommendation exposure logging (impression/click/apply) with stable IDs.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-07-12",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Add recommendation exposure logging (impression/click/apply) with stable IDs.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds end-to-end exposure logging for Sales_Accelerator recommendations, emitting structured analytics events whenever a recommendation is displayed (impression), interacted with (click), or actioned (apply) by a rep. By standardizing these events and sending them through the existing analytics pipeline, we create a reliable audit trail of recommendation touchpoints across the product.\n\nIncluding stable identifiers—`recommendation_id`, `model_version`, `account_id/opportunity_id`, `user_id`, `timestamp`, and `surface`—enables accurate attribution and joining across systems. This removes ambiguity when recommendations refresh, ranking changes, or models are iterated, allowing downstream analysis to separate “what was seen” from “what drove outcomes” and compare performance across versions and placements.\n\nThe primary impact is improved measurement: we can compute impression-to-click and click-to-apply rates, quantify adoption by rep/team, and evaluate model quality and UI placement effectiveness without relying on proxy signals. This instrumentation also supports faster experimentation and safer rollouts by making regression detection and model monitoring possible with consistent, complete event payloads.\n\nOperationally, events will be persisted to the current analytics data store and validated for payload completeness in staging before production rollout. This reduces data quality issues early and ensures analysts and data science can immediately use the new signals for dashboards, experimentation analysis, and recommendation ROI reporting.",
      "link": "https://www.onyx.app/69858"
    }
  ],
  "primary_owners": [
    "michael_anderson@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}