{
  "id": "fc5c0277ef444d338e74b495a1a75de6",
  "semantic_identifier": "Impact--Add scoring configuration schema + persistence for issue_prioritization MVP.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-04-06",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Add scoring configuration schema + persistence for issue_prioritization MVP.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature introduces a versioned “scoring configuration” schema for the issue_prioritization MVP, giving each workspace a clear source of truth for how prioritization scores are computed. The configuration will support tunable weights across the core drivers—frequency, severity, and ARR tier—so teams can align prioritization with their business model and customer commitments, rather than relying on a fixed global formula.\n\nBy persisting this configuration in a dedicated datastore model (table/collection) and adding CRUD endpoints/service methods, we enable reliable retrieval of the active configuration per workspace with sensible defaults out of the box. Versioning provides a safe path to evolve the scoring logic over time (and potentially audit changes), without breaking existing score interpretations or requiring manual migrations for every tweak.\n\nThe optional normalization settings add flexibility to keep scores comparable as inputs scale or as workspaces differ in volume and customer mix. This reduces the risk of “runaway” scoring dominated by a single factor and supports more stable ranking behavior across time and segments.\n\nOverall impact: this work unblocks downstream capabilities—most importantly, computing and displaying explainable score breakdowns—because it establishes a consistent, configurable foundation for score calculation. It also reduces engineering and support overhead by centralizing configuration, enabling controlled iteration, and making prioritization behavior predictable across environments and workspaces.",
      "link": "https://www.onyx.app/67007"
    }
  ],
  "primary_owners": [
    "kenji_watanabe@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}