{
  "id": "5bd11ebacaa7405fbb0baa9667bbb3f6",
  "semantic_identifier": "Impact--Canonicalize segment membership for impact reporting using chosen source of truth.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-08-13",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Canonicalize segment membership for impact reporting using chosen source of truth.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds a segment canonicalization layer to Issue_Tracker’s impact-reporting pipeline so segment membership is computed from a single, explicitly chosen “source of truth” (per GOLD-179) before we aggregate impacted customers and revenue. Today, segment identifiers and names can be inconsistent across systems (e.g., CRM vs Customer_Analyzer), which can lead to mixing definitions and producing impact numbers that are hard to trust or reconcile.\n\nWith canonicalization, we will normalize segment IDs/names into a standard representation and then derive segment membership exclusively from the selected system. This ensures that any rollups by segment (customer counts, ARR/revenue impact, etc.) are based on one coherent segmentation model, improving accuracy and consistency across reports, dashboards, and post-incident reviews.\n\nWe will also introduce an explicit fallback path for segments that cannot be mapped cleanly. Instead of silently combining partial or conflicting definitions, these segments will be flagged as “unknown/mismatched,” making gaps visible and actionable. This reduces the risk of understated or overstated impact and creates a clear workflow for resolving missing mappings.\n\nOverall impact: higher confidence in impact reporting, easier cross-team alignment when comparing results to CRM/finance views, and faster incident triage because segment-based summaries become reliable. The main tradeoff is that some reports may show a temporary increase in “unknown/mismatched” segments until mappings are completed, but this is a desirable shift from hidden inconsistency to explicit correctness.",
      "link": "https://www.onyx.app/51877"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}