{
  "id": "2f97596c0234438ab72e8c6ad02733c5",
  "semantic_identifier": "Impact--Define and persist bypass-tracking events in backend analytics pipeline.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-10-31",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Define and persist bypass-tracking events in backend analytics pipeline.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds first-class backend analytics support for Sales_Accelerator “bypass” behavior by defining a dedicated event schema and ingestion endpoint. Each bypass will be recorded with consistent fields (user/team, account/opportunity, workflow type, timestamp, surface, and optional reason) so we have a complete, standardized view of when and where users choose to skip the intended flow.\n\nPersisting these events in the analytics warehouse with stable identifiers enables durable reporting that doesn’t break as product surfaces evolve. With reliable workflow and team segmentation, we can compare bypass rates across workflows, teams, accounts, and time windows, and tie bypass behavior to downstream outcomes (e.g., conversion, cycle time, opportunity progression).\n\nMaking ingestion idempotent (deduping by event_id/session) materially improves data quality by preventing inflated counts from retries, network issues, or client-side replays. This ensures metrics are trustworthy for executive reporting and experimentation analysis, and reduces ongoing analyst cleanup or manual adjustments.\n\nBecause this work is backend-only and does not require UI changes, it can ship safely and immediately start powering downstream dashboards and alerting. Once available, it unlocks proactive monitoring (spikes by team/workflow/surface), faster root-cause analysis for adoption issues, and a data foundation for future product decisions such as refining workflows, improving guidance, or introducing guardrails where bypass is correlated with poorer outcomes.",
      "link": "https://www.onyx.app/34838"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}