{
  "id": "65d9767e0ec2480ebbe2fbc874aed6c1",
  "semantic_identifier": "Impact--Define outcome events + schema for closed-loop learning telemetry.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-12-06",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Define outcome events + schema for closed-loop learning telemetry.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature defines a canonical, versioned set of “outcome” telemetry events so we can measure whether recommendations actually drive results. By standardizing events like recommendation shown, accepted/applied, sequence executed, reply/meeting booked, stage change, and closed won/lost, we create a consistent signal layer that product, data, and ML can rely on for closed-loop learning and trustworthy reporting.\n\nThe schema will require enough context to make events actionable and comparable across segments and motions: segment, rep identity, sales motion, account/opportunity identifiers, CRM IDs, timestamps, and other core dimensions needed for analysis. Versioning ensures we can evolve the schema without breaking downstream pipelines or mixing incompatible definitions over time.\n\nA key impact is attribution: every outcome event must be joinable back to the specific recommendation instance that preceded it. This enables end-to-end measurement (exposure → adoption → downstream business outcome), supports ROI reporting by recommendation type and cohort, and provides high-quality labels for model training and ranking improvements.\n\nFinally, documenting the schema and adding lightweight validation reduces data quality risk at the source. Preventing missing or invalid fields avoids silent measurement gaps, lowers time spent debugging analytics discrepancies, and increases confidence that decisions based on this telemetry (product iteration, experimentation, and model updates) reflect real customer impact.",
      "link": "https://www.onyx.app/37173"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}