{
  "id": "99130231c4ad4b1cbf6784f027178a80",
  "semantic_identifier": "Impact--Persist drift events with model/version + segment context for recalibration workflows.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-10-26",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Persist drift events with model/version + segment context for recalibration workflows.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds a durable `DriftEvent` record whenever GOLD-125 flags drift, turning what is currently a transient signal into an auditable artifact that can drive recalibration workflows. Each event will persist the core context needed to understand and act on drift: model name and version, the detection time window, the triggering metrics and thresholds, and the impacted segments (e.g., ICP tier, industry, region). This creates a consistent “unit of work” for triage and follow-up instead of relying on logs, dashboards, or ad-hoc investigation.\n\nThe primary impact is faster, more reliable debugging and prioritization of model issues. By capturing segment context alongside the model/version, teams can quickly determine whether drift is isolated (e.g., only SMB in EMEA) or systemic, and prioritize recalibration based on business impact. This also reduces misalignment between teams by ensuring Sales Ops, Engineering, and ML are looking at the same canonical record of what happened and where.\n\nIncluding a lightweight data snapshot pointer (query parameters or dataset ID) materially improves reproducibility. Downstream evaluation and retraining jobs can re-run analyses on the exact slice that triggered the alert without re-deriving cohorts, time windows, or filters—reducing time-to-fix and lowering the risk of “can’t reproduce” drift investigations. It also enables automated pipelines to pick up drift events and kick off standardized evaluation/retraining steps.\n\nExposing `DriftEvent` via an internal API unlocks operational workflows: triage queues, escalation rules, and reporting on drift frequency by model/version/segment. Over time, this enables better measurement of recalibration throughput and effectiveness (e.g., time from drift detection to mitigation), supports capacity planning, and provides a foundation for more automated remediation and governance.",
      "link": "https://www.onyx.app/20102"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}