{
  "id": "9cedfcc36a1d4b61ba1988005f1bc9fc",
  "semantic_identifier": "Impact--Integrations_connectors v2: Fix Jira/Linear bi-directional status sync to prevent stale/looping updates.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-06-11",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Integrations_connectors v2: Fix Jira/Linear bi-directional status sync to prevent stale/looping updates.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature fixes a reliability issue in our Jira/Linear bi-directional status sync where updates can become stale, fail to propagate, or “bounce” back and forth due to unclear source-of-truth and non-idempotent handling. The result today is user-visible inconsistency: an issue can show different statuses across systems, or a user’s change appears to revert, creating confusion and extra manual reconciliation.\n\nWe will introduce per-issue sync metadata—`last_synced_state`, `last_synced_at`, and `origin`—to make status synchronization deterministic. With this metadata, the connector can recognize self-generated updates and ignore them (preventing loops), while still accepting legitimate remote changes from Jira or Linear. This establishes a clear decision framework for what to apply, what to skip, and when to treat an update as outdated.\n\nIn addition, we’ll ensure status transitions map correctly across Jira, Linear, and Issue_Tracker so that equivalent states and allowed transitions are respected end-to-end. This reduces cases where a “successful” update in one system fails or is coerced into an unintended status in another due to mapping gaps or invalid transitions.\n\nFinally, we’ll add targeted logs and metrics to surface dropped updates, conflicts, and repeated write attempts. This improves debuggability for Support and Engineering, enables faster detection of sync regressions, and provides the visibility needed to measure sync health (e.g., conflict rate, loop prevention triggers, and time-to-consistency across systems).",
      "link": "https://www.onyx.app/28075"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}