{
  "id": "9f5f07eb40ce4448819f071d2dfc6ae5",
  "semantic_identifier": "Impact--Define scheduled CRM sync refresh scope and configuration (Salesforce/HubSpot).docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-08-22",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Define scheduled CRM sync refresh scope and configuration (Salesforce/HubSpot).docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature defines the “scheduled CRM sync contract” for our native Salesforce and HubSpot integrations so we have a clear, implementation-ready specification for how automatic refreshes behave. It formalizes what “scheduled sync” means across workspaces: how often we sync, what we sync, and which parts of the system are source-of-truth versus downstream consumers. By documenting this contract up front, we reduce ambiguity for engineering and create a stable foundation for subsequent work (deduplication, write-back, and data quality).\n\nThe primary user impact is increased reliability and predictability of CRM data freshness in the product. Customers will know which CRM objects and fields are included in scheduled refresh (e.g., opportunity “next step,” “close plan status,” and other agreed fields), and what cadence to expect. This also improves internal supportability: when data appears stale or missing, we can reference a definitive scope and frequency instead of treating behavior as implementation detail.\n\nThe feature also introduces clear read vs. write-back boundaries to prevent unintended data changes in Salesforce/HubSpot. By explicitly defining what we only read, what we may write back (if/when enabled), and under what conditions, we reduce risk of customer trust issues and integration misconfiguration. This contract is the prerequisite for safe dedupe and future write-back logic because those systems depend on consistent identifiers, field ownership rules, and timing guarantees.\n\nOperationally, we’ll add configuration defaults and environment-level toggles to enable/disable scheduled sync per workspace. This allows controlled rollout, workspace-specific opt-in/opt-out, and quick mitigation if a sync job causes load or unexpected behavior. The result is a scalable, governable integration surface area that can evolve without breaking customer expectations.",
      "link": "https://www.onyx.app/78069"
    }
  ],
  "primary_owners": [
    "kenji_watanabe@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}