{
  "id": "347aea5c1c124ff7b7c7b24c35fe7bba",
  "semantic_identifier": "Impact--Adjust priority scoring to weight sales/opportunity signals by quality and cap their influence.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-06-23",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Adjust priority scoring to weight sales/opportunity signals by quality and cap their influence.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This change updates our priority scoring so Sales/Opportunity signals are treated as a strong but calibrated input, rather than a disproportionate driver of what gets built next. Today, simply being linked to an opportunity can push an issue above items with broader customer evidence; this leads to roadmap bias toward “attached deals” regardless of deal quality or recency and reduces trust in the score.\n\nWe will weight opportunity impact by quality indicators such as pipeline stage, ARR magnitude, and ICP fit, so late-stage, high-value, on-profile deals appropriately matter more than early or low-confidence asks. We will also introduce time decay so stale opportunities gradually lose influence, preventing old deal context from keeping issues artificially elevated after the sales motion has moved on.\n\nTo protect customer-led prioritization, we’ll cap the maximum contribution from Sales/Opportunity linkage so it cannot dominate the overall score. Additionally, when support/customer evidence is sparse, the sales component will be constrained so it cannot exceed the support/customer contribution, ensuring that we don’t “manufacture certainty” from a single sales signal.\n\nThe expected impact is a ranking that better reflects both revenue urgency and true customer validation, improving prioritization quality and cross-functional alignment. This should reduce churn in priority lists, increase stakeholder trust in the scoring model, and help Engineering focus on work that is both commercially meaningful and broadly evidenced.",
      "link": "https://www.onyx.app/75768"
    }
  ],
  "primary_owners": [
    "michael_anderson@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}