{
  "id": "76bce74f678f4d2a92c8d8247eae569d",
  "semantic_identifier": "Impact--issue_clustering v2: Add per-product-area clustering configuration + model selection.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-12-06",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--issue_clustering v2: Add per-product-area clustering configuration + model selection.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds a product-area–scoped configuration layer to `issue_clustering v2`, enabling each product area to tune clustering behavior independently (e.g., embedding model/version, similarity threshold, minimum cluster size). Today, a single global configuration forces tradeoffs across very different issue types and volumes; per-area controls will improve cluster quality without requiring global changes that could regress other teams.\n\nIncoming issues will be routed to the correct clustering configuration based on the issue’s linked product area. This allows us to select the best embedding model per area (or run newer versions safely in one area first), adjust sensitivity to avoid over/under-clustering, and match minimum cluster sizes to area-specific throughput.\n\nFor auditability and debugging, the system will persist a snapshot of the exact configuration used for each clustering decision. This makes clustering outcomes explainable, supports incident investigation (“why did this issue land in this cluster?”), and enables longitudinal analysis when models or thresholds change over time.\n\nThe implementation includes guardrails and safe fallbacks: when product area is missing, unknown, or misclassified, the system will default to the global configuration rather than failing or applying an incorrect area’s settings. This reduces operational risk while still allowing teams to incrementally adopt and iterate on area-specific tuning.",
      "link": "https://www.onyx.app/40422"
    }
  ],
  "primary_owners": [
    "michael_anderson@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}