{
  "id": "0c44b65032c341e28760588a507750ed",
  "semantic_identifier": "Impact--Persist Customer_Analyzer positioning block version metadata for staleness comparisons.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-05-19",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Persist Customer_Analyzer positioning block version metadata for staleness comparisons.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This change enables reliable “staleness” detection for Customer_Analyzer positioning blocks rendered in Sales_Accelerator by persisting the block’s identifier/version and a last-updated timestamp alongside the stored content for each account/opportunity. With that metadata captured at render time, we can later determine whether what a rep pasted or edited is still aligned with the latest canonical positioning guidance.\n\nWe will add lightweight retrieval plumbing (an API/service method) that returns the latest Customer_Analyzer metadata for a given record. The UI can use this to compare the currently stored block (and its saved version/timestamp) against the newest canonical version, without needing to fetch or diff full block content. This minimizes payload and keeps the check fast enough to run inline during common workflows.\n\nProduct impact is primarily foundational: it unblocks future UX flows such as “This block is out of date” messaging, one-click replacement, and tracking adoption of updated positioning guidance across pipeline records. It also reduces risk of reps using outdated messaging, improving consistency and accuracy of customer-facing content over time.\n\nScope is intentionally limited to data model changes and retrieval mechanisms; it does not include the UI experience, notification logic, or replacement flows themselves. We should expect downstream work to wire the UI comparison, define what constitutes “stale” (version vs timestamp), and handle edge cases like manually edited blocks where only parts of the content match the canonical template.",
      "link": "https://www.onyx.app/29745"
    }
  ],
  "primary_owners": [
    "kenji_watanabe@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}