{
  "id": "c8fb48a1e0c14e3ea8c30fe68c43087b",
  "semantic_identifier": "Impact--Harden scheduled sync pagination + checkpointing to prevent partial ingestion (CRM/Support/Product Analytics).docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-08-22",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Harden scheduled sync pagination + checkpointing to prevent partial ingestion (CRM/Support/Product Analytics).docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature hardens our scheduled sync reliability across CRM, Support, and Product Analytics integrations by preventing runs from stopping mid-pagination or resuming from an incorrect cursor after transient API errors/timeouts. Today, these failures can produce partial ingestion (missing records) or duplicated ingestion (the same records re-imported), which undermines data trust and downstream reporting.\n\nWe will introduce per-connection checkpoint persistence that stores the last committed pagination state (page/cursor) along with an `updated_at` watermark. Critically, the checkpoint will advance only after a page is fully processed and successfully committed, ensuring we never “move past” data that hasn’t actually landed.\n\nWhen a scheduled sync retries or resumes, it will restart from the last committed checkpoint rather than an in-memory or partially advanced cursor. This reduces the blast radius of transient upstream issues to, at worst, reprocessing the last successfully committed page—rather than creating gaps or jumping ahead.\n\nTo protect against duplicates when retries reprocess data, we will ensure idempotent upserts across all affected connectors. The expected impact is higher sync completion rates, fewer customer-facing data discrepancies, reduced support load related to missing/duplicate records, and improved confidence in analytics and operational workflows that depend on these integrations.",
      "link": "https://www.onyx.app/61462"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}