{
  "id": "1518005158b54b0186685e56adb56aee",
  "semantic_identifier": "Impact--Warning alerts v3: Implement driver extraction + ranking for slippage/loss alerts.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-10-29",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Warning alerts v3: Implement driver extraction + ranking for slippage/loss alerts.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds a “drivers” pipeline for Warning alerts v3 that explains *why* an opportunity is at risk for slippage or loss, not just *that* it is at risk. Today, v3 risk scoring can identify high-risk deals, but the alert experience is less actionable without a clear, prioritized breakdown of the contributing factors. By extracting and ranking drivers from the scoring output, we make each alert immediately interpretable and easier to act on.\n\nThe pipeline will produce a ranked list of contributing factors—such as stage duration, missing next step, activity decay, close date movement, and low fit score—each with a per-driver impact value and supporting evidence fields. This creates a consistent, structured foundation for downstream recommendations (what to do next) and a richer UI (what changed, what’s most important). The stable schema also enables analytics on which drivers most commonly lead to risk and how interventions affect outcomes.\n\nA key impact is normalization across CRMs (Salesforce and HubSpot), so customers get consistent alert reasoning regardless of their system of record. That consistency reduces support burden, simplifies UI and recommendation logic, and ensures cross-customer comparability in reporting. It also future-proofs the alert system as additional CRMs or driver types are introduced.\n\nFinally, adding unit tests for ranking determinism and null/missing-field handling materially improves reliability. Deterministic ranking prevents “alert churn” where the same deal appears to change reasons between refreshes, preserving user trust. Robust handling of incomplete CRM data ensures alerts remain stable and useful even when fields are missing or inconsistently populated.",
      "link": "https://www.onyx.app/45793"
    }
  ],
  "primary_owners": [
    "michael_anderson@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}