{
  "id": "245cb12df2a6440889e5efcf31013c5a",
  "semantic_identifier": "Impact--Add in-product bypass tracking for key Sales_Accelerator workflows.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-09-26",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Add in-product bypass tracking for key Sales_Accelerator workflows.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds in-product bypass tracking for key Sales_Accelerator workflows so we can measure when users choose not to complete actions through Sales_Accelerator. We will instrument the highest-value flows—best-next-action execution, forecasting updates, and risk alert follow-through—to detect when the intended workflow is initiated or recommended in our product but completed directly in the CRM or outside our surfaces.\n\nWhen a bypass is detected, we will emit a standardized event with consistent metadata: user and team identifiers, account/opportunity context, workflow type, timestamp, UI entry point (web vs extension and the originating screen), and a stated or inferred reason when available (e.g., “already did this in CRM,” “missing permissions,” “needed fields unavailable,” “prefer CRM habit”). This creates a reliable dataset to quantify “organizational drift” away from Sales_Accelerator and identify where and why users break our intended paths.\n\nEvents will be emitted consistently across both web and extension experiences so the bypass rate is comparable regardless of where the user works. Data will be structured to support downstream reporting (dashboards, cohort analysis, funnel/drop-off) and to enable future product interventions (nudges, deeper integrations, UX changes, or admin controls) targeted at the most common bypass drivers.\n\nThe expected impact is improved visibility into adoption friction and leakage in core revenue workflows, enabling us to prioritize the highest-ROI fixes and increase completed actions through Sales_Accelerator. Over time, this should improve workflow consistency, reduce reliance on manual CRM-only behaviors, and strengthen the product’s measurable contribution to forecasting accuracy, risk mitigation, and execution of best-next actions.",
      "link": "https://www.onyx.app/55336"
    }
  ],
  "primary_owners": [
    "michael_anderson@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}