{
  "id": "279245a043a647419c08c7a0f87f1b97",
  "semantic_identifier": "Impact--Fix Jira/Linear link-out: generate correct deep links and handle missing/mismatched IDs.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-04-01",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Fix Jira/Linear link-out: generate correct deep links and handle missing/mismatched IDs.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This change fixes a reliability issue in our Jira/Linear link-outs from Issue_Tracker, where users are sometimes taken to broken URLs or the wrong downstream item. The root cause is that issue identifiers and URL formats vary by workspace, and our stored mappings can become stale—so a link that “looks” valid can still be incorrect.\n\nWe’ll update link generation to always use the integration’s configured base URL and workspace slug (rather than assuming a default format), producing correct deep links across different Jira/Linear configurations. In addition, we’ll validate the stored external ID/key before we render the link, so we only present link-outs we’re confident will resolve to the intended issue.\n\nWhen the external ID is missing, invalid, or mismatched, we’ll replace the link with a clear “Not linked” state. From there, users will have an explicit retry/reconnect action to re-establish or refresh the mapping, instead of silently emitting a malformed URL that wastes time and erodes trust.\n\nOverall impact: fewer dead ends, fewer misdirected navigations, and higher confidence that “Open in Jira/Linear” does what it promises. This also reduces support burden by making integration health issues visible and actionable at the point of use, rather than surfacing as intermittent, hard-to-debug link failures.",
      "link": "https://www.onyx.app/49054"
    }
  ],
  "primary_owners": [
    "michael_anderson@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}