{
  "id": "b3d1c504ddd5497997245bdd0d1d4fd1",
  "semantic_identifier": "Impact--Follow-up workflow: Task queue shows incorrect ordering and missing next actions.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-06-06",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Follow-up workflow: Task queue shows incorrect ordering and missing next actions.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature fixes reliability and relevance issues in the Follow-up workflow task queue so it consistently shows the correct “next best action” for each account/opportunity. Today, incorrect ordering and missing items can cause reps to miss time-sensitive follow-ups or work lower-impact tasks first, directly reducing responsiveness and pipeline momentum.\n\nThe update will ensure the queue deterministically selects a single best next action per account/opportunity and orders the overall list by due date, incorporating existing risk/priority signals so higher-risk and higher-value work rises appropriately. This creates a clearer daily plan for reps and reduces cognitive load from scanning duplicates or stale actions.\n\nWe will also resolve scenarios where tasks fail to appear (or disappear incorrectly) after common lifecycle events like task creation, completion, reassignment, or CRM sync updates. The expected impact is increased trust in the workflow, fewer manual refresh/workarounds, and more consistent follow-through on critical opportunities.\n\nFinally, we’ll add minimal logging/telemetry around task generation and queue rendering to validate correctness in production and quickly detect regressions. This instrumentation enables targeted monitoring of missing/incorrect next actions and supports faster debugging without adding significant overhead or noise.",
      "link": "https://www.onyx.app/87765"
    }
  ],
  "primary_owners": [
    "kenji_watanabe@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}