{
  "id": "a1bca885080648c9a9a0b4f347961dfa",
  "semantic_identifier": "Impact--Forecasting: Add commit & best-case scenario buckets to forecast model and UI.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-08-17",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Forecasting: Add commit & best-case scenario buckets to forecast model and UI.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds first-class support for “Commit” and “Best-Case” forecast scenarios across the forecasting pipeline, API, and UI. Today, forecasting is primarily represented as a single baseline total, which limits how effectively revenue teams can communicate confidence levels and manage risk. By introducing explicit scenario buckets, we’ll align our product with common revenue forecasting practices and make forecasts more actionable for both sales leadership and finance.\n\nOn the backend, we will extend the forecast data model to store scenario-level values and update aggregation logic so totals can be computed separately for Baseline, Commit, and Best-Case. Scenario assignment will be sourced from the CRM stage/forecast category wherever available, with a clear default mapping to ensure consistent behavior across accounts and opportunities. This reduces ambiguity and ensures the same opportunity is categorized consistently across views and time.\n\nThe Forecast API will be updated to return scenario totals alongside the existing baseline forecast, enabling downstream consumers (UI and any integrations) to access a complete scenario breakdown. This change improves clarity for analytics and reporting use cases by separating high-confidence revenue (Commit) from upside (Best-Case) without requiring custom logic outside the platform.\n\nIn the UI, we will surface Commit and Best-Case totals next to the baseline forecast so users can quickly understand “what’s likely” versus “what’s possible.” This supports better weekly forecasting conversations, tighter alignment between sales and finance, and faster identification of gaps between committed outcomes and targets—ultimately improving decision-making and forecast reliability.",
      "link": "https://www.onyx.app/61674"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}