{
  "id": "df8257ca56fe48d09aea76f3c43b4347",
  "semantic_identifier": "Impact--Integrations_connectors v2: Add scheduled refresh job for Salesforce/HubSpot sync.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-06-01",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Integrations_connectors v2: Add scheduled refresh job for Salesforce/HubSpot sync.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds a scheduled refresh job for our Salesforce and HubSpot connectors so that ARR and opportunity data stays continuously up to date after the initial connection. Today, the issue-to-customer/value linkage can drift as CRM data changes (new opportunities, stage/amount updates, renewals), which reduces trust in the revenue context we show alongside product work.\n\nWith scheduled refresh, each connected account will periodically re-pull the relevant ARR and opportunity records on a configurable cadence. Where supported, the connector will use incremental sync based on “updated since” timestamps to minimize API usage and shorten refresh times, while still ensuring we capture all meaningful CRM changes that affect linkage.\n\nTo make the system reliable at scale, the job will include basic backoff and retry behavior to handle transient failures and avoid hard breaks when we hit API rate limits. This reduces support burden and prevents extended periods of stale data that undermine reporting and decision-making.\n\nFinally, we will persist last-successful sync state per connector and per account, ensuring downstream linkage logic always operates on the freshest known inputs and can resume cleanly after failures. The user impact is higher confidence in customer/value attribution, more accurate revenue context on issues, and less manual intervention to keep CRM-linked insights current.",
      "link": "https://www.onyx.app/24470"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}