{
  "id": "194b038bbcc94fd591c9a75f26968699",
  "semantic_identifier": "Impact--Setup Data Quality: Add one-click auto-fixes for common Fit Driver input issues.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-04-17",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Setup Data Quality: Add one-click auto-fixes for common Fit Driver input issues.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds one-click “Fix” actions to the Setup → Data Quality panel to resolve the most common issues preventing clean Fit Driver inputs: trimming leading/trailing whitespace, normalizing casing, converting empty strings to null, and mapping common enum synonyms (e.g., “mid market” → “Mid-Market”). The intent is to turn the panel from a diagnostic surface into an actionable setup step, reducing the need for manual spreadsheet cleanup or support intervention before Fit Drivers can be used reliably.\n\nBy applying fixes as workspace-level normalization rules, the cleanup becomes durable: future ingests are automatically corrected and downstream fit scoring consistently operates on normalized values. This improves match rates and reduces fragmentation in categorical dimensions (e.g., company segment, region, industry) that otherwise create duplicate buckets and degrade model/score stability and reporting clarity.\n\nTo build confidence and prevent accidental over-normalization, the panel will show a before/after preview on a small sample and allow users to revert proposed changes prior to finalizing setup. This makes the impact of each fix legible and auditable during onboarding, while keeping the experience fast enough to be “one-click” for common cases.\n\nOverall impact: faster time-to-value in setup (fewer blocked Fit Driver fields), fewer support escalations for “why is my scoring wrong?” caused by dirty inputs, and higher quality/consistency of fit scoring and analytics over time. Success can be measured via reduced setup drop-off due to data quality issues, increased percentage of Fit Driver fields passing validation, and a decrease in unique-value cardinality for normalized enums after setup.",
      "link": "https://www.onyx.app/23529"
    }
  ],
  "primary_owners": [
    "kenji_watanabe@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}