{
  "id": "b163223852ed4aeb9714c71bb277c550",
  "semantic_identifier": "Impact--Optimize dedupe/cluster persistence queries and indexes for high-volume ingestion.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-08-05",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Optimize dedupe/cluster persistence queries and indexes for high-volume ingestion.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature improves the performance and reliability of our high-volume ingestion pipeline by optimizing the database queries and indexes used during deduplication, clustering, and issue-object persistence. Today, when ingesting large backlogs, several “hot path” lookups (e.g., by source ticket ID, conversation ID, and normalized fingerprint) can trigger full table scans and create unnecessary lock contention, slowing ingestion and increasing operational risk.\n\nBy profiling current read/write patterns and rewriting the most expensive queries, we expect materially lower database load per ingested item and faster end-to-end processing times for backfills. Adding or adjusting indexes targets the exact access patterns used during dedupe/cluster decisions and persistence, reducing latency spikes and improving throughput consistency as dataset size grows.\n\nThis work also reduces the likelihood of ingestion stalls, timeouts, and cascading delays that impact downstream processing and customer-visible freshness of imported data. Operationally, it should lower the need for manual intervention during large imports and provide more predictable resource usage, which can translate into lower infrastructure cost or headroom for higher concurrency.\n\nCrucially, this is a performance-only change: we will validate with a backfill-sized dataset and explicitly ensure idempotency, merge behavior, and dedupe/cluster outcomes remain unchanged. Success will be measured via reduced query time/IO, fewer full scans and lock waits, and improved ingestion throughput and completion time under realistic backlog loads.",
      "link": "https://www.onyx.app/57534"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}