{
  "id": "d4590d4831b54f359f9a85b1db370f4f",
  "semantic_identifier": "Impact--Expose issue_prioritization score breakdown in Issue Theme API + UI.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-05-12",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Expose issue_prioritization score breakdown in Issue Theme API + UI.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature makes issue prioritization explainable by exposing a full score breakdown for each Issue Theme. Today, we compute a priority score used to rank themes, but without transparency the ordering can feel arbitrary and is difficult to defend in reviews with stakeholders. By surfacing how the score was derived, we turn prioritization from a “black box” into an auditable decision aid.\n\nOn the API side, the Issue Theme response will include the total priority score, per-factor contributions (frequency, severity, ARR tier), and the scoring configuration version used. This allows the UI and any downstream consumers to render consistent explanations and also enables historical comparisons when scoring logic evolves. Including the config version is essential for diagnosing shifts in ranking and for communicating “this score was computed under vX rules.”\n\nOn the UI side, both the Issue Theme list and detail views will display the same breakdown with clear, user-friendly labels. We’ll explicitly call out fallbacks such as “Unknown ARR tier (default applied)” or “Severity not set (default applied)” so users can immediately understand when data quality or missing inputs influenced the score. Consistent presentation across list/detail reduces confusion and prevents contradictory interpretations.\n\nOverall impact: increased trust in the ranking, fewer questions during prioritization reviews, and faster alignment across Product, CS, and Engineering on “why this is ranked above that.” It also creates a foundation for iterating on the scoring model safely, since changes can be traced to a config version and explained in-product rather than requiring out-of-band documentation.",
      "link": "https://www.onyx.app/23231"
    }
  ],
  "primary_owners": [
    "kenji_watanabe@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}