{
  "id": "6cb62d8da4304c2cbbf7dbf6eddff1ea",
  "semantic_identifier": "Impact--Admin UI: Add audit log viewer for customer signal/PII access events.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-12-14",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Admin UI: Add audit log viewer for customer signal/PII access events.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds an admin-only Audit Log Viewer in Workspace Settings to make access to customer signals and PII transparent and reviewable. Workspace admins will be able to see audit events generated by existing instrumentation (reads, views, exports) so they can quickly understand who accessed sensitive data, what they did, and when it occurred.\n\nThe core value is improved security oversight and operational response. When customers have questions about internal access, suspicious behavior, or compliance requirements, admins can self-serve answers without filing support tickets or relying on engineering to query logs. This also creates a clear paper trail for incident investigation and routine governance.\n\nThe UI will support basic filtering—time range, actor, action type, and resource—plus pagination to keep performance predictable as log volume grows. A CSV download will export exactly the currently filtered result set, enabling admins to share evidence with auditors, store it internally, or perform deeper analysis offline.\n\nAccess control is central to the impact: the page and exports will be restricted to workspace admins via existing role/permission checks. This ensures the audit surface does not become a new avenue for exposing sensitive metadata, while still empowering authorized administrators with the visibility they need.",
      "link": "https://www.onyx.app/97104"
    }
  ],
  "primary_owners": [
    "michael_anderson@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}