{
  "id": "52ac66ed52cc407fb56e412bfa6e0fa4",
  "semantic_identifier": "Impact--Messaging Library Export API: enforce approval-state + versioning rules in export payload.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-09-28",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Messaging Library Export API: enforce approval-state + versioning rules in export payload.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This change tightens the Messaging Library Export API so it only returns assets that are actually usable in production workflows. Server-side enforcement will ensure only assets in an **Approved** state are eligible for export, and **Draft** or **Rejected** items are excluded from all export responses. This reduces the risk of customers or downstream systems accidentally distributing unreviewed or explicitly rejected content, and aligns exported data with governance expectations.\n\nWe will also add explicit **versioning metadata** in the export payload (e.g., `asset_version`, `approved_at`, `updated_at`) so consumers can reason about freshness, auditability, and update behavior. This makes it easier for integrators to detect changes, validate that they have the latest approved content, and support workflows like “only re-sync if the approved version changed,” reducing unnecessary processing and confusion.\n\nTo support reliable, repeatable integrations, we’ll persist a stable `external_id` per asset in exports. This enables idempotent updates—clients can map exported assets back to the same object over time rather than creating duplicates on each export. Overall, this improves data consistency across environments and simplifies reconciliation for partners and internal tooling.\n\nFinally, the API will return clear, structured error responses when a client requests export for assets that are missing or not approved. This improves developer experience and supportability by making failure modes explicit, enabling faster debugging, and preventing silent partial exports that could otherwise lead to inconsistent downstream state.",
      "link": "https://www.onyx.app/87985"
    }
  ],
  "primary_owners": [
    "kenji_watanabe@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}