{
  "id": "f8fd43c097c94599b09b68203c8df934",
  "semantic_identifier": "Impact--Add configurable weight caps for fit tier when deal-dynamics risks are present (scoring config only).docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-07-07",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Add configurable weight caps for fit tier when deal-dynamics risks are present (scoring config only).docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds new configuration fields to our scoring pipeline to cap the “fit tier” contribution when deal-dynamics risk signals are present—specifically procurement stage risk, competition risk, and internal alignment risk. The primary intent is to make the current behavior tunable and safer in high-risk deal contexts, while keeping the overall ranking logic unchanged for now. The cap will be applied at score-component calculation time, so we can reduce over-weighting fit in scenarios where execution risk is elevated.\n\nFrom a product impact perspective, this creates a controlled mechanism to prevent inflated scores for deals that look great on fit but are likely to stall or lose due to procurement friction, competitive pressure, or weak internal alignment. It directly operationalizes learnings from the GOLD-97 audit by persisting sensible default caps aligned to observed scoring issues, reducing the chance of repeating those failure modes. The outcome should be more trustworthy score breakdowns and a better foundation for later ranking adjustments.\n\nOperationally, the configuration will be persisted and made adjustable per workspace/environment, enabling gradual rollout, A/B-style tuning, and customer-specific calibration without code changes. This also improves our ability to respond quickly to audit findings or edge cases by adjusting caps rather than reworking scoring logic. Because this ticket is “config plumbing only,” there’s minimal immediate surface-area change, but meaningful leverage for future iterations.\n\nThis work intentionally excludes validation and UX: there will be no new admin UI and likely no user-visible settings in this phase. Follow-up tickets will cover guardrails (e.g., ensuring caps don’t create unintended score inversions), configuration management UX, and any ranking-layer changes once we’re confident the component-level behavior is stable and measurable.",
      "link": "https://www.onyx.app/79470"
    }
  ],
  "primary_owners": [
    "michael_anderson@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}