{
  "id": "b0630ad82b0a4d769ffa301684ccc778",
  "semantic_identifier": "Impact--issue_clustering v2: Add cluster drift detection with alerts and audit trail.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-10-28",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--issue_clustering v2: Add cluster drift detection with alerts and audit trail.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds cluster drift detection to issue_clustering v2 so we can automatically identify when our clustering output is no longer stable or representative. By monitoring changes in cluster assignments and embedding distribution metrics against configurable thresholds, we’ll detect meaningful shifts that typically indicate new issue themes emerging, upstream data changes, or model/embedding behavior changes that could degrade grouping quality.\n\nWhen drift is detected, the system will persist a structured drift signal (timestamp, impacted clusters, and relevant metrics) and generate a high-priority alert for triage. This creates an actionable operational loop: teams are notified quickly, can validate whether the drift reflects real product changes or a pipeline/model regression, and can decide whether to re-cluster, adjust thresholds, or investigate upstream causes.\n\nWe’ll also add a lightweight audit trail that connects each drift event to the underlying source conversations that contributed to the shift, and links to the downstream engineering work created to address it. This improves defensibility and traceability by making it clear why an alert fired, what evidence supported it, and what remediation actions were taken.\n\nOverall impact: higher reliability and trust in clustering outputs, reduced time-to-detection for quality regressions, and better governance for decisions made from clustering insights. This should improve the accuracy of issue triage and reporting over time while reducing the risk of silently drifting clusters leading to misprioritized work or missed emerging problems.",
      "link": "https://www.onyx.app/14444"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}