{
  "id": "9d9207d5cb3f4811bbef4ce1606cfc5e",
  "semantic_identifier": "Impact--Add inbound sync: ingest Jira/Linear issue updates into Issue_Tracker issue object.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-05-05",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Add inbound sync: ingest Jira/Linear issue updates into Issue_Tracker issue object.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds an inbound synchronization path so that updates made to linked issues in Jira or Linear are reflected back into our `Issue_Tracker` issue object. Specifically, when a user changes status/state, priority, title, labels, or assignee in the external tool, those updates will be ingested and applied to the corresponding `Issue_Tracker` record to keep both systems aligned.\n\nTo reduce risk and preserve local context, the sync will only update fields that are explicitly mapped/configured for that integration. This prevents overwriting `Issue_Tracker`-specific metadata or workflows and makes the behavior predictable for teams that rely on `Issue_Tracker` as their source of truth for certain attributes.\n\nFor initial rollout, inbound sync will be implemented via polling (with webhooks planned in a follow-up). We will persist `last_synced_at` alongside the external system’s `updated_at` timestamp to support incremental fetching and idempotent processing, improving performance and avoiding duplicate or out-of-order updates.\n\nOperationally, the system will handle common failure modes without breaking the relationship between issues: permission errors and missing-issue scenarios will be logged and surfaced via alerting, while retaining the link so customers can remediate access or restore the external issue without losing connectivity. This should materially reduce drift between systems and lower manual reconciliation effort for teams using Jira/Linear alongside `Issue_Tracker`.",
      "link": "https://www.onyx.app/44431"
    }
  ],
  "primary_owners": [
    "michael_anderson@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}