{
  "id": "cad4715bb89a4024b64f71b2e22e3bd9",
  "semantic_identifier": "Impact--Detect and redact PII in raw customer signal views and exports.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-10-19",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Detect and redact PII in raw customer signal views and exports.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds an automated PII detection and redaction layer to all ingested customer signals so that sensitive fields (emails, phone numbers, addresses, and free‑text notes) are masked by default anywhere raw records are surfaced. The primary user-facing impact is in raw customer signal views: users will continue to see the same records and metadata, but any detected sensitive values will appear redacted unless they have explicit permission to view them.\n\nExports and downloads will follow the same default behavior, ensuring we don’t inadvertently leak PII through CSV/JSON payloads or other export mechanisms. To prevent inconsistencies, the redaction logic will be applied at the API layer that powers both the UI and export endpoints, so all consumers receive the same redacted representation unless authorized.\n\nWe’ll introduce a clear workspace-level permission (“view sensitive data”) that admins can enable per role to allow unredacted access when required for legitimate workflows (e.g., support, ops). This makes the privacy posture “safe by default” while still allowing controlled access with clear administrative intent and auditability expectations.\n\nEngineering impact includes implementing and validating common PII pattern coverage with unit/integration tests and ensuring downstream pipelines (fit-score/positioning) do not regress by continuing to rely only on non‑PII features. Overall, this reduces compliance and customer trust risk with minimal disruption to existing product functionality and performance.",
      "link": "https://www.onyx.app/69120"
    }
  ],
  "primary_owners": [
    "michael_anderson@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}