{
  "id": "e95f7a35734c4acebe7a13e563f13273",
  "semantic_identifier": "Impact--Pin positioning block version per recommendation to prevent drift on Marketing updates.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-08-01",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Pin positioning block version per recommendation to prevent drift on Marketing updates.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This change prevents recommendation and message content from “drifting” when Marketing publishes new versions of positioning blocks. Today, generation can resolve to “latest” at runtime, meaning the same recommendation may render differently over time, especially during re-renders, edits, or follow-up sequences. That inconsistency creates confusion for users, complicates approvals, and makes it hard to trust historical messaging performance.\n\nWe will update recommendation/message generation to always reference an explicit `positioningBlockVersionId` sourced from the stored Customer_Analyzer versions. The selected version will be persisted on every generated recommendation/message record, so subsequent renders and downstream flows reuse the same pinned version. This ensures that what a user saw and approved is what continues to be shown and sent, even as Marketing iterates.\n\nOperationally, this improves auditability and debuggability: we can attribute messaging outcomes to a specific version, reproduce content reliably, and reduce support churn caused by “why did this change?” incidents. It also clarifies ownership boundaries—Marketing can safely publish updates without unintentionally altering in-flight customer sequences.\n\nIf a requested version is missing or unavailable, the system will fail with a clear, actionable error and fall back only to the last known pinned version (no silent auto-upgrade to “latest”). This protects consistency while still allowing recovery in edge cases, and makes version-related data issues visible early rather than surfacing as subtle content changes later.",
      "link": "https://www.onyx.app/19982"
    }
  ],
  "primary_owners": [
    "kenji_watanabe@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}