{
  "id": "66feb7deeae54aec9bceb9b5d4e333ec",
  "semantic_identifier": "Impact--Implement scheduled CRM refresh job runner for Salesforce/HubSpot (read-only sync).docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-08-03",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Implement scheduled CRM refresh job runner for Salesforce/HubSpot (read-only sync).docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds a backend scheduled job runner that performs reliable, read-only CRM refreshes from Salesforce and HubSpot on the cadence configured per workspace (as defined in GOLD-79). Its primary purpose is to ensure our internal representation of CRM data stays current without requiring manual refreshes or ad-hoc sync triggers.\n\nOn each run, the job will fetch only the in-scope objects and fields, using a stored cursor/last-sync timestamp per workspace to support incremental ingestion. Retrieved records will be persisted into (or used to update) our internal sync tables, enabling downstream product surfaces and analytics to operate on fresher CRM data with predictable update intervals.\n\nThis implementation explicitly excludes record deduplication and any write-back behavior to the CRMs. The impact is therefore focused on ingestion correctness and repeatability: a stable pipeline that can be safely enabled broadly while we defer higher-risk behaviors (merging logic, conflict resolution, outbound writes) to later work.\n\nOperationally, the job will include basic retries and per-run logging/metrics to support monitoring, troubleshooting, and performance tuning. This improves system reliability and supportability by making sync health visible (e.g., success/failure rates, duration, records processed, and per-workspace progress) and reducing the likelihood of silent data staleness.",
      "link": "https://www.onyx.app/30616"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}