{
  "id": "18d24c86de4f44da850b53a5de9f6296",
  "semantic_identifier": "Impact--Forecasting: Implement segment-weighted forecast totals using Customer_Analyzer fit tiers.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-09-22",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Forecasting: Implement segment-weighted forecast totals using Customer_Analyzer fit tiers.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds segment-weighted forecast totals to our forecasting aggregation pipeline by applying configurable weights based on the Customer_Analyzer “fit tier” (e.g., A/B/C). Instead of treating all opportunities equally, we’ll adjust opportunity amounts/probabilities by tier weight and then roll them up to produce weighted totals that better reflect expected performance by customer segment.\n\nFrom a product impact perspective, this improves forecast accuracy and trust for GTM leaders by incorporating a consistent, centrally-defined “quality” signal into topline numbers. It also enables faster iteration on forecasting strategy (tuning tier weights) without changing the UI or requiring per-report logic, making the system more adaptable as our understanding of segment performance evolves.\n\nOn the platform/API side, we’ll expose both raw and weighted totals via the forecast API. This ensures the UI can render toggles or side-by-side views (raw vs weighted) while keeping the logic authoritative in the backend, reducing duplication, inconsistency risk, and maintenance overhead across clients.\n\nThe weighting will work across existing scenario buckets (baseline/commit/best-case) so teams can compare scenarios apples-to-apples under the same weighting scheme. When a fit tier is missing, the system will fall back gracefully (e.g., default/unweighted behavior) to avoid breaking totals and to keep results stable while data quality improves.",
      "link": "https://www.onyx.app/35969"
    }
  ],
  "primary_owners": [
    "michael_anderson@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}