{
  "id": "f7b0ff3ef0cb45c581292f89d8024abc",
  "semantic_identifier": "Impact--Implement status normalization service using canonical status mapping (ingest + outbound payloads).docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-12-28",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Implement status normalization service using canonical status mapping (ingest + outbound payloads).docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature introduces a shared status-normalization service that translates statuses from external systems (Zendesk/Intercom, Jira/Linear, CRM) into a single canonical `Issue_Tracker` status, based on the mapping defined in GOLD-197. The module will be used both on ingestion and on outbound payload construction, ensuring consistent status semantics regardless of the source or destination system.\n\nThe primary product impact is improved data consistency and reliability across the issue lifecycle. By persisting only the canonical status on stored issue objects (while retaining the original external status as metadata), we eliminate downstream ambiguity, reduce UI and reporting discrepancies, and make cross-system workflows and analytics comparable without bespoke per-integration handling.\n\nOperationally, this standardization reduces support and engineering overhead caused by mismatched or drifting external statuses. Centralizing mapping logic into one module also makes future integrations faster to ship and safer to change, since updates to external status vocabularies can be handled in a single place rather than scattered across multiple pipelines.\n\nTo protect the product from unexpected external changes, the module will gracefully handle unknown or deprecated external statuses by assigning an explicit fallback canonical status and emitting structured logs. This prevents ingestion failures and silent data corruption while creating a clear audit trail for follow-up mapping updates and cleanup.",
      "link": "https://www.onyx.app/16183"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}