{
  "id": "1c9f3adce8c940fcbe3decc030d7d9ae",
  "semantic_identifier": "Impact--Add explicit success metric definition & weighting to Fit Score configuration.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-06-05",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Add explicit success metric definition & weighting to Fit Score configuration.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This change adds an explicit, required “Success Metric” definition to Fit Score segment/model configuration so it’s always clear what the Fit Score is optimizing for (e.g., retention, expansion, win rate). When teams create or update a model, they will select one or more success metrics and optionally assign weights when multiple metrics are chosen.\n\nBy persisting the selected metric(s) and weighting with each model version, we make the Fit Score’s objective stable, auditable, and historically traceable. This prevents silent shifts in interpretation over time (e.g., a Fit Score originally tuned for win rate later assumed to represent retention) and enables consistent comparisons across versions.\n\nWe will surface the success metric definition alongside the Fit Score in the UI wherever the score is viewed, ensuring Sales, CS, Marketing, and RevOps share the same understanding of “what good looks like.” This reduces cross-team disagreements, speeds decision-making, and improves trust in downstream workflows that depend on Fit Score (targeting, prioritization, routing, and reporting).\n\nOverall impact is increased alignment and governance: Fit Score becomes a clearly documented optimization target rather than an implicit, debatable one. The primary success outcome is fewer metric disputes and faster adoption of Fit Score-driven actions, supported by a clear audit trail of objective and weighting by model version.",
      "link": "https://www.onyx.app/92588"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}