{
  "id": "7cd0b9a8f0ce48ee8313d4d128c32da3",
  "semantic_identifier": "Impact--Debounce sales/opportunity signals to prevent one-off deal asks from boosting issue priority.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-06-27",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Debounce sales/opportunity signals to prevent one-off deal asks from boosting issue priority.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This change improves the integrity of our prioritization system by preventing one-off sales asks from disproportionately inflating an issue or theme’s priority score. Today, a single linked “Sales_Accelerator” opportunity can materially boost priority, creating noise and encouraging reactive prioritization that may not reflect broader customer impact or strategic value.\n\nWe will introduce debouncing/gating for sales-driven uplifts: a sales/opportunity linkage will only contribute to priority once it meets a minimum evidence threshold (e.g., multiple distinct opportunities, or an opportunity corroborated by support conversations). This ensures sales signals act as validation of a repeated pattern rather than a trigger for immediate reprioritization based on a single deal.\n\nThe expected impact is a more stable and defensible roadmap: fewer priority spikes, less churn in planning, and reduced incentive to “game” the system via opportunistic linking. Product and engineering teams should see a clearer separation between genuine market demand and isolated revenue-driven requests, while still preserving the ability for strong, repeated sales evidence to influence prioritization.\n\nTo maintain transparency, the issue UI and underlying issue object will explicitly record when a sales uplift is suppressed and why (e.g., “insufficient evidence threshold”). This auditability helps explain prioritization decisions to Sales and other stakeholders, supports consistent governance, and enables follow-up actions (e.g., prompting for additional corroborating evidence) without losing visibility into the original signal.",
      "link": "https://www.onyx.app/64158"
    }
  ],
  "primary_owners": [
    "michael_anderson@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}