{
  "id": "8ecfd911bd4741f797c34bb55289646d",
  "semantic_identifier": "Impact--Harden Jira/Linear two-way sync: retries, backoff, and dead-letter handling for failed sync runs.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-04-09",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Harden Jira/Linear two-way sync: retries, backoff, and dead-letter handling for failed sync runs.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature hardens our Jira ↔ Linear two‑way sync so that transient upstream/inbound failures don’t cause repeated breakage, noisy logs, or user-visible instability. We will introduce automatic retries with exponential backoff and idempotency safeguards to ensure we can safely reprocess the same events without duplicating updates or corrupting state. The goal is to improve reliability while reducing the operational load from intermittent API errors, rate limits, and temporary network issues.\n\nWhen failures persist (e.g., Jira permissions revoked, the linked issue deleted, or sustained rate limiting), the sync will transition the affected link into a “dead-letter” state. We will persist per-link error code/message and a failure count so the UI status panel can surface clear, actionable information (what failed and why) without re-triggering failing calls. This makes problems diagnosable by users and support, and enables targeted remediation rather than repeated blind retries.\n\nCritically, failures will not break the existing link mapping: the Jira/Linear relationship remains intact even if a particular sync run cannot be completed. This prevents accidental unlinking or re-link attempts that could create duplicates or further inconsistencies. Once the underlying issue is resolved, a successful subsequent run will automatically clear the error state and return the link to healthy operation.\n\nImpact-wise, we expect fewer stuck syncs, fewer repeated failed requests, and faster recovery from transient outages, leading to higher trust in integrations and reduced support volume. This also provides a foundation for future tooling (e.g., admin controls to requeue dead-lettered links) because failures become explicit, persisted, and visible rather than hidden in logs.",
      "link": "https://www.onyx.app/37275"
    }
  ],
  "primary_owners": [
    "kenji_watanabe@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}