{
  "id": "37bc11aa0ea644c7948d317ebba52dc1",
  "semantic_identifier": "Impact--Normalize and canonicalize identity fields for ticket→account matching.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-04-14",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Normalize and canonicalize identity fields for ticket→account matching.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds a canonicalization layer to standardize the identity signals we use to link inbound support tickets to customer accounts—specifically email/domain, company name, and CRM account IDs. Today, small inconsistencies (case differences, extra whitespace, punctuation, legal suffix variations like “Inc.” vs “Incorporated,” and known alias domains) can prevent otherwise-correct matches, creating avoidable “unlinked” tickets or incorrect account associations.\n\nBy normalizing these fields at ingestion time, we improve match reliability without changing the underlying matching thresholds or business logic. The matching system will simply operate on cleaner, consistent inputs, which should increase successful automatic linking and reduce the number of tickets requiring manual triage, while also decreasing the risk of fragmented ticket history across duplicate or near-duplicate accounts.\n\nThe implementation will store both raw and canonical values for auditability and troubleshooting. This makes it easier to explain why a ticket matched (or didn’t), supports customer support and ops workflows when investigating edge cases, and gives engineering a safer path to iterate on normalization rules over time without losing the original source data.\n\nOverall impact is improved data quality and operational efficiency: fewer mismatches, faster routing to the right account context, and more reliable reporting on ticket volume and customer experience at the account level. Because we’re not adjusting thresholds yet, this is a low-risk foundational change that should deliver immediate gains while setting us up for future improvements in matching accuracy.",
      "link": "https://www.onyx.app/87185"
    }
  ],
  "primary_owners": [
    "kenji_watanabe@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}