{
  "id": "4d6c93b680674b0f9c67c99dc467e594",
  "semantic_identifier": "Impact--Implement issue_prioritization score computation (frequency + severity + ARR tier) using persisted config.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-05-25",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Implement issue_prioritization score computation (frequency + severity + ARR tier) using persisted config.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature introduces a standardized, workspace-specific issue prioritization score that combines three key signals: how often the issue occurs (frequency), how severe it is (severity), and the customer’s ARR tier. By computing a single total score from a persisted “active” configuration per workspace, we ensure prioritization reflects each organization’s policies rather than hardcoded defaults.\n\nProduct impact is a more consistent and scalable way to rank issues across teams and time. A persisted configuration enables admins (or ops) to adjust weights, mappings, and normalization rules without requiring engineering changes, supporting different business strategies (e.g., prioritizing enterprise ARR impact vs. high-volume bugs) while maintaining repeatability in day-to-day triage.\n\nThe scoring service also returns an explainable breakdown of the final score, including per-factor contributions and any normalization applied. This improves trust and decision quality: PMs, support, and engineering can quickly understand why an issue is ranked highly, reduce debates during triage, and identify which input signals (e.g., missing severity) are driving outcomes.\n\nFinally, defined fallbacks for unknown ARR tiers and incomplete severity data make scoring stable and deterministic, preventing “missing data” from breaking prioritization workflows or causing unpredictable rank shifts. This sets a reliable foundation for downstream experiences like sorted backlogs, auto-escalation rules, routing, and analytics on issue mix and impact over time.",
      "link": "https://www.onyx.app/33263"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}