{
  "id": "2eefc5e7d52141198f1e197a29f16505",
  "semantic_identifier": "Impact--Add attribution query API to correlate outcomes to positioning_version_id.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-12-12",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Add attribution query API to correlate outcomes to positioning_version_id.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds a backend attribution query API that lets us correlate business outcomes (e.g., conversion, win/loss, churn) directly to a specific `positioning_version_id`. By grounding attribution on the persisted join key introduced in GOLD-52, we establish a reliable, auditable linkage between the positioning a user or buyer experienced and the downstream outcome we care about, enabling consistent reporting across teams.\n\nThe endpoint will return outcome metrics grouped by `positioning_version_id`, with optional filters for segment/ICP, channel and/or artifact type, and a configurable time window. It will return both raw counts and basic rates (e.g., conversion rate, win rate, churn rate), making it usable for both quick summaries and deeper analysis without additional client-side computation.\n\nA core impact is enabling apples-to-apples comparisons between two positioning versions over the same period. This supports experimentation workflows (A/B or sequential rollouts) and allows PMM/Product to quantify whether a new positioning meaningfully changes outcomes within specific segments or channels, rather than relying on qualitative feedback alone.\n\nTo ensure the API can power an attribution report UI, results will be stable and paginated, and the underlying queries will be indexed to perform well at scale. This reduces latency and avoids report “drift” when navigating pages, improving trust in the data and making it feasible to expand the UI to additional breakdowns over time.",
      "link": "https://www.onyx.app/40521"
    }
  ],
  "primary_owners": [
    "michael_anderson@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}