{
  "id": "5c01ef36e8534658880309e89f059871",
  "semantic_identifier": "Impact--Add admin-configurable segment/ICP weighting controls (UI + permissions).docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-05-06",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Add admin-configurable segment/ICP weighting controls (UI + permissions).docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds an Admin settings UI that exposes the segment/ICP weighting controls currently buried in the scoring service, allowing authorized non-engineering users (e.g., Product and Support) to tune how customer fit influences prioritization without code changes or deployments. The primary impact is faster iteration on prioritization logic as GTM strategy evolves, reducing turnaround time from days/weeks (engineering queue) to minutes/hours (self-serve).\n\nTo ensure changes are safe and intentional, the UI will include guardrails such as min/max ranges, input validation, and a one-click reset-to-default option. This reduces the risk of accidental or overly aggressive weight adjustments that could cause abrupt, confusing shifts in scoring outcomes and downstream workflows.\n\nRole-based access control (RBAC) will limit who can view and edit these settings (e.g., Admin/PM only), minimizing unauthorized changes and supporting internal governance. This improves operational reliability by ensuring that only accountable roles can influence scoring behavior.\n\nFinally, all weighting updates will be versioned and recorded in the score audit trail so that any priority movement can be explained, traced to a specific configuration change, and debugged if needed. This strengthens trust in the scoring system by making prioritization shifts defensible (for stakeholders) and diagnosable (for Support/Product when investigating “why did this score change?”).",
      "link": "https://www.onyx.app/55021"
    }
  ],
  "primary_owners": [
    "michael_anderson@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}