{
  "id": "ed63ca4585164c39abb0dab5002b3e24",
  "semantic_identifier": "Impact--Audit and document segment definition sources across CRM and Customer_Analyzer.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-09-05",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Audit and document segment definition sources across CRM and Customer_Analyzer.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This work will reduce inconsistencies in how segments are defined and used across CRM and Customer_Analyzer by auditing the end-to-end logic that determines segment membership. Today, the same segment name can effectively mean different things depending on which system computes it, creating silent drift driven by differences in fields, filters, refresh cadence, and ownership.\n\nThe primary output is a concise, documented mapping of segment names to their underlying criteria and data sources in each system, along with a clear identification of where definitions diverge. For each mismatch, we will call out which Issue_Tracker reporting surfaces are impacted so stakeholders can quickly understand where counts, attribution, and downstream analyses may be unreliable.\n\nThis documentation will enable a recommended “source of truth” per segment, creating a shared reference for Product, Data, and Engineering and a baseline for future changes. It also improves operational confidence by making segment logic auditable, reviewable, and less dependent on tribal knowledge.\n\nFinally, the audit will surface gaps that cannot be solved by documentation alone (e.g., missing fields, inconsistent refresh schedules, or ownership ambiguity). Those items will be explicitly captured as follow-up fixes in subsequent tickets, prioritizable based on user-facing impact and the severity of reporting discrepancies.",
      "link": "https://www.onyx.app/93445"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}