{
  "id": "82bb0bb018ba4539ac47b47ef8ef141a",
  "semantic_identifier": "Impact--Display data sufficiency warnings and confidence cues in Fit Score UI.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-05-23",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Display data sufficiency warnings and confidence cues in Fit Score UI.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature will make Fit Score more trustworthy and easier to interpret by surfacing when the score is based on insufficient or stale data. Instead of presenting a single number with implied precision, the UI will clearly communicate confidence cues using the backend’s existing diagnostics (sample size, recency, and signal coverage), reducing the chance that customers over-index on a score that isn’t well-supported.\n\nWhen thresholds aren’t met, Fit Score will enter a “Limited data” state across the product—segment list, segment detail, and any exported or shareable representations (e.g., screenshots/exports where applicable). Alongside the score, we’ll show a compact summary such as `n=<count>`, `coverage=<%>`, and `last updated=<date>`, so users can quickly assess whether the score is actionable without digging.\n\nA tooltip/modal will explain what “Limited data” means, why it happens (e.g., low sample size, poor coverage, outdated signals), and how it may impact reliability. This improves user understanding and provides a clear path for troubleshooting, while keeping the primary UI lightweight.\n\nOverall impact: fewer misinformed decisions driven by low-confidence scores, increased transparency and credibility of Fit Score, and reduced support burden from “why does this score look wrong?” questions. Consistent warning behavior across all surfaces also prevents contradictions (e.g., a confident-looking score in a list that is actually data-limited in detail), improving product integrity.",
      "link": "https://www.onyx.app/21618"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}