{
  "id": "5a0370c7b7374eb096ec9ef2b2deba68",
  "semantic_identifier": "Impact--issue_history v2: Add templated internal decision notes (why/next steps) as timeline events.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-08-14",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--issue_history v2: Add templated internal decision notes (why/next steps) as timeline events.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds a standardized way to capture internal triage decision notes in issue_history v2 as first-class, structured timeline events. Instead of freeform comments scattered across tools, teams will record decisions using a template (template ID + defined fields such as decision, why, next_steps, owner/team, timestamp) that is persisted immutably and returned via the issue history API. Basic validation and sanitization ensures the notes are consistent, safe to display, and reliably searchable.\n\nThe primary impact is improved clarity and continuity in incident/issue handling: anyone reviewing an issue can quickly understand what was decided, why it was decided, and what should happen next—without interpreting unstructured narratives. This reduces repeated triage, lowers handoff friction across on-call rotations and teams, and makes it easier to audit decision-making over time (especially for contentious calls like deprioritization or blocking).\n\nStructuring these notes also unlocks better downstream workflows: consistent UI rendering in timelines, filtered search for “decision = deprioritized” or “next_steps contains vendor escalation,” and analytics on patterns (e.g., common reasons for blocking). By linking notes to lifecycle transitions (triaged/deprioritized/blocked), we provide context exactly where it’s needed while avoiding duplication of existing ownership/SLA logic in other systems.\n\nOperationally, this should reduce time-to-context and increase decision traceability with minimal process overhead, since the template guides authors to include the essential fields. The immutability constraint preserves integrity for audits and postmortems, while the API exposure enables gradual adoption across internal tools without requiring a full UI rewrite up front.",
      "link": "https://www.onyx.app/83193"
    }
  ],
  "primary_owners": [
    "michael_anderson@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}