{
  "id": "8121896609a448ecae4077098c04b5b1",
  "semantic_identifier": "Impact--Add deduplication + canonical ID mapping for scheduled Salesforce/HubSpot sync.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-05-28",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Add deduplication + canonical ID mapping for scheduled Salesforce/HubSpot sync.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds deduplication and canonical ID mapping to our scheduled, read-only Salesforce/HubSpot refresh so we stop creating or updating duplicate Accounts, Contacts, and Opportunities across sync runs. Today, repeated imports can yield multiple internal entities for the same CRM record (or mutate identity when CRM IDs change), which fragments activity history and undermines downstream consumers like forecasting and next-best-action.\n\nWe will introduce a canonical record map keyed by **(CRM record ID, workspace)** that consistently resolves each external record to a single stable internal entity. On each scheduled sync, incoming records will be matched against this map; if duplicates are detected, we will merge into the canonical entity using explicit field-level conflict/merge rules for in-scope fields, rather than creating a new entity. This also enables safer handling of CRM-side deletes and ID changes by preserving internal continuity while marking records as deleted/archived or remapping identifiers when needed.\n\nThe primary product impact is improved data integrity for Sales_Accelerator: forecasting, pipelines, and next-best-action will reference one canonical Account/Contact/Opportunity per CRM record, reducing noise, incorrect rollups, and duplicated tasks. Users should see fewer “duplicate” entities, more reliable historical context, and more consistent outcomes from automation built on CRM data.\n\nWe will make sync outcomes observable by logging and emitting per-run metrics (e.g., duplicates detected, merges performed, conflicts encountered, records marked deleted, ID remaps). This will support operational monitoring, quicker diagnosis of customer-specific CRM edge cases, and clear evidence that scheduled sync runs are converging toward a stable, de-duped dataset over time.",
      "link": "https://www.onyx.app/77967"
    }
  ],
  "primary_owners": [
    "kenji_watanabe@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}