{
  "id": "113c7df4fc304b52a8af2f074d2ad148",
  "semantic_identifier": "Impact--Define canonical Issue_Tracker status model and cross-system mapping table.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-10-26",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Define canonical Issue_Tracker status model and cross-system mapping table.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature establishes a single, canonical Issue_Tracker status model—along with allowed transitions—that can represent the lifecycle of an issue consistently across support (Zendesk/Intercom), engineering (Jira/Linear), and sales/CRM workflows. Today, each system uses its own status vocabulary and semantics, which makes it difficult to reason about “where an issue is” in a unified way and leads to inconsistent reporting, handoffs, and automation.\n\nTo solve this, we will implement a cross-system status mapping table that links each external system’s statuses to the canonical model. The mapping will explicitly handle missing/unknown statuses (so we fail safely rather than silently misclassify) and deprecated external statuses (so legacy data remains interpretable and migrations are manageable). Defining allowed transitions in the canonical model also enables validation of state changes and prevents invalid cross-system updates.\n\nThe mapping will be exposed via configuration with seeded defaults plus the ability to edit, so changes in external tools (new statuses, renamed workflows, org-specific custom fields) can be absorbed without code changes. This configuration becomes the single source of truth that future sync logic, UI displays, alerts, and analytics can depend on, reducing duplication and the risk of divergent logic across services.\n\nThe impact is a more reliable and scalable foundation for cross-system synchronization and reporting: consistent dashboards and SLAs across teams, clearer ownership and handoff points, fewer sync bugs caused by status drift, and faster onboarding of new integrations or workflow changes. It also improves data quality over time by making unknowns explicit and by providing a structured path to deprecate or remap legacy statuses without breaking downstream consumers.",
      "link": "https://www.onyx.app/65646"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}