{
  "id": "6bfbd82690264701b111584b68d8c46c",
  "semantic_identifier": "Impact--Add standardized “Attribution Evidence” fields to Issue objects.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-12-31",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Add standardized “Attribution Evidence” fields to Issue objects.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds a standardized “Attribution Evidence” section to every Issue object so that impact inputs are captured in a consistent, structured way rather than scattered across comments, spreadsheets, or ad hoc links. The fields will cover core attribution elements such as impacted accounts, revenue at risk, the hypothesis for expected impact, and IDs/links to downstream work (e.g., related tickets, CRM records, support cases). The intent is to make “why this matters” explicit at the moment an Issue is created or triaged.\n\nThe primary impact is improved decision quality during prioritization and planning. With comparable evidence captured across Issues, product and engineering can more reliably assess severity, customer exposure, and business risk, and avoid repeatedly re-litigating context in review meetings. This reduces time spent chasing details from Support/CS/Sales and increases confidence that the right work is being staffed and sequenced.\n\nA second impact is auditability and long-term clarity. Because the attribution evidence lives on the Issue and remains stable over time, we preserve a historical record of what was believed and what data supported it at the time of the decision. This creates a consistent source of truth for future retrospectives, leadership questions, and cross-functional alignment when attribution is debated.\n\nFinally, this establishes a foundation for reporting and analytics without requiring heavy process changes upfront. Once the fields exist and are used consistently, we can aggregate and analyze impact evidence across the backlog (e.g., revenue at risk trends, top impacted accounts, linkage to downstream work completion) and iterate toward more automated data ingestion from CRM/support systems over time.",
      "link": "https://www.onyx.app/30166"
    }
  ],
  "primary_owners": [
    "michael_anderson@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}