{
  "id": "59d05d4e650d4e81a0f9da131d577bfe",
  "semantic_identifier": "Impact--Add segment/ICP score breakdown to priority explanation (API + UI).docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-05-25",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Add segment/ICP score breakdown to priority explanation (API + UI).docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds a transparent segment/ICP score breakdown to our priority explanation so teams can see exactly how customer context influenced a ranked Issue or Theme. Today, priority scores incorporate segment/ICP signals, but the “why” is not fully inspectable—making it harder for Product and Support to confidently explain rankings, validate assumptions, or spot misconfigurations.\n\nOn the backend, we will extend the priority scoring output to include the segment/ICP inputs used, the weight applied, and the computed delta contribution to the final score. This includes explicitly representing neutral/fallback cases (e.g., when segment data is missing or no ICP mapping applies) so the explanation is complete and does not imply hidden logic. The breakdown will be exposed via the scoring API to support internal consumers and future integrations.\n\nOn the frontend, we will render this breakdown in the Issue/Theme priority explanation panel, aligned to the rest of the score explanation so it’s easy to verify at a glance. This will reduce time spent triaging “why is this ranked higher?” questions, improve trust in the scoring system, and enable faster iteration on segment/ICP weighting because the impact is visible per item.\n\nFinally, we will persist the segment/ICP breakdown in the score audit trail to make historical scores defensible and debuggable. This ensures we can reconstruct what inputs and weights produced a score at the time it was calculated, which is critical for post-hoc analysis, customer escalations, and diagnosing changes after configuration updates.",
      "link": "https://www.onyx.app/24304"
    }
  ],
  "primary_owners": [
    "kenji_watanabe@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}