{
  "id": "1416da83a550459782a5bffd89b97a0d",
  "semantic_identifier": "Impact--Apply Simple Mode progressive disclosure across Alerts/Templates/Models settings (post-onboarding).docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2026-01-11",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Apply Simple Mode progressive disclosure across Alerts/Templates/Models settings (post-onboarding).docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature extends **Simple Mode** beyond onboarding by applying **progressive disclosure** to the core configuration areas: **Alerts, Templates, and Models**. Today, even after a workspace selects Simple Mode, these settings pages still present the full set of advanced controls, which can overwhelm smaller teams and undermine the intent of Simple Mode as a guided, lightweight experience.\n\nWith this change, Simple Mode workspaces will see only the **core, recommended settings** by default on these pages, while less common or expert-level controls will be grouped under an explicit **“Advanced settings”** section. This reduces cognitive load, makes the “happy path” clearer, and increases the likelihood that teams complete initial configuration successfully without feeling they need to understand every option up front.\n\nThe mode must be **consistently enforced** across navigation and refresh so that users don’t unexpectedly fall back into the advanced UI. This also strengthens the product contract: selecting Simple Mode isn’t a one-time onboarding preference—it meaningfully shapes the ongoing configuration experience.\n\nCritically, if a workspace later switches to **Advanced Mode**, all existing configuration should be **revealed, not reset**. This preserves trust and prevents accidental loss of prior setup, while allowing teams to “graduate” naturally as their needs mature—supporting a smooth lifecycle from small team adoption to more sophisticated use.",
      "link": "https://www.onyx.app/76287"
    }
  ],
  "primary_owners": [
    "kenji_watanabe@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}