{
  "id": "92bf140a1c754d78a6b69e137e732414",
  "semantic_identifier": "Impact--Issue prioritization v2: Backend support for saved scoring profiles (CRUD + apply).docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-06-22",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Issue prioritization v2: Backend support for saved scoring profiles (CRUD + apply).docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds backend support for saved “scoring profiles” that let an organization define how issue priority is calculated across multiple dimensions (e.g., Support SLA risk, Product impact, Sales deal blockers). Instead of relying on a single fixed aggregation, teams can store named profiles that capture per-dimension weights and aggregation settings, enabling consistent, repeatable prioritization logic across the product.\n\nWe’ll introduce APIs and persistence to CRUD scoring profiles at the org scope, with an optional user-default preference so individuals or teams can standardize on a preferred model without reselecting it each time. Listing and selecting profiles becomes the foundation for UI and workflow improvements (e.g., switching between “Support-first” vs “Revenue-risk” views) while keeping the source of truth in the backend.\n\nWhen computing an issue’s aggregated score, the backend will apply the selected profile’s weights and aggregation settings to produce the final score. This centralizes scoring logic, reduces inconsistencies across clients, and makes it possible to audit or evolve prioritization models without changing the underlying issue data.\n\nTo avoid disrupting existing behavior, we’ll ensure backward compatibility by providing a default profile that matches today’s single-score calculation when no explicit profile is selected. This allows gradual rollout: existing customers see no change by default, while new functionality is available for teams ready to adopt multi-profile scoring.",
      "link": "https://www.onyx.app/54160"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}