{
  "id": "60da5aedd73e4ca683f0f3ae1450900d",
  "semantic_identifier": "Impact--Enforce ownership checks on tag/priority updates and route non-owner edits to approval.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-06-15",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Enforce ownership checks on tag/priority updates and route non-owner edits to approval.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds backend enforcement to ensure tag and priority changes can only be applied immediately by the current owner of those fields (a specific user or team). Today, updates coming from the UI, API, or integrations can overwrite these values regardless of ownership, which can lead to inconsistent workflows and confusion about “who controls” prioritization and categorization.\n\nWith this change, any non-owner attempt to modify tags or priority will no longer overwrite the current value. Instead, the system will create a pending change request and return a structured response indicating that approval is required. This makes behavior consistent across all entry points (product UI, public API, and third‑party integrations), reducing accidental or automated changes that bypass intended governance.\n\nWe will also record richer metadata for every attempted non-owner update: the requester identity, the proposed new value, and the source channel (UI/API/integration). This enables later work to surface pending requests in the UI, support an approvals queue, and provide clear audit history for compliance and operational debugging.\n\nImpact-wise, owners gain stronger control and trust in tag/priority fidelity, while non-owners still have a clear mechanism to propose edits without being blocked. Integrations and API clients may need to handle the new “approval required” response and adapt from assuming immediate writes to supporting an asynchronous approval flow, improving overall predictability and accountability of these critical fields.",
      "link": "https://www.onyx.app/73753"
    }
  ],
  "primary_owners": [
    "kenji_watanabe@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}