{
  "id": "cb0edcc6dce14d8985e7fb32b49441c4",
  "semantic_identifier": "Impact--Add segment/ICP context inputs to priority scoring pipeline.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-05-05",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Add segment/ICP context inputs to priority scoring pipeline.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds durable customer context to our priority scoring pipeline by extending the issue (and aggregated theme) data model to include customer segment and ICP fit attributes. Instead of treating segment/ICP as ephemeral metadata, we will ingest and persist these fields alongside each scored object so the scoring system has consistent, first-class inputs.\n\nBy sourcing segment/ICP from both CRM and Customer_Analyzer—and defining explicit fallback and conflict-resolution rules—we reduce ambiguity and improve data completeness. When data is missing or contradictory, the pipeline will produce a deterministic outcome (and can flag uncertainty), ensuring priority outcomes are not dependent on ad hoc lookups or inconsistent source-of-truth assumptions.\n\nPersisting segment/ICP in the scoring store materially improves reliability and performance. Downstream scoring jobs and the UI can reference these attributes directly without re-fetching external systems on every recalculation, lowering latency, reducing integration fragility, and making priority results more reproducible over time.\n\nThe impact is more actionable prioritization: teams can better differentiate issues that affect strategic ICP accounts or high-value segments, and roll that context up at the theme level for portfolio decisions. This also unlocks clearer reporting and filtering by segment/ICP, enabling product and GTM stakeholders to align on what we’re prioritizing and why.",
      "link": "https://www.onyx.app/17350"
    }
  ],
  "primary_owners": [
    "kenji_watanabe@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}