{
  "id": "1ffdc48e4f284b9c9d98e5b6958f6856",
  "semantic_identifier": "Impact--Introduce deal-dynamics gating/penalty to forecasting and best-next-action scoring.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-09-19",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Introduce deal-dynamics gating/penalty to forecasting and best-next-action scoring.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature introduces explicit “deal-dynamics” risk gating into our scoring pipeline so that recommendations and forecasts reflect not just account fit, but whether the deal is realistically winnable right now. When negative deal dynamics are detected—e.g., late procurement involvement, strong competition, or low internal alignment—we will down-weight or cap the resulting score, preventing high-fit accounts from being over-prioritized in the presence of clear execution risk.\n\nProduct impact is improved prioritization quality: reps and managers will see best-next-actions that are less likely to waste time on deals that look good on paper but are currently blocked or slipping. Forecasting will also become more conservative and credible, reducing inflated scores driven primarily by fit signals and aligning projected outcomes more closely with actual deal health.\n\nOperationally, we’ll implement a configurable penalty/cap mechanism that defines a maximum score a given fit tier can achieve when one or more deal-dynamics risk signals are triggered. This allows us to tune behavior per segment or risk type (e.g., mild penalty for competition vs. hard gate for “no champion”) without redesigning the model each time.\n\nFinally, we’ll apply the same logic consistently across both forecasting scores and best-next-action ranking outputs to avoid mismatched guidance (e.g., a deal appearing “likely to close” but not showing up in recommended actions, or vice versa). This consistency should increase user trust, reduce confusion, and make outcomes easier to explain and iterate on as we calibrate thresholds.",
      "link": "https://www.onyx.app/69421"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}