{
  "id": "a8ee69b6edb342b1895ba453ea1b770b",
  "semantic_identifier": "Impact--Fix confidence bands not refreshing/aligning with selected forecast scenario.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-10-18",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Fix confidence bands not refreshing/aligning with selected forecast scenario.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This change fixes an analytics correctness issue in forecast visualizations where confidence bands (e.g., P10/P50/P90) can become stale or misaligned after a user switches forecast scenarios or adjusts the forecast horizon. Today, the uncertainty range shown may not reflect the active scenario’s inputs, which can lead to inconsistent interpretation of risk and expected outcomes versus the displayed totals and segment breakdowns.\n\nFrom a user-impact perspective, this improves trust and decision quality: scenario comparisons are only meaningful if the central forecast and its uncertainty bounds update together. Users evaluating downside risk, planning buffers, or communicating ranges to stakeholders will see bands that consistently match the selected scenario and time window, reducing confusion and rework.\n\nOn the product experience side, the UI will re-render confidence bands whenever the active scenario or horizon changes, using recalculated band values derived from the same source inputs driving totals and breakdowns. This ensures visual alignment across the chart elements and eliminates cases where bands appear “stuck” on a prior scenario selection.\n\nTo prevent regressions, we’ll add an automated test that exercises the core failure path (switch scenario + change horizon) and asserts that confidence bands update in sync with the rest of the forecast. Success is measured by consistent band refresh behavior across scenario toggles and horizon edits, with no mismatches between displayed bands and underlying projection outputs.",
      "link": "https://www.onyx.app/78650"
    }
  ],
  "primary_owners": [
    "kenji_watanabe@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}