{
  "id": "ff60d110dbd44998837e434f9633585c",
  "semantic_identifier": "Impact--Add field-level ownership metadata for tags and priority changes.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-09-16",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Add field-level ownership metadata for tags and priority changes.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature adds field-level ownership metadata for issue tags and priority so we can clearly attribute who “owns” the current state of these fields. For each issue, we will record the current owner (team or user) for tags and for priority, along with the last editor and the timestamp of the last change. This closes a key visibility gap today where tag/priority state exists but provenance and accountability are unclear.\n\nOn every tag or priority update, the backend will persist attribution details: the actor identity (user, bot, or system actor as applicable) and the source of the change (UI, API, or integration). The system will also expose this metadata via our APIs so downstream consumers (product surfaces, admin tools, and workflow engines) can reliably display and reason about it. Importantly, this work is additive: it does not change current permissions or behavior.\n\nThe primary impact is enabling auditability and operational trust. Teams will be able to answer “who changed priority, when, and from where?” and “who is responsible for the current tagging state?” This reduces time spent investigating unexpected changes, supports compliance and post-incident reviews, and makes integrations and automation more transparent when they modify fields.\n\nThis metadata is foundational for upcoming enforcement features—specifically ownership rules and approval flows for tag/priority changes. By introducing a consistent attribution and ownership model now, we de-risk future rollout: subsequent tickets can leverage the stored owner/editor/source data to gate changes and request approvals without needing to retrofit historical context or introduce breaking changes later.",
      "link": "https://www.onyx.app/87139"
    }
  ],
  "primary_owners": [
    "michael_anderson@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}