{
  "id": "5081a6b026714d8ab6a88425e33c09d8",
  "semantic_identifier": "Impact--Enforce published-only positioning usage in Sales_Accelerator with clear UX when a version is unavailable.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-08-14",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Enforce published-only positioning usage in Sales_Accelerator with clear UX when a version is unavailable.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This change ensures Sales_Accelerator can only generate and send messaging using Customer_Analyzer positioning block versions that are explicitly published/approved. By adding server-side validation, we eliminate the possibility of sending draft, unversioned, or otherwise non-approved content—tightening governance and reducing brand/compliance risk in outbound customer communication.\n\nWhen a user has pinned a positioning version that later becomes unavailable (missing, unpublished, or not approved), the system will return a structured, actionable error instead of silently substituting different content. The UI will render this as a blocking state that clearly explains why messaging cannot be generated, and it will treat the last known pinned version as the only allowable fallback—preventing unintended content drift.\n\nWe will update the messaging and recommendation experiences to surface which positioning version is in use (or pinned) so users have transparency and confidence in the output. If the pinned version is unavailable, the UI will provide a clear call to action to request Marketing to publish a new approved variant, aligning the resolution path with the right owner rather than forcing Sales to troubleshoot.\n\nOverall impact: higher trust in generated messaging, reduced risk of off-brand or unapproved copy being sent, and fewer confusing “why did my content change?” moments. This also improves cross-team workflows by making dependency on Marketing publishing explicit, with a clear and consistent UX that prevents sending until approved content is available.",
      "link": "https://www.onyx.app/75080"
    }
  ],
  "primary_owners": [
    "kenji_watanabe@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}