{
  "id": "4f316cd951214700ba425460f5760949",
  "semantic_identifier": "Impact--Surface recommendation conflicts in Segment Positioning UI.docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-09-09",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Surface recommendation conflicts in Segment Positioning UI.docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature improves trust and usability in the Segment Positioning UI by making recommendation conflicts visible at the point of decision. Today, users can apply recommendations without realizing they contradict other segments’ positioning, which leads to inconsistent messaging, rework, and lower confidence in the recommendations system.\n\nWe will update the Segment Positioning view to consume conflict metadata returned by the API and visually flag any recommendation categories that are in conflict. The default state remains lightweight: a compact conflict indicator appears alongside the affected recommendation category so users can quickly scan for issues without added clutter.\n\nFor deeper context, users can drill in from the indicator to a panel that lists the specific conflicting segments and the conflicting statements. This enables fast resolution by showing exactly what is in tension, reducing back-and-forth and helping teams converge on coherent positioning across segments.\n\nThe UI will be resilient to missing or empty conflict metadata (e.g., feature disabled, older workspaces) by falling back to current behavior with no disruption to existing recommendation rendering. This ensures backward compatibility and allows controlled rollout without introducing regressions in the core recommendations experience.",
      "link": "https://www.onyx.app/73776"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}