{
  "id": "6bdd6b0c6dec46b7b3044f0deebdedc1",
  "semantic_identifier": "Impact--Implement randomized holdout/control assignment for recommendations (with logging).docx",
  "title": null,
  "source": "google_doc",
  "doc_updated_at": "2025-07-28",
  "metadata": {
    "owner_names": ""
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "My Drive"
      ],
      "drive_id": null,
      "file_name": "Impact--Implement randomized holdout/control assignment for recommendations (with logging).docx",
      "mime_type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document"
    }
  },
  "sections": [
    {
      "text": "This feature introduces a deterministic, randomized holdout/control assignment for recommendations so we can measure true incremental impact. For each recommendation type and model version, we will bucket a stable unit (e.g., rep, account, or opportunity) into treatment or control and, when in control, suppress the recommendation where applicable. Because bucketing is deterministic and stable over time, users won’t “flip” between experiences, which reduces noise and improves trust in experiment results.\n\nThe primary product impact is measurement quality: we’ll be able to compare downstream outcomes (e.g., adoption, conversions, revenue, time-to-action) against a real baseline rather than relying on proxy comparisons or pre/post analysis. This enables credible model and UX iteration, clearer ROI narratives, and faster decisions about which recommendation variants to ship, tune, or retire—especially as we introduce multiple recommendation types and frequent model_version updates.\n\nWe will also emit a dedicated analytics event capturing assignment details (bucket, unit_id, recommendation_type, model_version, timestamp). This creates an auditable source of truth for experiment analysis, joins cleanly to outcome events, and allows slicing by surface, cohort, and model version. Logging assignment at the moment of exposure ensures we can attribute outcomes correctly and avoid bias from missing or delayed events.\n\nFinally, configurability per surface supports gradual rollout and risk management. We can ramp treatment percentage over time, run targeted holdouts on specific UI surfaces, and validate that suppression logic doesn’t degrade user workflows. The net result is safer launches, clearer performance readouts, and a standardized experimentation foundation for all recommendations going forward.",
      "link": "https://www.onyx.app/80412"
    }
  ],
  "primary_owners": [
    "sofia_ramirez@netherite-extraction.onyx.app"
  ],
  "secondary_owners": []
}