{
  "id": "FIREFLIES_1410304",
  "semantic_identifier": "1410304 - Crimson Meadow Brewing - sales_call - Discussion with Ryan Dean",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2026-03-05 00:00:00",
  "metadata": {
    "meeting_date": "2026-03-05 00:00:00",
    "duration_min": "30"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2026-03"
      ],
      "year_month": "2026-03",
      "meeting_title": "1410304 - Crimson Meadow Brewing - sales_call - Discussion with Ryan Dean",
      "organizer_email": "sneha_reddy@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Sneha Reddy: Hi Ryan—good to see you again. Last time you mentioned you were interested in getting crisper on who your best customers are and using that to guide product planning. Did I capture that right, and anything new since we last spoke?",
      "link": "https://www.onyx.app/3893733-1"
    },
    {
      "text": "Ryan Dean: Hey Sneha, yeah that’s right. We’ve been debating internally which customer types to prioritize this quarter, and it’s been… messy. I’m hoping we can get to something more concrete.",
      "link": "https://www.onyx.app/3893733-2"
    },
    {
      "text": "Sneha Reddy: Totally. For today, I’d like to focus on one piece of Customer_Analyzer that maps directly to that: **fit estimation**. The goal would be to walk out with a clear path to define fit drivers, produce segment-level fit scores, and use those insights to settle the roadmap debate. Does that sound like the right scope?",
      "link": "https://www.onyx.app/3893733-3"
    },
    {
      "text": "Ryan Dean: Yes, that’s the part that caught my attention. But I’m also worried it turns into another dashboard people argue about. Our Sales and Marketing folks already disagree on what “good customer” means.",
      "link": "https://www.onyx.app/3893733-4"
    },
    {
      "text": "Sneha Reddy: That’s a common one, and we’ve built the workflow to reduce exactly that kind of opinion-driven debate. Fit estimation is explicit about *why* a segment scores the way it does. Instead of one number everyone can poke holes in, you get a **0–100 fit score plus a driver breakdown**—like “problem severity,” “time-to-value,” “support burden,” “usage patterns,” and even “churn risk signals.” So if Sales says “this segment is great,” we can show whether that’s backed by retention/expansion outcomes or just top-of-funnel volume.",
      "link": "https://www.onyx.app/3893733-5"
    },
    {
      "text": "Ryan Dean: Okay. But for us, the data is scattered. We’ve got some stuff in our CRM, some onboarding survey responses, and support tickets in another system. How hard is it to pull that together?",
      "link": "https://www.onyx.app/3893733-6"
    },
    {
      "text": "Sneha Reddy: Practical question. Most teams start with what’s already easiest: **CRM fields** plus one or two additional signal sources. For example, for Crimson Meadow Brewing, you could start with firmographics in the CRM and add onboarding survey answers that indicate the “problem severity” and expected value. If you want, we can phase in product usage events and support tickets later—so you’re not blocked upfront.",
      "link": "https://www.onyx.app/3893733-7"
    },
    {
      "text": "Ryan Dean: That phased approach helps. What does the output actually look like? Are we talking like “all breweries under 50 employees are bad,” or something more nuanced?",
      "link": "https://www.onyx.app/3893733-8"
    },
    {
      "text": "Sneha Reddy: More nuanced. You’ll see **segment comparisons**—SMB vs mid-market, or “taproom-first operations” vs “distributed operations,” whatever segments you define. Each segment shows: (1) fit score, (2) which drivers are pushing it up or down, and (3) the observed outcomes you care about—like retention, expansion, or time-to-value. Then the system produces a **recommended ICP profile** based on what’s actually working, not just what’s loudest internally.",
      "link": "https://www.onyx.app/3893733-9"
    },
    {
      "text": "Ryan Dean: That last part is appealing. We’ve got stakeholders who will pull in different directions. Marketing wants a broad story; Sales wants whoever will sign fastest; Product wants fewer edge cases.",
      "link": "https://www.onyx.app/3893733-10"
    },
    {
      "text": "Sneha Reddy: Right—and that’s where the driver framework acts as a neutral language. Instead of arguing “we should target X,” you align on “we should prioritize segments with high willingness to pay, fast time-to-value, and low support burden,” for example. Then Customer_Analyzer shows which segments meet that. It gives Product a roadmap lens, Sales a qualification lens, and Marketing a targeting lens that’s grounded in outcomes.",
      "link": "https://www.onyx.app/3893733-11"
    },
    {
      "text": "Ryan Dean: I like that in theory. But what if we choose the wrong drivers? Or the drivers get gamed—like Sales only logs “good fit” notes after the deal closes.",
      "link": "https://www.onyx.app/3893733-12"
    },
    {
      "text": "Sneha Reddy: Great point. Two things. First, we typically start with a short, forced-ranked list—say 6–8 drivers max—so it doesn’t become “everything matters.” Second, we prefer **behavioral and outcome-linked signals** where possible: adoption/usage patterns, support burden, renewal/expansion. Even if some fields are subjective, the model will show when they don’t correlate with outcomes. In other words, if “Sales notes: great fit” doesn’t predict retention, it won’t carry weight in the fit breakdown.",
      "link": "https://www.onyx.app/3893733-13"
    },
    {
      "text": "Ryan Dean: That would be helpful. Our churn has been painful in one segment, and I suspect we’re over-selling to them.",
      "link": "https://www.onyx.app/3893733-14"
    },
    {
      "text": "Sneha Reddy: Exactly the kind of thing fit estimation surfaces fast. You’ll see a segment that might convert quickly but scores low because the **churn risk signals** and **support burden** are high. That gives you ammunition to adjust targeting and also informs product planning: “Do we invest to make that segment successful, or do we stop chasing it?”",
      "link": "https://www.onyx.app/3893733-15"
    },
    {
      "text": "Ryan Dean: That’s basically our roadmap argument right now. Some folks want to build features for the high-support segment; others want to double down on the segment that’s already happy.",
      "link": "https://www.onyx.app/3893733-16"
    },
    {
      "text": "Sneha Reddy: Then here’s a clean way to use this for product planning: identify **high-fit customers with unmet needs**. If a segment has high fit overall—good retention, strong adoption—but there’s a consistent unmet need showing up in onboarding surveys and support tickets, that’s a strong roadmap bet. It’s not “build whatever is requested,” it’s “build what high-fit customers consistently need to expand.”",
      "link": "https://www.onyx.app/3893733-17"
    },
    {
      "text": "Ryan Dean: That framing I can bring to the team. What would you need from me to set up a pilot?",
      "link": "https://www.onyx.app/3893733-18"
    },
    {
      "text": "Sneha Reddy: For a fast pilot, I’d suggest: CRM export with key fields (industry, size, deal stage, ARR), your onboarding survey data, and 6–12 months of retention/renewal outcomes. Then we run a first pass: define segments together, pick the initial fit drivers, and generate the first fit score + breakdown. Usually we can get a first readout within two weeks.",
      "link": "https://www.onyx.app/3893733-19"
    },
    {
      "text": "Ryan Dean: Two weeks is reasonable. My concern is adoption—if Marketing or Sales feels like Product is forcing this, they’ll resist. Or vice versa.",
      "link": "https://www.onyx.app/3893733-20"
    },
    {
      "text": "Sneha Reddy: Totally. Since you called out stakeholder conflict as a risk, I’d propose we include a lightweight alignment step: a 45-minute workshop with you plus one person each from Sales and Marketing to agree on the initial drivers and what “success” means. The output is shared, and the driver definitions are transparent—so it feels like a joint model, not a Product-only tool.",
      "link": "https://www.onyx.app/3893733-21"
    },
    {
      "text": "Ryan Dean: That would help. And if we do that, what’s the decision point? Like, when would you ask us to buy?",
      "link": "https://www.onyx.app/3893733-22"
    },
    {
      "text": "Sneha Reddy: Fair. I’d set a clear checkpoint after the readout: if the fit model identifies (1) a recommended ICP we all agree matches outcomes, (2) at least two segments we can deprioritize confidently, and (3) one high-fit unmet-need theme that informs the roadmap—then we move into the full subscription. If we can’t get that clarity, we pause and reassess.",
      "link": "https://www.onyx.app/3893733-23"
    },
    {
      "text": "Ryan Dean: That’s a good bar. Pricing aside for a second, I’m comfortable moving forward if we can get those three things. What do you need from me this week?",
      "link": "https://www.onyx.app/3893733-24"
    },
    {
      "text": "Sneha Reddy: This week: confirm the pilot stakeholders (names for Sales and Marketing), and I’ll send a simple data checklist for the CRM + onboarding survey. If you can introduce me to whoever owns the support ticket system, we can decide whether to include it in phase one or phase two.",
      "link": "https://www.onyx.app/3893733-25"
    },
    {
      "text": "Ryan Dean: I can do that. I’ll loop in our Sales lead and Marketing manager today, and I’ll connect you with the person who manages support tooling.",
      "link": "https://www.onyx.app/3893733-26"
    },
    {
      "text": "Sneha Reddy: Perfect. I’ll send a calendar hold for the driver workshop early next week and a one-page outline of the pilot plan and success criteria so you can share it internally. If all goes smoothly, we can target the readout two weeks after data access.",
      "link": "https://www.onyx.app/3893733-27"
    },
    {
      "text": "Ryan Dean: Sounds good, Sneha. This feels actionable—and honestly, it might be the first time we’ve had a neutral way to settle these ICP arguments.",
      "link": "https://www.onyx.app/3893733-28"
    },
    {
      "text": "Sneha Reddy: That’s the goal. I’ll follow up with the checklist and workshop agenda in the next hour. Thanks, Ryan—excited to get you to a clear ICP and roadmap direction.",
      "link": "https://www.onyx.app/3893733-29"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "sneha_reddy@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "ryan_dean@crimson_meadow_brewing.onyx.app"
    }
  ]
}