{
  "id": "FIREFLIES_1992024",
  "semantic_identifier": "1992024 - Novafathom Analytics - sales_call - Discussion with Isabel Patel",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2026-03-10 00:00:00",
  "metadata": {
    "meeting_date": "2026-03-10 00:00:00",
    "duration_min": "41"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2026-03"
      ],
      "year_month": "2026-03",
      "meeting_title": "1992024 - Novafathom Analytics - sales_call - Discussion with Isabel Patel",
      "organizer_email": "mina_park@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Mina Park: Hi Isabel, good to see you again. Last time you mentioned your AEs are spending a lot of time figuring out “what do I do next?” after discovery, and that deals tend to go quiet between meetings. I wanted to focus today on one piece of Sales_Accelerator—our follow-up recommendations—and see if it’s something you could actually roll out at Novafathom.",
      "link": "https://www.onyx.app/4557388-1"
    },
    {
      "text": "Isabel Patel: Hi Mina. Yes, that’s still a pain point. But I’ll be upfront—we’re skeptical of “next best action” tools. We’ve tried a couple, and they were either generic or created busywork.",
      "link": "https://www.onyx.app/4557388-2"
    },
    {
      "text": "Mina Park: Totally fair. Let me anchor it in one concrete workflow: after a discovery call, Sales_Accelerator can draft a recap email, pull in two proof points from your approved positioning library, and then generate a mutual action plan with due dates and the stakeholders you still need to engage. It’s meant to reduce the “blank page” moment and prevent stalls.",
      "link": "https://www.onyx.app/4557388-3"
    },
    {
      "text": "Isabel Patel: When you say “pull proof points,” that’s from Customer_Analyzer, right? Because our messaging is really segmented, and we change it often.",
      "link": "https://www.onyx.app/4557388-4"
    },
    {
      "text": "Mina Park: Exactly—Sales_Accelerator sits on top of your CRM and consumes Customer_Analyzer fit scores and positioning blocks. So it’s not inventing messaging from scratch; it’s using what your team already approved in Customer_Analyzer. If the opportunity is mapped to, say, a specific segment, it will pick the proof points for that segment.",
      "link": "https://www.onyx.app/4557388-5"
    },
    {
      "text": "Isabel Patel: That mapping part is where we’ve had trouble. Our segments in Salesforce don’t always line up with how marketing thinks about segments. And our “positioning blocks” aren’t always current—some are quarterly, some are ad hoc.",
      "link": "https://www.onyx.app/4557388-6"
    },
    {
      "text": "Mina Park: That’s one of the main risks, yes. If segment mapping is inconsistent or the positioning blocks are stale, recommendations can feel off. In practice, what we do is start with one segment where you know the messaging is solid, confirm the field mapping from CRM to Customer_Analyzer, and only then expand. The goal is to keep the recommendations explainable—your rep can see “this proof point came from this block for this segment.”",
      "link": "https://www.onyx.app/4557388-7"
    },
    {
      "text": "Isabel Patel: Even if it’s explainable, if it’s wrong even 20% of the time, reps will stop trusting it. They won’t open it again.",
      "link": "https://www.onyx.app/4557388-8"
    },
    {
      "text": "Mina Park: Agree—trust is everything. That’s why the feature is designed to be more “guided” than “auto.” For example, on the recap email: it generates a draft with placeholders for what was agreed, suggests proof points, and then the rep edits before sending. Same for objections—it’ll propose a response aligned to your positioning, but it’s not sending anything without the rep.",
      "link": "https://www.onyx.app/4557388-9"
    },
    {
      "text": "Isabel Patel: Okay, but editing still takes time. We’ve already got templates in Outreach and sequences our team uses. I’m worried this just adds another layer.",
      "link": "https://www.onyx.app/4557388-10"
    },
    {
      "text": "Mina Park: Good question. We’re not trying to replace Outreach sequences. The part we’re strong at is the decisioning: based on stage, who’s engaged, whether there’s a mutual plan, and recent activity, we recommend what to do next—like “you had a meeting, no follow-up in 24 hours—send recap + propose next meeting + add MAP.” Or “only one contact has responded—multi-thread into procurement and the evaluator.” Then we can point to your existing sequence or suggest a cadence. The rep can execute in the CRM or via extension so it’s not another tab.",
      "link": "https://www.onyx.app/4557388-11"
    },
    {
      "text": "Isabel Patel: Our reps already get a lot of alerts in Salesforce. If this is “deal risk” warnings plus tasks plus suggestions, I’m concerned it becomes noise.",
      "link": "https://www.onyx.app/4557388-12"
    },
    {
      "text": "Mina Park: That’s a real concern. On our side, the way we keep it from being noisy is by limiting it to a lightweight task queue and only triggering when there’s a clear gap—like a meeting happened and there’s no follow-up, or the mutual action plan is missing key stakeholders. It’s less “notification spam” and more “here are your top five actions today tied to outcomes.”",
      "link": "https://www.onyx.app/4557388-13"
    },
    {
      "text": "Isabel Patel: You’re describing ideal behavior. But our org isn’t disciplined on mutual action plans. Some AEs love them, some won’t touch them. If the system depends on mutual plan completeness, won’t the recommendations just keep nagging?",
      "link": "https://www.onyx.app/4557388-14"
    },
    {
      "text": "Mina Park: It will surface the gap, yes, because mutual plan completeness is a predictor of slippage. But you can tune it: for your pilot, you could define a minimal MAP—like next meeting date, decision process, and at least two stakeholders. The recommendation becomes “fill these three items,” not a ten-step checklist. The idea is to standardize a few high-performing behaviors without forcing a full methodology overhaul.",
      "link": "https://www.onyx.app/4557388-15"
    },
    {
      "text": "Isabel Patel: I’m still trying to picture adoption. We’re not going to retrain the whole team for a tool that might or might not fit our process.",
      "link": "https://www.onyx.app/4557388-16"
    },
    {
      "text": "Mina Park: That’s why I’d propose a small pilot: pick 6–8 AEs in one segment, focus on one motion—post-discovery follow-up—and measure two things over 30 days: follow-up sent within 24 hours, and progression from discovery to next meeting / technical validation. If we don’t move those, you shouldn’t buy it.",
      "link": "https://www.onyx.app/4557388-17"
    },
    {
      "text": "Isabel Patel: Measurement is fine, but implementation is the issue. Last time we integrated something “on top of Salesforce,” it turned into a Sales Ops project. We don’t have bandwidth this quarter.",
      "link": "https://www.onyx.app/4557388-18"
    },
    {
      "text": "Mina Park: Understood. The integration is relatively light because we’re not rebuilding ICP or duplicating objects—we’re consuming Customer_Analyzer outputs and reading opportunity activity. That said, we do need your segment mapping to be consistent. If your Salesforce fields are messy, it becomes work. Do you know who owns that mapping today?",
      "link": "https://www.onyx.app/4557388-19"
    },
    {
      "text": "Isabel Patel: Sales Ops owns it, but they’re in the middle of a territory redesign and pipeline cleanup. And honestly, marketing updates the segments without telling sales half the time. That’s part of why those positioning blocks drift.",
      "link": "https://www.onyx.app/4557388-20"
    },
    {
      "text": "Mina Park: If marketing changes segments frequently without a shared taxonomy, that will definitely impact recommendation quality. We can put guardrails in place—like only enabling recommendations for “Segment A” where the mapping is stable—but I don’t want to pretend we can solve governance for you.",
      "link": "https://www.onyx.app/4557388-21"
    },
    {
      "text": "Isabel Patel: Right. And governance is exactly the problem. The tool sounds like it assumes our inputs are clean. They aren’t.",
      "link": "https://www.onyx.app/4557388-22"
    },
    {
      "text": "Mina Park: It does assume a baseline level of consistency, yes. Let me ask this: if we limited scope to one stable segment and only used two positioning blocks you already trust, would that be realistic to get done without a big project?",
      "link": "https://www.onyx.app/4557388-23"
    },
    {
      "text": "Isabel Patel: Maybe, but I’d still need Sales Ops to prioritize it, and they won’t. And I’m also not convinced our reps want another “task queue.” They’re already saying Outreach, Gong, Salesforce, and our own dashboards are too much.",
      "link": "https://www.onyx.app/4557388-24"
    },
    {
      "text": "Mina Park: That’s helpful. If tool sprawl is already a sensitive issue, we’d need to be very clear that Sales_Accelerator replaces something—like manual follow-up tracking or manager-created “deal inspection” spreadsheets—instead of adding.",
      "link": "https://www.onyx.app/4557388-25"
    },
    {
      "text": "Isabel Patel: We do have manager spreadsheets, yes, but managers like them because they control them. They don’t like relying on a system that might be wrong.",
      "link": "https://www.onyx.app/4557388-26"
    },
    {
      "text": "Mina Park: Makes sense. The place where managers typically see value is consistency—every rep gets prompted to do the basics, and the manager can coach on the same signals. But again, if your underlying segment and positioning data isn’t reliable, you’ll get pushback.",
      "link": "https://www.onyx.app/4557388-27"
    },
    {
      "text": "Isabel Patel: Exactly. And to be blunt, I don’t think we can commit to keeping Customer_Analyzer positioning blocks current. It’s not that we don’t want to—it’s that no one owns it end-to-end.",
      "link": "https://www.onyx.app/4557388-28"
    },
    {
      "text": "Mina Park: If there isn’t clear ownership for keeping those blocks current, then Sales_Accelerator’s recommendations will degrade over time. We can start with a static set for a pilot, but long-term it’s not a “set it and forget it” system.",
      "link": "https://www.onyx.app/4557388-29"
    },
    {
      "text": "Isabel Patel: Then I think we’re not ready. I like the concept, but our internal foundations aren’t there. I’d rather not run a pilot that fails because of our own messiness.",
      "link": "https://www.onyx.app/4557388-30"
    },
    {
      "text": "Mina Park: I appreciate the honesty. Would it be helpful if I sent a short readiness checklist—like “these three fields need to be consistent” and “someone owns positioning updates monthly”—so you can evaluate timing internally? Then we could revisit when Sales Ops bandwidth opens up.",
      "link": "https://www.onyx.app/4557388-31"
    },
    {
      "text": "Isabel Patel: Yes, that would be useful. If you can keep it concrete and not a 20-page deck, I’ll share it with Sales Ops and marketing.",
      "link": "https://www.onyx.app/4557388-32"
    },
    {
      "text": "Mina Park: Absolutely. I’ll send a one-pager with the minimum data requirements for follow-up recommendations and a suggested lightweight ownership model. If it turns out you can stabilize one segment after the territory work, we can re-engage.",
      "link": "https://www.onyx.app/4557388-33"
    },
    {
      "text": "Isabel Patel: Sounds good. Let’s do that, and we’ll circle back in a couple months.",
      "link": "https://www.onyx.app/4557388-34"
    },
    {
      "text": "Mina Park: Perfect. Thanks, Isabel—I’ll follow up later today with that checklist and a sample of what the recap email + mutual action plan output looks like, so you can see it in context.",
      "link": "https://www.onyx.app/4557388-35"
    },
    {
      "text": "Isabel Patel: Great. Talk soon.",
      "link": "https://www.onyx.app/4557388-36"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mina_park@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "isabel_patel@novafathom_analytics.onyx.app"
    }
  ]
}