{
  "id": "FIREFLIES_3239543",
  "semantic_identifier": "3239543 - Wisp & Willow Florals - buy - Discussion with Oscar Fuentes",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2026-03-25 00:00:00",
  "metadata": {
    "meeting_date": "2026-03-25 00:00:00",
    "duration_min": "25"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2026-03"
      ],
      "year_month": "2026-03",
      "meeting_title": "3239543 - Wisp & Willow Florals - buy - Discussion with Oscar Fuentes",
      "organizer_email": "megan_foster@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Megan Foster: Hi Oscar, good to see you again. Since this is our third call, I’d love to use today to confirm the rollout plan and get you comfortable moving forward with Issue_Tracker—does that still match what you want to accomplish?",
      "link": "https://www.onyx.app/5412973-1"
    },
    {
      "text": "Oscar Fuentes: Yeah, that’s the goal. We’ve been talking about this internally, and we’re close. I just want to make sure it’ll actually reduce the noise and not create extra work for engineering.",
      "link": "https://www.onyx.app/5412973-2"
    },
    {
      "text": "Megan Foster: Totally fair. Let me anchor on two things you told me last time: first, support is spending too much time relaying “maybe duplicates” into Jira; and second, engineering doesn’t trust the signal because it’s hard to tell if something’s widespread or just a one-off. The two Issue_Tracker capabilities that matter most for that are clustering into an “issue object” with evidence, and the issue prioritization score that ties impact to revenue and customer tier. Does that still reflect the core pain?",
      "link": "https://www.onyx.app/5412973-3"
    },
    {
      "text": "Oscar Fuentes: Yes. The triage is messy, and we argue about what to fix next. But my biggest concern is clustering quality. If it merges two different issues, we’ll chase the wrong thing. If it fragments, we’ll miss the real pattern.",
      "link": "https://www.onyx.app/5412973-4"
    },
    {
      "text": "Megan Foster: That’s the right concern to raise. Here’s how we handle it in practice. Issue_Tracker never hides the underlying evidence—each cluster keeps the linked source conversations from Zendesk/Intercom and any internal references. So when engineering reviews a cluster, they can inspect representative examples, platform breakdowns, and trend velocity before committing an on-call fix. That matches your engineering manager use case exactly: validate “is this real and widespread?” with concrete samples and trends.",
      "link": "https://www.onyx.app/5412973-5"
    },
    {
      "text": "Oscar Fuentes: Okay, but that still assumes the cluster is correct. How do we avoid false merges?",
      "link": "https://www.onyx.app/5412973-6"
    },
    {
      "text": "Megan Foster: Two safeguards. One is transparency: clusters show why tickets are grouped—shared patterns in language and metadata—and the “representative examples” make it obvious when something doesn’t belong. The second is workflow: your team can split or re-label a cluster, and the system learns from those corrections so it gets better over time for your domain language. Also, because Issue_Tracker sits between channels and Jira, you’re not rewriting your process—you’re standardizing the issue object and keeping it linked to source and downstream work.",
      "link": "https://www.onyx.app/5412973-7"
    },
    {
      "text": "Oscar Fuentes: Got it. And fragmentation? Like similar issues described differently by different customer segments?",
      "link": "https://www.onyx.app/5412973-8"
    },
    {
      "text": "Megan Foster: That’s where the context layer helps. When customer language varies by segment or channel, we use the customer and account context to make clustering more consistent—so “checkout error” from retail vs. “payment failure” from wholesale doesn’t necessarily become two unrelated piles. And even if it starts fragmented early on, the prioritization view will still surface the pattern because you’ll see multiple smaller clusters that share impacted tier, severity tags, and velocity. In onboarding, we typically tune a few labels and severity tags so the system matches your vocabulary fast.",
      "link": "https://www.onyx.app/5412973-9"
    },
    {
      "text": "Oscar Fuentes: Okay. Let’s talk about prioritization—because leadership is asking, “how do we know we’re fixing what matters?”",
      "link": "https://www.onyx.app/5412973-10"
    },
    {
      "text": "Megan Foster: Perfect. Issue prioritization is an explainable score. You can weight frequency and velocity, severity tags, and—this is the big one for you—customer tier/ARR and churn-risk flags. So if the same issue hits a high-value customer, it rises. And if it’s showing up in a segment that’s core to your ICP, it rises. You get different views depending on the audience: Support sees SLA risk, Product sees impact vs. effort framing, Sales sees deal blockers, and execs see revenue exposure. The point is everyone argues less because they’re debating inputs, not opinions.",
      "link": "https://www.onyx.app/5412973-11"
    },
    {
      "text": "Oscar Fuentes: We don’t have super mature severity tagging today. Does that break the model?",
      "link": "https://www.onyx.app/5412973-12"
    },
    {
      "text": "Megan Foster: Not at all. We can start simple—frequency/velocity plus tier/ARR weighting—and then layer in severity tags as you standardize them. A lot of customers start with just a handful of tags: “outage,” “data integrity,” “workflow blocker,” that sort of thing. The system is designed to be configurable; it doesn’t require perfection to be useful in week one.",
      "link": "https://www.onyx.app/5412973-13"
    },
    {
      "text": "Oscar Fuentes: Makes sense. How does this connect to Jira? We can’t have engineers living in a new tool all day.",
      "link": "https://www.onyx.app/5412973-14"
    },
    {
      "text": "Megan Foster: Understood. Issue_Tracker is not trying to replace Jira. The cluster becomes the canonical issue object—theme/root cause plus evidence plus impacted customers—and it stays linked to the Jira ticket or epic your team already uses. Engineers can continue operating in Jira while referencing the cluster for the “why this matters” context and the “how widespread is it” evidence. It reduces back-and-forth because the cluster maintains the defensible history of decisions and status across teams.",
      "link": "https://www.onyx.app/5412973-15"
    },
    {
      "text": "Oscar Fuentes: And support? They live in Zendesk.",
      "link": "https://www.onyx.app/5412973-16"
    },
    {
      "text": "Megan Foster: Same idea. Support continues in Zendesk, but Issue_Tracker continuously ingests the inbound stream, deduplicates, and groups. Support can see which themes are trending and which ones are already tied to active engineering work, so you avoid creating five Jira tickets for the same underlying problem. It also gives support a more consistent status to communicate back to customers, because the “issue object” is tied to real progress in Jira.",
      "link": "https://www.onyx.app/5412973-17"
    },
    {
      "text": "Oscar Fuentes: We also asked about sales visibility, because we’ve had a couple deals stall on unresolved bugs.",
      "link": "https://www.onyx.app/5412973-18"
    },
    {
      "text": "Megan Foster: Right—and this is where Issue_Tracker’s connection to revenue context matters. We can boost issues that are blocking late-stage opportunities by weighting from your CRM and sales signals. Practically, it means an issue tied to an active, late-stage opportunity gets elevated so it doesn’t get lost behind “noisy but low-impact” requests. Even if you don’t fully operationalize the Sales view on day one, having the exec view of revenue exposure can be huge for prioritization conversations.",
      "link": "https://www.onyx.app/5412973-19"
    },
    {
      "text": "Oscar Fuentes: Okay. Internally, the decision is basically: do we buy now and roll out to support + engineering, or do we wait a quarter. The hesitation is mostly around cluster trust and adoption.",
      "link": "https://www.onyx.app/5412973-20"
    },
    {
      "text": "Megan Foster: Let’s make it concrete. What if we start with your support channels plus Jira integration, focus on the engineering-manager workflow you described—validate whether a bug is real and widespread—and define success metrics for the first 30 days: reduction in duplicate Jira creation, faster triage time, and fewer “is this real?” debates because evidence is in one place. If clustering needs tuning, we’ll do it during onboarding with your team so it reflects Wisp & Willow’s language.",
      "link": "https://www.onyx.app/5412973-21"
    },
    {
      "text": "Oscar Fuentes: That’s reasonable. What does onboarding actually look like? I don’t want this to become a six-week project.",
      "link": "https://www.onyx.app/5412973-22"
    },
    {
      "text": "Megan Foster: It won’t. Typical path is: week one connect Zendesk/Intercom and Jira, ingest historical data so clusters have context, and set initial prioritization weights—tier/ARR, frequency/velocity, a couple severity tags if you have them. Week two is review with your engineering manager and support lead: sanity-check clusters, split/merge where needed, and lock in the views each team will use. From there it’s operational—weekly triage is faster because the system is continuously updating.",
      "link": "https://www.onyx.app/5412973-23"
    },
    {
      "text": "Oscar Fuentes: Alright. Commercially, we’re good with the pricing you sent, but procurement will ask about risk—like, “what if the clusters are wrong and people stop using it?”",
      "link": "https://www.onyx.app/5412973-24"
    },
    {
      "text": "Megan Foster: That’s fair. Two ways to reduce that risk. First, because everything is linked back to the source conversations, the system is auditable—people can verify, not just trust. Second, we’ll set a lightweight governance habit: one owner on your side who flags any false merges/fragmentation patterns, and we tune. That keeps trust high early. If we do that, adoption tends to follow because the value is immediate—less triage, clearer prioritization, faster validation for engineering.",
      "link": "https://www.onyx.app/5412973-25"
    },
    {
      "text": "Oscar Fuentes: Okay. I think we’re ready. I need to confirm with our VP today, but I’m leaning yes.",
      "link": "https://www.onyx.app/5412973-26"
    },
    {
      "text": "Megan Foster: Great. If you’re comfortable, the clean next step is: I send the order form for Issue_Tracker with the scope we discussed—support channels + Jira, plus the prioritization views—and we target kickoff next Monday. If your VP signs off today, can you get signature by end of week?",
      "link": "https://www.onyx.app/5412973-27"
    },
    {
      "text": "Oscar Fuentes: Yes, that should be doable. Send it over, and I’ll route it. If anything comes up, I’ll ping you the same day.",
      "link": "https://www.onyx.app/5412973-28"
    },
    {
      "text": "Megan Foster: Perfect. I’ll send the order form within the hour, plus a one-page onboarding plan and the initial success metrics we just outlined. Once it’s signed, I’ll schedule kickoff with you and your support and engineering leads. Anything else you want addressed before I send it?",
      "link": "https://www.onyx.app/5412973-29"
    },
    {
      "text": "Oscar Fuentes: No, that covers it. Thanks, Megan—this feels like the right move.",
      "link": "https://www.onyx.app/5412973-30"
    },
    {
      "text": "Megan Foster: Thanks, Oscar. I’ll get that over to you shortly and stay close as you loop in your VP.",
      "link": "https://www.onyx.app/5412973-31"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "megan_foster@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "oscar_fuentes@wisp_&_willow_florals.onyx.app"
    }
  ]
}