{
  "id": "FIREFLIES_1901856",
  "semantic_identifier": "1901856 - Cedarpeak Technologies - sales_call - Discussion with Maria Chavez",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-10-06 00:00:00",
  "metadata": {
    "meeting_date": "2025-10-06 00:00:00",
    "duration_min": "18"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-10"
      ],
      "year_month": "2025-10",
      "meeting_title": "1901856 - Cedarpeak Technologies - sales_call - Discussion with Maria Chavez",
      "organizer_email": "james_choi@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "James Choi: Hi Maria—good to see you again. Thanks for making time for the second chat. Last time you mentioned the part that caught your eye was using Customer_Analyzer to tighten your ICP and give the sales team clearer talk tracks. Does that still feel like the priority?",
      "link": "https://www.onyx.app/9191775-1"
    },
    {
      "text": "Maria Chavez: Hi James. Yes, that’s still the interest. We’re getting pressure to improve conversion, but we also have to be careful about what data we pull in and how we use it.",
      "link": "https://www.onyx.app/9191775-2"
    },
    {
      "text": "James Choi: Totally fair. For today, I was hoping to focus on two things: first, our fit estimation—how we compute a fit score with a clear driver breakdown. Second, how that translates into sales enablement, specifically an objection-handling guide tied to what actually wins with your best-fit accounts. If that works, I’ll end with what a pilot would look like.",
      "link": "https://www.onyx.app/9191775-3"
    },
    {
      "text": "Maria Chavez: That’s fine. But I’ll say upfront: if this requires ingesting support tickets or call notes, we may hit a wall with privacy and compliance. Our legal team is strict.",
      "link": "https://www.onyx.app/9191775-4"
    },
    {
      "text": "James Choi: Understood. Let me start with fit estimation at a practical level. Customer_Analyzer computes a 0–100 fit score at both the account level and segment level. The key is you define the fit drivers you care about—industry, company size, technographics, problem severity, willingness to pay, time-to-value, adoption patterns, support burden, churn risk signals—then the system shows (1) the score, (2) why it’s high or low, and (3) how segments compare, like SMB vs mid-market. The output is a recommended ICP profile based on observed outcomes like retention, expansion, and conversion.",
      "link": "https://www.onyx.app/9191775-5"
    },
    {
      "text": "Maria Chavez: Okay. Where do the inputs come from? We have CRM fields and product usage, but a lot of context lives in support and in sales notes. That’s where we get nervous.",
      "link": "https://www.onyx.app/9191775-6"
    },
    {
      "text": "James Choi: You can start with CRM + product usage only. Ingesting tickets and notes is optional. A lot of teams begin with firmographics from Salesforce/HubSpot and usage events from their data warehouse or product analytics. Then you’ll still get the fit score plus driver breakdown—for example: “mid-market SaaS + integration usage + time-to-value under 14 days” correlates with higher retention. That can be enough to pick an ICP and update targeting.",
      "link": "https://www.onyx.app/9191775-7"
    },
    {
      "text": "Maria Chavez: But the sales enablement angle you mentioned—objection handling—usually requires call notes or conversations to understand objections, right?",
      "link": "https://www.onyx.app/9191775-8"
    },
    {
      "text": "James Choi: It can, but it doesn’t have to. We can generate an objection-handling guide from structured outcomes and driver patterns. Example: if best-fit accounts consistently expand when they activate a specific workflow, the enablement content can anchor on that value driver and pre-empt objections like “this looks complex” with proof points: “teams like you typically get to first value in X days” and “top accounts adopt these two features first.” If you later decide to bring in tickets or call notes, it enriches the language, but you can still get 70–80% of the benefit without it.",
      "link": "https://www.onyx.app/9191775-9"
    },
    {
      "text": "Maria Chavez: I’m trying to map this to our reality. Our CRM data is messy. Fields aren’t consistent, and reps don’t always fill in “use case” or “primary pain.” Would the fit score be garbage in, garbage out?",
      "link": "https://www.onyx.app/9191775-10"
    },
    {
      "text": "James Choi: Data quality matters, yes. The way we handle it is we don’t require a perfect CRM. We lean on drivers you trust—like industry, employee band, contract value, onboarding duration, product usage milestones, support volume. And we show the driver breakdown explicitly, so if a field is noisy, you’ll see it isn’t contributing much. During a pilot, we typically pick 6–10 drivers you’re confident in and iterate.",
      "link": "https://www.onyx.app/9191775-11"
    },
    {
      "text": "Maria Chavez: I’m also wondering about “recommended ICP profile based on observed outcomes.” We have limited historical retention data for a few segments because we changed packaging last year. Would that break it?",
      "link": "https://www.onyx.app/9191775-12"
    },
    {
      "text": "James Choi: Not break it, but it may reduce confidence in certain comparisons. In those cases we’ll lean more heavily on conversion and early adoption signals—time-to-first-value, feature activation, support burden in the first 30–60 days—things that are more consistent across packaging changes. The output includes confidence indicators, so you can see where the model is drawing strong conclusions versus tentative ones.",
      "link": "https://www.onyx.app/9191775-13"
    },
    {
      "text": "Maria Chavez: Let’s talk about the privacy piece again. If we ever did want to use tickets or call notes, what exactly gets ingested? We have PII in Zendesk sometimes, and sometimes sensitive internal notes.",
      "link": "https://www.onyx.app/9191775-14"
    },
    {
      "text": "James Choi: Good question. In environments with strict compliance, customers either (a) exclude those sources entirely, or (b) pass them through redaction before they reach us, or (c) restrict to metadata only—like ticket tags, categories, resolution time—without the raw text. The product can work with structured fields and event signals. If you want text, we can apply filters, but I don’t want to oversell it without aligning to your policies.",
      "link": "https://www.onyx.app/9191775-15"
    },
    {
      "text": "Maria Chavez: Do you store the raw text if we did send it?",
      "link": "https://www.onyx.app/9191775-16"
    },
    {
      "text": "James Choi: By default, we store what we ingest to provide traceability, but we can configure retention and limit to derived outputs depending on plan and security review. That said, if your baseline stance is “no customer communications leave our systems,” then the right approach is to keep to CRM + product analytics and ticket metadata only.",
      "link": "https://www.onyx.app/9191775-17"
    },
    {
      "text": "Maria Chavez: Our baseline stance is close to that. We’re not allowed to send transcripts or raw tickets to new vendors without a long review, and we’re already mid-review with two other tools. Timing is an issue.",
      "link": "https://www.onyx.app/9191775-18"
    },
    {
      "text": "James Choi: That makes sense. If timing is the constraint, a light pilot using only CRM firmographics + product usage events is the fastest. We can show you fit score, driver breakdown, and segment comparisons in a couple weeks. Then, for sales enablement, we can produce a first-pass objection guide based on what wins for high-fit accounts—again without raw text.",
      "link": "https://www.onyx.app/9191775-19"
    },
    {
      "text": "Maria Chavez: And how does that show up for the sales team? Another dashboard? They already ignore half of what we give them.",
      "link": "https://www.onyx.app/9191775-20"
    },
    {
      "text": "James Choi: Fair. We typically package it in two places: (1) a simple “fit score + top 3 drivers” view per account that can be pushed back into CRM as fields, and (2) a one-pager enablement asset: “Best-fit profile, top value props, proof points, common objections + responses.” The goal is to make it usable in a deal cycle, not just analytics.",
      "link": "https://www.onyx.app/9191775-21"
    },
    {
      "text": "Maria Chavez: If it’s going into CRM, that’s another integration, and our RevOps team is swamped. Also, if the score is wrong, reps will distrust it and we’ll have a credibility problem.",
      "link": "https://www.onyx.app/9191775-22"
    },
    {
      "text": "James Choi: Completely agree on credibility. That’s why the driver breakdown is front-and-center. Instead of saying “trust the number,” it says “here’s why this account scored 82: strong usage of X, low support burden, fast onboarding, matching industry.” If something looks off, you can see which driver caused it and adjust. For RevOps bandwidth, we can start without writing back into CRM—just a weekly export or shared view—then automate later if it proves value.",
      "link": "https://www.onyx.app/9191775-23"
    },
    {
      "text": "Maria Chavez: Okay, but you’re still asking us to adopt something new. Right now our leadership wants quick wins that don’t add process. If we can’t integrate deeply, I’m not sure the team will use it.",
      "link": "https://www.onyx.app/9191775-24"
    },
    {
      "text": "James Choi: Understood. Let me ask: what would qualify as a “quick win” in the next 30 days? More meetings booked? Higher win rate in a segment? Fewer unqualified deals?",
      "link": "https://www.onyx.app/9191775-25"
    },
    {
      "text": "Maria Chavez: Fewer unqualified deals. We’re wasting cycles. But we already have a qualification framework, it’s just inconsistently applied.",
      "link": "https://www.onyx.app/9191775-26"
    },
    {
      "text": "James Choi: That’s actually a strong fit for fit estimation. In a pilot, we could take your last 6–12 months of closed-won and closed-lost, plus basic product adoption for customers, and identify the handful of drivers that separate “good deals” from “bad deals.” Then your qualification framework becomes evidence-based: “if these 3 conditions aren’t present, deprioritize.” That’s how teams cut wasted pipeline.",
      "link": "https://www.onyx.app/9191775-27"
    },
    {
      "text": "Maria Chavez: I can see the logic, but I’m not convinced we can get you the data cleanly, or quickly. Our product events aren’t standardized, and our data team is in a backlog for Q1. If this requires engineering time, it’s a non-starter.",
      "link": "https://www.onyx.app/9191775-28"
    },
    {
      "text": "James Choi: If product events are hard right now, we can do a CRM-only pilot—industry, size, sales cycle length, deal stage progression, discounting, and outcomes. It’s not as rich, but it can still highlight segments with better conversion and expansion. The question is whether that’s enough value for you to justify later adding usage signals.",
      "link": "https://www.onyx.app/9191775-29"
    },
    {
      "text": "Maria Chavez: I’m worried CRM-only will just tell us what we already believe—like “mid-market converts better than SMB.” We need something more actionable than that.",
      "link": "https://www.onyx.app/9191775-30"
    },
    {
      "text": "James Choi: That’s fair. Without usage or onboarding signals, the insights can be more generic. The more we can bring in time-to-value and adoption patterns, the more actionable it gets for messaging and objection handling. If your data team can’t support that soon, the pilot may not meet your bar.",
      "link": "https://www.onyx.app/9191775-31"
    },
    {
      "text": "Maria Chavez: Exactly. And on the compliance side, even if we’re not sending call notes now, legal will still ask what data types you *could* ingest and how you handle them. That review alone can take weeks. We’re trying to avoid new vendor risk this quarter.",
      "link": "https://www.onyx.app/9191775-32"
    },
    {
      "text": "James Choi: Understood. Given that, forcing a pilot now may not be the best move. One option is we do a shorter “readiness” step: you share a sanitized sample of fields you *can* export—no PII—and we map what fit drivers we could reasonably support without product events or text. If it looks thin, we pause until your data and compliance bandwidth opens up.",
      "link": "https://www.onyx.app/9191775-33"
    },
    {
      "text": "Maria Chavez: I’d prefer that. I don’t want to start something we can’t finish, and I can’t commit RevOps or data engineering right now.",
      "link": "https://www.onyx.app/9191775-34"
    },
    {
      "text": "James Choi: That’s reasonable. To be clear, are you saying “not now” rather than “no”?",
      "link": "https://www.onyx.app/9191775-35"
    },
    {
      "text": "Maria Chavez: Not now. But it’s also possible we go with a tool that’s already through procurement. So I can’t promise we’ll come back to this.",
      "link": "https://www.onyx.app/9191775-36"
    },
    {
      "text": "James Choi: I appreciate the honesty. Here’s what I’ll do: I’ll send a one-page outline of the CRM-only approach, the list of ideal data inputs for fit estimation, and a security summary focused on what we ingest, retention, and options for excluding communications. If you can share which systems are in scope and what exports are feasible, I can tell you whether we can deliver something meaningfully better than your current segmentation—without creating a compliance headache.",
      "link": "https://www.onyx.app/9191775-37"
    },
    {
      "text": "Maria Chavez: That works. Send it over, and I’ll loop in our security person to at least glance at it, but I’m not committing to a full review yet.",
      "link": "https://www.onyx.app/9191775-38"
    },
    {
      "text": "James Choi: Perfect. I’ll send that today. If it’s helpful, we can tentatively hold a 20-minute follow-up in two weeks to decide whether to proceed or pause.",
      "link": "https://www.onyx.app/9191775-39"
    },
    {
      "text": "Maria Chavez: Put something on the calendar as a placeholder, but understand there’s a good chance we’ll push it.",
      "link": "https://www.onyx.app/9191775-40"
    },
    {
      "text": "James Choi: Totally understood. Thanks, Maria—this was helpful context, even if the timing isn’t ideal.",
      "link": "https://www.onyx.app/9191775-41"
    },
    {
      "text": "Maria Chavez: Thanks, James. Talk soon.",
      "link": "https://www.onyx.app/9191775-42"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "james_choi@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "maria_chavez@cedarpeak_technologies.onyx.app"
    }
  ]
}