{
  "id": "FIREFLIES_2291699",
  "semantic_identifier": "2291699 - Quicksilver Freight - sales_call - Discussion with Noor Farooq",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-10-19 00:00:00",
  "metadata": {
    "meeting_date": "2025-10-19 00:00:00",
    "duration_min": "33"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-10"
      ],
      "year_month": "2025-10",
      "meeting_title": "2291699 - Quicksilver Freight - sales_call - Discussion with Noor Farooq",
      "organizer_email": "megan_foster@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Megan Foster: Hi Noor, good to see you again. Thanks for making the time—last call you mentioned forecasting has been a pain point at Quicksilver Freight, and Sales_Accelerator’s forecast views were what sparked the most interest. Is it still okay if we focus today on forecasting plus one operational use case around pipeline bottlenecks?",
      "link": "https://www.onyx.app/1232011-1"
    },
    {
      "text": "Noor Farooq: Yes, that’s perfect. Forecasting is the big one for us. We’re getting surprised late in the quarter, and it’s hard to know what to believe.",
      "link": "https://www.onyx.app/1232011-2"
    },
    {
      "text": "Megan Foster: Got it. Before I jump in—what are you using as your “source of truth” right now? Just Salesforce stages, or do you have activity requirements too?",
      "link": "https://www.onyx.app/1232011-3"
    },
    {
      "text": "Noor Farooq: Mostly Salesforce stages and some manual rollups. We try to look at activity, but it’s inconsistent. Some reps log everything, others barely do.",
      "link": "https://www.onyx.app/1232011-4"
    },
    {
      "text": "Megan Foster: That’s exactly the gap Sales_Accelerator is designed for. The core feature is the sales_forecast module: it takes your CRM stage data, then blends in activity signals—emails, calls, meetings—plus cycle-time benchmarks. So instead of “Stage 3 equals 70%,” it can say “Stage 3, but it’s aged 28 days past benchmark, no meeting scheduled, last touch 12 days ago—this is at risk.”",
      "link": "https://www.onyx.app/1232011-5"
    },
    {
      "text": "Noor Farooq: Okay, but my first concern is trust. If the system says a deal is at risk, I need to know why, or my managers will ignore it.",
      "link": "https://www.onyx.app/1232011-6"
    },
    {
      "text": "Megan Foster: Completely fair—and we built for that. Every forecast is explainable with drivers. You’ll see a simple “why” panel on the opportunity: stage age versus your historical cycle time, last touch, next meeting scheduled or not, and your historical win rate for similar deals. If you choose to, we can also weight with a fit tier from Customer_Analyzer—so the forecast isn’t a black box.",
      "link": "https://www.onyx.app/1232011-7"
    },
    {
      "text": "Noor Farooq: We do have Customer_Analyzer already. If it’s consuming fit scores, I don’t want two systems arguing with each other.",
      "link": "https://www.onyx.app/1232011-8"
    },
    {
      "text": "Megan Foster: Exactly. Sales_Accelerator sits on top of your existing CRM and integrates with Customer_Analyzer rather than duplicating anything. Customer_Analyzer remains the source for ICP fit and positioning blocks; Sales_Accelerator just uses those fit scores as an input to prioritize and to sharpen the forecast weighting. So you won’t have “two opinions,” you’ll have one fit score feeding multiple workflows.",
      "link": "https://www.onyx.app/1232011-9"
    },
    {
      "text": "Noor Farooq: That helps. How do you handle commit vs best case? We do that today, but it’s very subjective.",
      "link": "https://www.onyx.app/1232011-10"
    },
    {
      "text": "Megan Foster: You’ll get commit, best-case, and pipeline views automatically, plus the ability to slice by segment, rep, or source. What tends to change behavior is the slippage diagnostics: it shows which deals are likely to slip and which stage is the problem. Then your managers can coach with specifics instead of “update your forecast.”",
      "link": "https://www.onyx.app/1232011-11"
    },
    {
      "text": "Noor Farooq: When you say “slippage diagnostics,” do you mean like stage conversion rates?",
      "link": "https://www.onyx.app/1232011-12"
    },
    {
      "text": "Megan Foster: Exactly—stage-to-stage conversion, average days in stage, and where deals stall. And then the system can recommend process fixes. For example, if Quicksilver’s enterprise deals consistently stall at legal or security, it’ll surface that bottleneck and suggest adding a security review step earlier. Then you can monitor whether conversion improves after you change the process.",
      "link": "https://www.onyx.app/1232011-13"
    },
    {
      "text": "Noor Farooq: That’s interesting. Our biggest stall is usually after first demo—things go quiet, and reps don’t know if it’s dead or just slow.",
      "link": "https://www.onyx.app/1232011-14"
    },
    {
      "text": "Megan Foster: Perfect example. Sales_Accelerator would flag a “quiet period risk” driver: no activity in X days, no next meeting, stage age beyond benchmark. And the forecast rollup will reflect that risk instead of waiting until the rep finally changes the stage in Salesforce.",
      "link": "https://www.onyx.app/1232011-15"
    },
    {
      "text": "Noor Farooq: Second concern: if activity is inconsistent, aren’t the signals unreliable?",
      "link": "https://www.onyx.app/1232011-16"
    },
    {
      "text": "Megan Foster: Two parts to that. First, it still uses CRM stages and cycle-time benchmarks, so it’s not purely activity-driven. Second, we can start with the activity streams you already have consistently—calendar meetings and email metadata are usually solid—and treat missing logs as a signal in itself. And because the drivers are visible, it’s easy to spot when a rep’s deals look “healthy” only because they’re not logging activity; that’s a coaching and ops lever.",
      "link": "https://www.onyx.app/1232011-17"
    },
    {
      "text": "Noor Farooq: Makes sense. What does rollout look like? I don’t want a six-month implementation.",
      "link": "https://www.onyx.app/1232011-18"
    },
    {
      "text": "Megan Foster: For forecasting, it’s typically quick because we’re not replacing Salesforce—just connecting to it. We map stages, pull historical outcomes for cycle-time baselines, and then configure your views: segment, rep, source. If you want fit weighting, we connect Customer_Analyzer’s fit tiers. Most teams start with a pilot: one segment or one region for a few weeks, validate accuracy and the explainability drivers, then expand.",
      "link": "https://www.onyx.app/1232011-19"
    },
    {
      "text": "Noor Farooq: What would you need from us for a pilot?",
      "link": "https://www.onyx.app/1232011-20"
    },
    {
      "text": "Megan Foster: A Salesforce connection, agreement on which segments to slice by, and access to historical opportunity outcomes so we can calculate benchmarks—win rates and typical stage duration. Then we’ll set success criteria with you: for example, “reduce end-of-quarter forecast variance by X%” or “cut the number of deals slipping from Stage 3 to next quarter.”",
      "link": "https://www.onyx.app/1232011-21"
    },
    {
      "text": "Noor Farooq: I like the idea of measuring variance. Our CFO is constantly asking why we miss.",
      "link": "https://www.onyx.app/1232011-22"
    },
    {
      "text": "Megan Foster: Totally. And the scenario planning piece helps with CFO conversations too. You can model “If we add 20 SQLs in ICP Tier 1, what’s the expected impact?” It’s not just a static forecast—it's a way to plan actions tied to outcomes.",
      "link": "https://www.onyx.app/1232011-23"
    },
    {
      "text": "Noor Farooq: That would be useful for capacity planning. I can already hear the question: “Why do you think adding SQLs will actually land this quarter?”",
      "link": "https://www.onyx.app/1232011-24"
    },
    {
      "text": "Megan Foster: And that’s where explainability helps again—the scenario view references historical conversion and cycle time for that segment and fit tier. So it’s grounded in your data rather than hopeful math.",
      "link": "https://www.onyx.app/1232011-25"
    },
    {
      "text": "Noor Farooq: Okay. I’m warming up to this. What’s the typical objection you get internally from reps?",
      "link": "https://www.onyx.app/1232011-26"
    },
    {
      "text": "Megan Foster: Usually the same thing you raised: “Don’t tell me a deal is risky unless you can show me why.” The best practice is to introduce it as a coaching and visibility tool, not a policing tool. When reps see it surfaces obvious issues—no next meeting, stale stage—they start trusting it because it’s the same logic a great manager uses, just consistently applied.",
      "link": "https://www.onyx.app/1232011-27"
    },
    {
      "text": "Noor Farooq: If we do a pilot, can we keep the messaging tight? I don’t want feature overload.",
      "link": "https://www.onyx.app/1232011-28"
    },
    {
      "text": "Megan Foster: Absolutely. For Quicksilver, I’d propose we keep it to two things: (1) the sales_forecast views—commit/best-case/pipeline with driver-based explainability, and (2) pipeline bottleneck analysis—stage conversion and slippage by segment/rep. That’s enough to prove value without changing the whole sales motion.",
      "link": "https://www.onyx.app/1232011-29"
    },
    {
      "text": "Noor Farooq: That sounds reasonable. What would pricing depend on—seats, revenue, something else?",
      "link": "https://www.onyx.app/1232011-30"
    },
    {
      "text": "Megan Foster: Primarily seats for the teams using it—AEs, SDRs, managers—and the forecast module. Since you already have Customer_Analyzer, we’re not charging you to “rebuild” fit; we’d just enable the integration so the fit tiers can be used as weighting. If you’re open to it, I can send a pilot proposal with a seat estimate based on your org size.",
      "link": "https://www.onyx.app/1232011-31"
    },
    {
      "text": "Noor Farooq: Yes, do that. I’ll need to loop in our VP of Sales Ops and our RevOps analyst. But if we can pilot in one region, that’s an easy ask.",
      "link": "https://www.onyx.app/1232011-32"
    },
    {
      "text": "Megan Foster: Great. Next step: I’ll email a one-page pilot plan today—scope, data needs, timeline, and success metrics. Can we tentatively schedule a 30-minute working session early next week with you and your RevOps analyst to confirm the Salesforce fields and the segment splits?",
      "link": "https://www.onyx.app/1232011-33"
    },
    {
      "text": "Noor Farooq: Yes—Tuesday morning would work. Send me a couple times and I’ll lock one in.",
      "link": "https://www.onyx.app/1232011-34"
    },
    {
      "text": "Megan Foster: Perfect. Last thing—any “must-have” for you to feel confident recommending this internally?",
      "link": "https://www.onyx.app/1232011-35"
    },
    {
      "text": "Noor Farooq: The explainability piece. If the drivers are clear and we can show it’s not a black box, I can sell it. And if it helps us catch the quiet deals earlier, that’s immediate value.",
      "link": "https://www.onyx.app/1232011-36"
    },
    {
      "text": "Megan Foster: That’s exactly what we’ll validate in the pilot—driver transparency and earlier risk detection. I’ll send the plan and times shortly. Thanks, Noor.",
      "link": "https://www.onyx.app/1232011-37"
    },
    {
      "text": "Noor Farooq: Thanks, Megan. Looking forward to the proposal.",
      "link": "https://www.onyx.app/1232011-38"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "megan_foster@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "noor_farooq@quicksilver_freight.onyx.app"
    }
  ]
}