{
  "id": "FIREFLIES_2559455",
  "semantic_identifier": "2559455 - Flint & Fjord Outfitters - sales_call - Discussion with Eric Tran",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-10-17 00:00:00",
  "metadata": {
    "meeting_date": "2025-10-17 00:00:00",
    "duration_min": "30"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-10"
      ],
      "year_month": "2025-10",
      "meeting_title": "2559455 - Flint & Fjord Outfitters - sales_call - Discussion with Eric Tran",
      "organizer_email": "james_choi@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "James Choi: Hey Eric, good to see you again. Thanks for making the time—last call you mentioned you’re trying to get crisper on who Flint & Fjord’s best customers really are, and you were intrigued by the fit scoring piece. Does that still feel like the priority?",
      "link": "https://www.onyx.app/9215940-1"
    },
    {
      "text": "Eric Tran: Yeah, it is. We’ve got a lot of opinions internally and not a lot of agreement, so anything that helps us be more objective is interesting. But we’re also trying not to add another tool that becomes “another dashboard nobody trusts.”",
      "link": "https://www.onyx.app/9215940-2"
    },
    {
      "text": "James Choi: Totally fair. If it’s okay, I’ll keep this focused on one thing: how Customer_Analyzer produces a fit score with the “why” behind it, and how that supports product planning—so your roadmap bets map to high-fit customers with unmet needs. Then we can see if it’s worth moving to procurement steps or not.",
      "link": "https://www.onyx.app/9215940-3"
    },
    {
      "text": "Eric Tran: Sure. Keep it tight.",
      "link": "https://www.onyx.app/9215940-4"
    },
    {
      "text": "James Choi: Great. So the core is our fit_estimation feature. You connect the signals you already have—CRM fields, onboarding survey responses, product usage events, support tickets, even interview notes—and we compute a fit score from 0 to 100 at both the account level and the segment level. The important part is we don’t just spit out a number; we show the driver breakdown—what’s pushing fit up or down—and comparisons across segments, like SMB vs mid-market.",
      "link": "https://www.onyx.app/9215940-5"
    },
    {
      "text": "Eric Tran: Okay. But how do you decide the drivers? Because that’s where these things fall apart. Sales will say “industry and willingness to pay,” support will say “support burden,” product will say “adoption,” and marketing will say “segment narratives.” We’ve lived that movie.",
      "link": "https://www.onyx.app/9215940-6"
    },
    {
      "text": "James Choi: You’re describing exactly the situation we’re built for—conflicting internal stakeholder opinions. We handle it two ways. First, the drivers are configurable: you can start with a standard set—firmographics, time-to-value, adoption patterns, churn risk signals—and then tune. Second, we tie driver weights back to observed outcomes like retention, expansion, and conversion. So instead of debating in the abstract, you can see, “When adoption looks like X and support burden looks like Y, renewal risk goes up,” or “These characteristics correlate with faster time-to-value.”",
      "link": "https://www.onyx.app/9215940-7"
    },
    {
      "text": "Eric Tran: That sounds good in theory, but we don’t have clean data. CRM fields are inconsistent, product events are messy, and support tickets don’t always map to accounts cleanly. If the inputs are garbage, the score is garbage.",
      "link": "https://www.onyx.app/9215940-8"
    },
    {
      "text": "James Choi: That’s a common concern. In practice we don’t require perfection to get value. We can start with the signals you trust most—say, usage and retention—and add the others over time. And the driver breakdown helps you see where the score is relying on thin data versus strong data. You can also compare segments even if individual accounts are noisy.",
      "link": "https://www.onyx.app/9215940-9"
    },
    {
      "text": "Eric Tran: But then we’re back to trust. If the score says a segment is low fit and Sales has three “big logos” in that segment they’re excited about, the meeting turns into “the tool is wrong.” And the tool loses.",
      "link": "https://www.onyx.app/9215940-10"
    },
    {
      "text": "James Choi: I hear you. One way teams avoid that is by treating fit score as a decision support input, not a verdict. For example, for product planning you can use it to highlight where the product is winning today—high fit, high retention—and then look for unmet needs inside that zone to guide roadmap. It’s less threatening than using it to tell Sales they shouldn’t pursue a deal.",
      "link": "https://www.onyx.app/9215940-11"
    },
    {
      "text": "Eric Tran: The product planning angle is why I’m here, honestly. We’re trying to decide between two roadmap bets for next quarter. But I’m still not sure how your score gets us to a decision we can stand behind.",
      "link": "https://www.onyx.app/9215940-12"
    },
    {
      "text": "James Choi: Let me map it to that. Say you’re choosing between building Feature A for mid-market outdoor retailers vs improving onboarding for SMB brands. Customer_Analyzer will show segment-level fit: mid-market might score, say, 72 with strong willingness-to-pay but longer time-to-value and higher support burden; SMB might score 81 with faster adoption but lower expansion. Then you can drill into the driver breakdown to see what’s actually limiting fit—maybe time-to-value is the bottleneck for mid-market. That points to the roadmap bet with the highest expected impact on outcomes you care about—conversion, retention, expansion.",
      "link": "https://www.onyx.app/9215940-13"
    },
    {
      "text": "Eric Tran: But that example assumes we can actually measure those outcomes cleanly by segment and map them to “drivers.” We’re not that mature. Also, we already do some of this in spreadsheets and our BI tool. It’s painful, but it’s ours.",
      "link": "https://www.onyx.app/9215940-14"
    },
    {
      "text": "James Choi: Makes sense. The difference is speed and repeatability. Spreadsheets can do the analysis once, but then it becomes a quarterly fire drill and every team tweaks the logic. Customer_Analyzer keeps it consistent, and it becomes a shared reference point.",
      "link": "https://www.onyx.app/9215940-15"
    },
    {
      "text": "Eric Tran: Consistency is a double-edged sword. If the logic is wrong, it’s consistently wrong. Also, I’m not sure we want to institutionalize a model when we’re still evolving our ICP.",
      "link": "https://www.onyx.app/9215940-16"
    },
    {
      "text": "James Choi: That’s fair. We’re not forcing a static ICP—our recommended ICP profile updates based on observed outcomes. So as your product changes, the fit drivers and the segment fit patterns can change too.",
      "link": "https://www.onyx.app/9215940-17"
    },
    {
      "text": "Eric Tran: Okay, but let’s talk about the internal stakeholder conflict you mentioned. That’s real for us. Marketing wants to go upmarket, Sales wants anything with budget, Product wants fewer edge cases, and support is drowning. If your tool outputs a score, it doesn’t solve the politics. It might make it worse.",
      "link": "https://www.onyx.app/9215940-18"
    },
    {
      "text": "James Choi: It can, if it’s rolled out without alignment. The teams that succeed treat the first month as calibration: agree on a short list of drivers, run the score, then review the “why” together. The goal isn’t to eliminate disagreement; it’s to make the disagreement specific and testable. Like, “Does support burden actually predict churn for us?” instead of “support is mad.”",
      "link": "https://www.onyx.app/9215940-19"
    },
    {
      "text": "Eric Tran: That requires time we don’t have. And honestly, Product doesn’t want to babysit another cross-functional process. We’re already in too many meetings.",
      "link": "https://www.onyx.app/9215940-20"
    },
    {
      "text": "James Choi: Understood. If time is tight, we can scope it down. A lightweight pilot could focus on just product usage events plus renewal outcomes, and produce segment comparisons you can use in roadmap planning. Minimal stakeholder overhead.",
      "link": "https://www.onyx.app/9215940-21"
    },
    {
      "text": "Eric Tran: Pilot sounds fine, but pilots around here tend to stall. And I’m not the only decision maker. I can’t promise you we’ll get time from Sales Ops or Marketing Ops to wire data. We’re stretched.",
      "link": "https://www.onyx.app/9215940-22"
    },
    {
      "text": "James Choi: If it helps, we can do a lot of the initial work with export files—no heavy integration at first. Then once you see value, you can decide whether to invest in deeper connections.",
      "link": "https://www.onyx.app/9215940-23"
    },
    {
      "text": "Eric Tran: Exports mean manual work. That’s a non-starter long term, and short term it still lands on someone’s plate. Also, our security team is strict about sending customer data to new SaaS vendors. That process alone can take months.",
      "link": "https://www.onyx.app/9215940-24"
    },
    {
      "text": "James Choi: Security reviews can take time, yes. We do support SOC 2 documentation and can share our security package. But if the timeline is months, we may need to decide if it’s even worth pushing right now.",
      "link": "https://www.onyx.app/9215940-25"
    },
    {
      "text": "Eric Tran: That’s kind of where I’m landing. I like the concept, but between data cleanliness, stakeholder alignment, and security, it’s hard to see this moving quickly. And if it’s not quick, it competes with other priorities.",
      "link": "https://www.onyx.app/9215940-26"
    },
    {
      "text": "James Choi: Appreciate the candor. Let me ask one more thing to see if there’s a narrow path: if we could produce a credible segment-level fit comparison using only anonymized or aggregated data—no PII—would that change anything? It could at least inform your next roadmap bet without triggering the full security lift.",
      "link": "https://www.onyx.app/9215940-27"
    },
    {
      "text": "Eric Tran: Maybe, but I’m skeptical we can get something meaningful without account-level linkage. And even if we did, it still doesn’t solve the “who owns the truth” issue internally. People will argue about the drivers, the weights, the segments… all of it.",
      "link": "https://www.onyx.app/9215940-28"
    },
    {
      "text": "James Choi: That’s fair. It sounds like the main blockers are organizational readiness and data governance, not the product itself. If you’re not ready to run a cross-functional calibration and the security process will stall things, it may be better to pause.",
      "link": "https://www.onyx.app/9215940-29"
    },
    {
      "text": "Eric Tran: Yeah. I don’t want to drag you through a six-month maybe. We’re also evaluating changes to our data stack this quarter, so any new vendor is basically frozen until that’s settled.",
      "link": "https://www.onyx.app/9215940-30"
    },
    {
      "text": "James Choi: Understood. Here’s what I propose: I’ll send a one-pager summarizing the fit_estimation approach and what a minimal product-planning use case would look like, plus our security packet link. If things open up after your data stack decision, we can pick it back up and do a tighter scoping call.",
      "link": "https://www.onyx.app/9215940-31"
    },
    {
      "text": "Eric Tran: That works. Send it over. If we revisit, I’d want to see a really clear “day one value” without a ton of setup, because we can’t take on another big implementation.",
      "link": "https://www.onyx.app/9215940-32"
    },
    {
      "text": "James Choi: Got it—day one value, minimal setup, and a clear path to internal alignment without adding meetings. I’ll tailor the follow-up to that. Anything else you want in the email?",
      "link": "https://www.onyx.app/9215940-33"
    },
    {
      "text": "Eric Tran: Include rough pricing too, just so I have a sense, but I can’t commit to anything.",
      "link": "https://www.onyx.app/9215940-34"
    },
    {
      "text": "James Choi: Will do. Thanks, Eric. I appreciate the straight feedback, and we’ll stay light until your timing is better.",
      "link": "https://www.onyx.app/9215940-35"
    },
    {
      "text": "Eric Tran: Sounds good. Thanks, James.",
      "link": "https://www.onyx.app/9215940-36"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "james_choi@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "eric_tran@flint_&_fjord_outfitters.onyx.app"
    }
  ]
}