{
  "id": "FIREFLIES_2737071",
  "semantic_identifier": "2737071 - Everglow Summit Research - sales_pitch - Discussion with Noel Barrett",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-10-02 00:00:00",
  "metadata": {
    "meeting_date": "2025-10-02 00:00:00",
    "duration_min": "32"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-10"
      ],
      "year_month": "2025-10",
      "meeting_title": "2737071 - Everglow Summit Research - sales_pitch - Discussion with Noel Barrett",
      "organizer_email": "mina_park@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Mina Park: Hi Noel, this is Mina Park—thanks for taking a few minutes. I’ll keep this brief. I’m calling because teams like yours at Everglow Summit Research often have a ton of customer data—CRM fields, onboarding notes, support tickets, usage—but it’s hard to turn that into a clear answer on “who are our best customers” and “which industries should we prioritize next quarter.” Does that sound like a live question on your side?",
      "link": "https://www.onyx.app/6419750-1"
    },
    {
      "text": "Noel Barrett: Yeah, it does. We’ve been debating which segments to lean into, and everyone has an opinion. We have data, but it’s scattered.",
      "link": "https://www.onyx.app/6419750-2"
    },
    {
      "text": "Mina Park: Exactly. That’s the problem Customer_Analyzer is built for. It ingests those signals—your CRM, onboarding survey responses, product usage patterns, support burden—and produces two practical outputs. The main one I want to highlight is our fit estimation: a fit score from 0 to 100 at the account and segment level, plus a driver breakdown that explains why a segment is high or low fit.",
      "link": "https://www.onyx.app/6419750-3"
    },
    {
      "text": "Noel Barrett: Fit score sounds interesting, but we’ve tried scoring models before. They’re usually a black box or they don’t match reality.",
      "link": "https://www.onyx.app/6419750-4"
    },
    {
      "text": "Mina Park: Totally fair. The way we avoid the black-box issue is that you define—or select—your fit drivers up front. For example: industry and size, time-to-value, adoption patterns, support burden, churn risk signals, even willingness-to-pay proxies. Then the score is accompanied by a clear breakdown: “Here are the drivers pushing this segment up; here are the drivers dragging it down.” So when someone asks “Why are mid-market biotech customers scoring higher than SMB fintech?” you can answer it with evidence, not intuition.",
      "link": "https://www.onyx.app/6419750-5"
    },
    {
      "text": "Noel Barrett: Okay. How does it help with next quarter planning specifically? We’re trying to decide which industries to target, but we also don’t want to overload support.",
      "link": "https://www.onyx.app/6419750-6"
    },
    {
      "text": "Mina Park: That’s a perfect use case. A lot of teams optimize for pipeline alone and then get burned by retention or support burden. With Customer_Analyzer, you can compare segments using retention outcomes and support signals side-by-side. So you can see, for instance: “This industry converts fast, but has heavy ticket volume and higher churn risk” versus “This other industry has slightly slower conversion, but sticks longer and expands.” The fit estimation gives you a segment comparison view, so next-quarter targeting becomes a prioritization exercise grounded in retention and support reality.",
      "link": "https://www.onyx.app/6419750-7"
    },
    {
      "text": "Noel Barrett: That would be useful. We currently look at retention in one dashboard and support in another, and marketing doesn’t always buy into what product is seeing.",
      "link": "https://www.onyx.app/6419750-8"
    },
    {
      "text": "Mina Park: Right—and the big value is alignment. Because the output is shared and explainable, marketing, sales, and product can all look at the same segment-level fit story. It also recommends an ICP profile based on observed outcomes like retention, expansion, and conversion—so it’s not just “what we think,” it’s “what’s actually working.”",
      "link": "https://www.onyx.app/6419750-9"
    },
    {
      "text": "Noel Barrett: How hard is the setup? We have Salesforce, a product analytics tool, and Zendesk. But integration projects can stall.",
      "link": "https://www.onyx.app/6419750-10"
    },
    {
      "text": "Mina Park: We try to keep the initial lift light. For a first pass, we usually start with the signals you already trust: Salesforce fields for firmographics and pipeline, Zendesk for support burden, and a few key product usage events that correlate with adoption. You don’t need a perfect data warehouse on day one. The goal of an initial rollout is to produce a credible segment comparison and a first ICP recommendation quickly—then you can refine drivers as you learn.",
      "link": "https://www.onyx.app/6419750-11"
    },
    {
      "text": "Noel Barrett: And who typically owns this internally? Product marketing? RevOps?",
      "link": "https://www.onyx.app/6419750-12"
    },
    {
      "text": "Mina Park: Usually a partnership. RevOps or analytics helps with the data connections, then product marketing and sales leadership use the outputs to make decisions. The reason it works is the outputs are designed to be operational: fit score, driver breakdown, and segment comparisons that plug into targeting, messaging, and account prioritization.",
      "link": "https://www.onyx.app/6419750-13"
    },
    {
      "text": "Noel Barrett: If we did this, what would you need from us to run a meaningful evaluation?",
      "link": "https://www.onyx.app/6419750-14"
    },
    {
      "text": "Mina Park: Great question. For a meaningful evaluation, we’d want: your current segment definitions—or how you think about industries and company sizes—plus a couple outcome metrics you care about, like retention at 6–12 months and a measure of support burden, like tickets per account. Then we map a few candidate fit drivers and run the segment comparison. In a follow-up session, we’d walk through: which segments look strongest, what’s driving it, and where the tradeoffs are.",
      "link": "https://www.onyx.app/6419750-15"
    },
    {
      "text": "Noel Barrett: That sounds reasonable. I’m curious—how do you handle cases where a segment is high retention but low growth potential, or vice versa?",
      "link": "https://www.onyx.app/6419750-16"
    },
    {
      "text": "Mina Park: We don’t force one “best” answer. The fit score is one input, and the driver view makes the tradeoffs explicit. You can weight drivers differently depending on your goal for the quarter—growth vs efficiency, for example. So if next quarter is about expanding responsibly, you might weight retention and support burden more. If it’s about breaking into a new market, you might incorporate willingness-to-pay proxies and time-to-value more heavily. The key is the model stays transparent.",
      "link": "https://www.onyx.app/6419750-17"
    },
    {
      "text": "Noel Barrett: Got it. I can see how that would help us stop arguing in circles.",
      "link": "https://www.onyx.app/6419750-18"
    },
    {
      "text": "Mina Park: Exactly the idea. Rather than debating anecdotes, you’re debating weights and evidence—and that’s a much healthier conversation. If you’re open to it, the next step would be a 30–45 minute working session where I can show you what the fit estimation and segment comparisons look like, and we can map your current targeting questions to the drivers.",
      "link": "https://www.onyx.app/6419750-19"
    },
    {
      "text": "Noel Barrett: Yeah, I’d do that. I’d want our head of product marketing looped in too.",
      "link": "https://www.onyx.app/6419750-20"
    },
    {
      "text": "Mina Park: Perfect. If you can invite them, I’ll tailor it to your next-quarter industry prioritization question specifically—retention and support burden included. Does early next week work? I have Tuesday at 11am or Wednesday at 2pm.",
      "link": "https://www.onyx.app/6419750-21"
    },
    {
      "text": "Noel Barrett: Wednesday at 2pm works better.",
      "link": "https://www.onyx.app/6419750-22"
    },
    {
      "text": "Mina Park: Great—Wednesday at 2pm it is. I’ll send a calendar invite with a short checklist: the segments you’re considering, the retention metric you use, and whichever support burden metric you trust most. That way we can make the session concrete. Anything else you’d want to see in that meeting to make it valuable?",
      "link": "https://www.onyx.app/6419750-23"
    },
    {
      "text": "Noel Barrett: If you can show a sample of the driver breakdown—like what explains a score—that would help sell it internally.",
      "link": "https://www.onyx.app/6419750-24"
    },
    {
      "text": "Mina Park: Absolutely. I’ll include a live example of the driver breakdown and how it rolls up to a segment comparison, so your team can see it’s not a black box. Thanks, Noel—looking forward to Wednesday.",
      "link": "https://www.onyx.app/6419750-25"
    },
    {
      "text": "Noel Barrett: Sounds good. Thanks, Mina.",
      "link": "https://www.onyx.app/6419750-26"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mina_park@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "noel_barrett@everglow_summit_research.onyx.app"
    }
  ]
}