{
  "id": "FIREFLIES_3028265",
  "semantic_identifier": "3028265 - Goldenharbor Shipping - sales_pitch - Discussion with Peyton Davis",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-10-10 00:00:00",
  "metadata": {
    "meeting_date": "2025-10-10 00:00:00",
    "duration_min": "17"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-10"
      ],
      "year_month": "2025-10",
      "meeting_title": "3028265 - Goldenharbor Shipping - sales_pitch - Discussion with Peyton Davis",
      "organizer_email": "james_choi@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "James Choi: Hi Peyton—James Choi here. I’ll be quick. I work with teams that are trying to get sharper on who their best customers really are and which segments to lean into next quarter. Do you have two minutes for a quick idea?",
      "link": "https://www.onyx.app/4510580-1"
    },
    {
      "text": "Peyton Davis: Hey James. Sure, but I’m heading into another meeting soon—what’s this about?",
      "link": "https://www.onyx.app/4510580-2"
    },
    {
      "text": "James Choi: Totally. The product is called Customer_Analyzer. It pulls together signals you already have—CRM fields, onboarding surveys, product usage, support tickets, even interview notes—and turns that into a simple fit score by segment and by account. The point is: instead of debating “Which industries should we target?” you can prioritize using actual retention and support burden signals.",
      "link": "https://www.onyx.app/4510580-3"
    },
    {
      "text": "Peyton Davis: We’re a shipping company—so I’m not sure how relevant the “product usage events” part is. And we already have reporting in our CRM.",
      "link": "https://www.onyx.app/4510580-4"
    },
    {
      "text": "James Choi: Fair question. We’re not trying to replace reporting. The difference is the fit estimation layer—Customer_Analyzer computes a 0–100 fit score and, more importantly, a driver breakdown: why a segment scores high or low. For example, you can weight drivers like industry, size, problem severity, willingness to pay, time-to-value, and support burden. Then it compares segments—say manufacturing vs retail—based on outcomes like renewal or expansion.",
      "link": "https://www.onyx.app/4510580-5"
    },
    {
      "text": "Peyton Davis: We don’t really sell SaaS, though. We’re services-heavy. A “fit score” sounds a little… generic.",
      "link": "https://www.onyx.app/4510580-6"
    },
    {
      "text": "James Choi: That makes sense. The fit drivers are configurable so it’s not generic—if your team cares about time-to-value and support load more than feature adoption, you set it up that way. A lot of services orgs still have the same issue: some customer types are profitable and smooth to onboard, and others churn, escalate, or require more support than they’re worth. Fit estimation helps quantify that and show it by segment.",
      "link": "https://www.onyx.app/4510580-7"
    },
    {
      "text": "Peyton Davis: We already know which customers are painful. The issue is more operational—capacity, lanes, contracts. I’m not sure a new tool helps.",
      "link": "https://www.onyx.app/4510580-8"
    },
    {
      "text": "James Choi: Understood. The use case I had in mind for Goldenharbor was: next-quarter industry targeting. If you’re deciding where to push sales effort, Customer_Analyzer can combine retention history with support burden—ticket volume, escalation tags, SLA misses—so you can see, “This segment retains well and is low-support,” versus “This one renews but costs us a ton.” It helps make the prioritization conversation faster and more defensible.",
      "link": "https://www.onyx.app/4510580-9"
    },
    {
      "text": "Peyton Davis: We don’t have “tickets” in the way software companies do. We have customer service cases, claims, and operations notes spread across systems. Integrations are usually the sticking point.",
      "link": "https://www.onyx.app/4510580-10"
    },
    {
      "text": "James Choi: Yeah, integrations can kill these projects. We typically start light: CRM + a support/case export, even a spreadsheet to prove value. The first output is the segment comparison and the driver breakdown—so you can validate whether the model is pointing at what you already suspect, and where it’s uncovering something you didn’t.",
      "link": "https://www.onyx.app/4510580-11"
    },
    {
      "text": "Peyton Davis: Even “start light” still means someone on my team has to pull data and maintain it. We’re pretty slammed right now.",
      "link": "https://www.onyx.app/4510580-12"
    },
    {
      "text": "James Choi: I hear you. The reason I’m calling is to see if it’s worth a fuller conversation with someone who owns segmentation and targeting—maybe marketing ops or revenue ops? In that call, we’d map your data sources and show a sample fit driver setup for your world—like contract type, lane complexity, claims rate, onboarding effort, and renewal likelihood.",
      "link": "https://www.onyx.app/4510580-13"
    },
    {
      "text": "Peyton Davis: I’m the one who usually fields these, and honestly we’re not looking to add tools this quarter. Budgets are tight and we’re consolidating vendors.",
      "link": "https://www.onyx.app/4510580-14"
    },
    {
      "text": "James Choi: That’s helpful context. If budgets are frozen, the only angle that usually survives is showing hard impact—lower CAC, less wasted outreach, or reduced churn. Do you have an active initiative around reducing churn or tightening ICP that’s already funded?",
      "link": "https://www.onyx.app/4510580-15"
    },
    {
      "text": "Peyton Davis: Not really. We’re focused on operational efficiency and a TMS upgrade. Anything customer analytics-related would be nice-to-have.",
      "link": "https://www.onyx.app/4510580-16"
    },
    {
      "text": "James Choi: Got it. One thought: if you’re doing a TMS upgrade, there’s often a moment where you’re rethinking what “good customer” looks like—because you’ll have cleaner data. Customer_Analyzer can sit on top and translate that into segment priorities. But I don’t want to force it if timing’s off.",
      "link": "https://www.onyx.app/4510580-17"
    },
    {
      "text": "Peyton Davis: Timing is off. And I’m also not convinced the scoring would be trusted internally. People here trust their experience more than a model.",
      "link": "https://www.onyx.app/4510580-18"
    },
    {
      "text": "James Choi: That’s common. We try to make it transparent—no black box. The driver breakdown shows exactly what’s pushing the score up or down for a segment: retention rate, support burden, time-to-value proxies, churn risk signals. It’s meant to support the conversation, not override it.",
      "link": "https://www.onyx.app/4510580-19"
    },
    {
      "text": "Peyton Davis: I appreciate that, but we’d still need to do the work to define all those drivers and get the data clean. We’re just not there.",
      "link": "https://www.onyx.app/4510580-20"
    },
    {
      "text": "James Choi: Fair. If we made this extremely low-lift—like a 20-minute working session where you just tell me the top 5 “fit drivers” you already use informally, and we show how the scoring and segment comparisons would look—would that be worth it? No commitment, just a sanity check.",
      "link": "https://www.onyx.app/4510580-21"
    },
    {
      "text": "Peyton Davis: I don’t think so. I’m not going to be able to staff it, and I don’t want to start something we can’t follow through on.",
      "link": "https://www.onyx.app/4510580-22"
    },
    {
      "text": "James Choi: I respect that. Would it be okay if I sent a one-pager that outlines the fit estimation output—fit score, driver breakdown, and segment comparison—focused specifically on prioritizing industries using retention and support burden? If things open up next quarter, you’ll have it.",
      "link": "https://www.onyx.app/4510580-23"
    },
    {
      "text": "Peyton Davis: Sure, send it over. But I can’t promise we’ll review it soon.",
      "link": "https://www.onyx.app/4510580-24"
    },
    {
      "text": "James Choi: Totally fine. What’s the best email for you?",
      "link": "https://www.onyx.app/4510580-25"
    },
    {
      "text": "Peyton Davis: peyton.davis@goldenharborshipping.com.",
      "link": "https://www.onyx.app/4510580-26"
    },
    {
      "text": "James Choi: Great—thank you. Last quick question so I tailor it: when you talk about “best customers” internally, is it mostly profitability, retention, low support burden, or something else?",
      "link": "https://www.onyx.app/4510580-27"
    },
    {
      "text": "Peyton Davis: Profitability and operational simplicity. Low claims, predictable volume, fewer exceptions.",
      "link": "https://www.onyx.app/4510580-28"
    },
    {
      "text": "James Choi: Perfect—that helps. I’ll send a short note framed around those drivers—claims rate, exception volume, and predictability as fit drivers, and how you’d compare segments. If it’s not a priority now, no worries. Would it be okay if I check back in late Q2 after your TMS work is further along?",
      "link": "https://www.onyx.app/4510580-29"
    },
    {
      "text": "Peyton Davis: You can check back, but again, no guarantees.",
      "link": "https://www.onyx.app/4510580-30"
    },
    {
      "text": "James Choi: Completely understood. Thanks for the time, Peyton. I’ll keep it concise and you can ignore it if it’s not useful.",
      "link": "https://www.onyx.app/4510580-31"
    },
    {
      "text": "Peyton Davis: Alright. Thanks James.",
      "link": "https://www.onyx.app/4510580-32"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "james_choi@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "peyton_davis@goldenharbor_shipping.onyx.app"
    }
  ]
}