{
  "id": "FIREFLIES_3693899",
  "semantic_identifier": "3693899 - Xylembright Water Tech - sales_call - Discussion with Drew Cox",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-10-11 00:00:00",
  "metadata": {
    "meeting_date": "2025-10-11 00:00:00",
    "duration_min": "33"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-10"
      ],
      "year_month": "2025-10",
      "meeting_title": "3693899 - Xylembright Water Tech - sales_call - Discussion with Drew Cox",
      "organizer_email": "megan_foster@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Megan Foster: Hi Drew—good to see you again. Last time you mentioned you’re trying to tighten up who you go after and then tailor messaging for SMB versus mid-market. I wanted to focus today on how Customer_Analyzer’s positioning recommendations can help you get to shippable landing page and outbound copy, and what it would take to roll it out at Xylembright. Sound good?",
      "link": "https://www.onyx.app/6255910-1"
    },
    {
      "text": "Drew Cox: Yep, that’s exactly where we’re stuck. We’ve got interest coming in from a few directions, but we’re not confident our ICP definition is crisp, and the messaging is a little “one size fits all.”",
      "link": "https://www.onyx.app/6255910-2"
    },
    {
      "text": "Megan Foster: Makes sense. Quick recap on what we’d implement: Customer_Analyzer ingests your signals—CRM fields, onboarding surveys, product usage, support tickets, even interview notes—and then it outputs two things. One is a fit score by segment, and the other is positioning recommendations that turn the “why” behind the fit into actual messaging blocks your team can use.",
      "link": "https://www.onyx.app/6255910-3"
    },
    {
      "text": "Drew Cox: The messaging blocks part is what caught my attention. We’ve done internal workshops, but translating them into copy and sales talk tracks takes forever.",
      "link": "https://www.onyx.app/6255910-4"
    },
    {
      "text": "Megan Foster: Exactly. For your use case—two ICP tiers, SMB vs mid-market—the positioning_recommendation feature generates segment-specific value props, top use cases, differentiators, proof points to collect, plus pricing/value framing notes and an objection-handling playbook. Then it formats that into editable blocks like: website hero copy, three bullets for a sales deck, and email openers for outbound.",
      "link": "https://www.onyx.app/6255910-5"
    },
    {
      "text": "Drew Cox: Okay. How “real” are those recommendations? Like, is it generic AI copy, or is it grounded in our customer language?",
      "link": "https://www.onyx.app/6255910-6"
    },
    {
      "text": "Megan Foster: Grounded. The recommendations are linked back to the underlying drivers and evidence—so if it says “mid-market buyers care about compliance reporting and audit trails,” you can click into the support ticket themes, the CRM notes, or the onboarding responses that drove that. And it’ll pull phrasing that customers actually used so you can mirror their language instead of inventing it.",
      "link": "https://www.onyx.app/6255910-7"
    },
    {
      "text": "Drew Cox: That’s helpful. One concern I have is our segment definitions are kind of messy. We have overlap between industries—municipal, industrial, commercial—and personas—ops, procurement, sustainability. I don’t want to feed in a bunch of ambiguity and get confusing recommendations back.",
      "link": "https://www.onyx.app/6255910-8"
    },
    {
      "text": "Megan Foster: That’s a very real risk, and it’s one of the few ways teams get “meh” output. The good news is we can handle it in a structured way. What we typically do is start with just two clean cuts for the first pass—SMB vs mid-market—using objective fields you already trust, like employee count, annual revenue, contract value, or deal size. Then we add a second layer like “industry” only if it’s predictive.",
      "link": "https://www.onyx.app/6255910-9"
    },
    {
      "text": "Drew Cox: But what if the industry is predictive and persona is predictive? That’s what we suspect.",
      "link": "https://www.onyx.app/6255910-10"
    },
    {
      "text": "Megan Foster: Then we don’t try to boil the ocean in week one. We’ll start by validating which dimension drives fit the most. Customer_Analyzer will show you the top fit drivers by segment and also where the overlap is creating noise. If “municipal + procurement” and “industrial + ops” behave differently, we can split them—just not before we have evidence. The key is: we’ll keep the initial segmentation simple enough to produce clean recommendations, then iterate.",
      "link": "https://www.onyx.app/6255910-11"
    },
    {
      "text": "Drew Cox: Got it. Another question: we need this to actually produce usable landing page copy for each tier. Our marketing team is small, and sales is pushing for more targeted outbound. Can you walk me through what the output looks like?",
      "link": "https://www.onyx.app/6255910-12"
    },
    {
      "text": "Megan Foster: Sure. For SMB, you’d typically see a value proposition that’s shorter and more outcomes-based—time-to-value, ease of deployment, quick reporting. You’ll get suggested hero headlines, subhead, and a short set of proof points to collect—like “time saved per week” or “days to first report.” For mid-market, the messaging often shifts to scalability, integrations, governance, and risk reduction. It’ll generate slightly longer bullets, a differentiator section, and objection handling like “We already have a legacy system” or “Implementation will be heavy,” with recommended counters tied to evidence.",
      "link": "https://www.onyx.app/6255910-13"
    },
    {
      "text": "Drew Cox: And the objection handling is based on our deals, not just best practices?",
      "link": "https://www.onyx.app/6255910-14"
    },
    {
      "text": "Megan Foster: Exactly. It looks at what objections show up in your CRM notes and call notes, and it correlates them with wins and losses by segment. Then it drafts talk tracks and “proof points to collect” so you can close the gaps. If mid-market prospects keep asking for references in a specific vertical, it’ll tell you that and suggest what to gather.",
      "link": "https://www.onyx.app/6255910-15"
    },
    {
      "text": "Drew Cox: That’s compelling. Our sales reps constantly ask for better battlecards, but we don’t have time to build them from scratch every quarter.",
      "link": "https://www.onyx.app/6255910-16"
    },
    {
      "text": "Megan Foster: This shortens that cycle. The playbook is editable, so your team can tweak it, but you’re starting from a version that’s consistent, segment-specific, and tied to what’s actually happening in your pipeline.",
      "link": "https://www.onyx.app/6255910-17"
    },
    {
      "text": "Drew Cox: How much work is it on our side to ingest the signals? We’ve got Salesforce, some product usage events in our data warehouse, and Zendesk tickets.",
      "link": "https://www.onyx.app/6255910-18"
    },
    {
      "text": "Megan Foster: For a first rollout, we can keep it lightweight: Salesforce opportunity and account fields plus Zendesk tags and ticket text. That’s often enough to get credible segment language and objections. If we add product usage later, that can sharpen fit drivers, but it’s not required to start generating landing page and outbound messaging.",
      "link": "https://www.onyx.app/6255910-19"
    },
    {
      "text": "Drew Cox: And timeline? If I want something we can use next month for a campaign, is that realistic?",
      "link": "https://www.onyx.app/6255910-20"
    },
    {
      "text": "Megan Foster: Yes. A typical path is: week one—connect Salesforce and Zendesk, confirm two segment definitions (SMB vs mid-market) and the success metrics. Week two—review the initial recommendations with you and marketing, and we refine the messaging blocks. Week three—export the landing page sections and outbound sequences, and arm sales with the objection playbook. You can be live within 3–4 weeks, depending on how quickly we can validate segments.",
      "link": "https://www.onyx.app/6255910-21"
    },
    {
      "text": "Drew Cox: That’s faster than I expected. My only other worry is if the tool suggests different positioning than what we currently say. That could create internal friction.",
      "link": "https://www.onyx.app/6255910-22"
    },
    {
      "text": "Megan Foster: Totally. We see that a lot—especially when teams have one narrative they’ve used for years. The way we handle it is we don’t force a wholesale rebrand. We start by picking one tier—say SMB—and run a controlled test: a new landing page variant and a new outbound opener. Then we measure: reply rates, conversion to meeting, and sales cycle signals. If it wins, it becomes easier to bring the org along. If it doesn’t, we adjust with the evidence.",
      "link": "https://www.onyx.app/6255910-23"
    },
    {
      "text": "Drew Cox: That testing angle would help with buy-in. I can get marketing on board if it’s framed as an experiment.",
      "link": "https://www.onyx.app/6255910-24"
    },
    {
      "text": "Megan Foster: Perfect. On procurement and next steps: typically customers your size start with the positioning_recommendation package, then expand once they see uplift. If we’re aligned, I’d propose we lock in a pilot focused on SMB vs mid-market messaging, with clear deliverables: two landing page drafts, two outbound sequences, and a segment-specific objection playbook for each tier.",
      "link": "https://www.onyx.app/6255910-25"
    },
    {
      "text": "Drew Cox: What would you need from me to get that moving?",
      "link": "https://www.onyx.app/6255910-26"
    },
    {
      "text": "Megan Foster: Two things. First, a quick working session—45 minutes—with you and whoever owns marketing messaging to confirm the segment criteria and what “good” looks like for each tier. Second, an intro to your Salesforce admin and whoever owns Zendesk so we can connect the data sources. After that, we can come back with the first round of recommendations.",
      "link": "https://www.onyx.app/6255910-27"
    },
    {
      "text": "Drew Cox: I can do that. Our marketing lead is Priya—I can pull her into that working session. Salesforce admin is Jordan, Zendesk is under support ops, but I can connect you.",
      "link": "https://www.onyx.app/6255910-28"
    },
    {
      "text": "Megan Foster: Great. Before we close, I want to double-check the potential segment ambiguity issue you mentioned. If we start with a clean SMB vs mid-market split, are you comfortable treating industry/persona as “phase two,” unless the data clearly shows it’s driving outcomes?",
      "link": "https://www.onyx.app/6255910-29"
    },
    {
      "text": "Drew Cox: Yes, that feels safe. Start simple, prove value, then refine. As long as we can evolve it without redoing everything.",
      "link": "https://www.onyx.app/6255910-30"
    },
    {
      "text": "Megan Foster: You can. The messaging blocks and drivers stay traceable; when you add a segment dimension, it updates the recommendations and shows you what changed and why. You’re not starting over.",
      "link": "https://www.onyx.app/6255910-31"
    },
    {
      "text": "Drew Cox: Okay. Then I’m leaning toward moving forward with the pilot. Can you send over a proposal with the deliverables you mentioned and pricing?",
      "link": "https://www.onyx.app/6255910-32"
    },
    {
      "text": "Megan Foster: Absolutely. I’ll send a short proposal today with the pilot scope—SMB vs mid-market positioning recommendations, landing page and outbound assets, and objection playbooks—plus the timeline and the data connections required. If it looks good, we can aim to kick off early next week.",
      "link": "https://www.onyx.app/6255910-33"
    },
    {
      "text": "Drew Cox: Sounds good. If you send it today, I can review tomorrow and we can try to get it approved this week.",
      "link": "https://www.onyx.app/6255910-34"
    },
    {
      "text": "Megan Foster: Perfect. I’ll also include a one-pager that explains how we manage segment ambiguity so your team feels confident about the approach. Anything else you want to make sure we cover before I send it?",
      "link": "https://www.onyx.app/6255910-35"
    },
    {
      "text": "Drew Cox: No, I think you hit the key points. I’m interested—especially if we can get usable messaging out quickly.",
      "link": "https://www.onyx.app/6255910-36"
    },
    {
      "text": "Megan Foster: Great. I’ll follow up shortly with the proposal and a couple of time slots for the working session with you and Priya. Talk soon, Drew.",
      "link": "https://www.onyx.app/6255910-37"
    },
    {
      "text": "Drew Cox: Thanks, Megan. Talk soon.",
      "link": "https://www.onyx.app/6255910-38"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "megan_foster@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "drew_cox@xylembright_water_tech.onyx.app"
    }
  ]
}