{
  "id": "FIREFLIES_4125578",
  "semantic_identifier": "4125578 - Meridianoak Holdings - sales_call - Discussion with Jonathan Mason",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-10-20 00:00:00",
  "metadata": {
    "meeting_date": "2025-10-20 00:00:00",
    "duration_min": "41"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-10"
      ],
      "year_month": "2025-10",
      "meeting_title": "4125578 - Meridianoak Holdings - sales_call - Discussion with Jonathan Mason",
      "organizer_email": "james_choi@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "James Choi: Jonathan, good to see you again. Thanks for making the time. Last call you mentioned the team’s biggest pain is knowing what to do next in outbound and having leadership trust the number at the end of the month. I wanted to focus today on Sales_Accelerator—specifically forecast plus next-best-action for your SDRs—so we can see if it’s something you’d feel comfortable moving forward with. Sound good?",
      "link": "https://www.onyx.app/5291343-1"
    },
    {
      "text": "Jonathan Mason: Yeah, that’s fine. I’ve got about 25 minutes, but I’m happy to hear where you think this fits.",
      "link": "https://www.onyx.app/5291343-2"
    },
    {
      "text": "James Choi: Perfect—I’ll keep it tight. Quick recap: Sales_Accelerator sits on top of Salesforce, pulls in activity signals like emails, calls, meetings, and it can also ingest the fit tiers you’re already generating in Customer_Analyzer. Then it does two things that matter most here: one, more explainable forecasting—commit/best case, pipeline coverage, slippage. Two, it guides reps on what account to touch next and how, based on fit, activity, and what’s working for similar deals.  \nBefore I go deeper, what’s changed since we spoke? Any updates on outbound volume or forecast pressure?",
      "link": "https://www.onyx.app/5291343-3"
    },
    {
      "text": "Jonathan Mason: Forecast pressure is constant. Outbound hasn’t been great—SDRs are doing activity, but leadership doesn’t believe the pipeline. And honestly, we’ve tried “priority lists” before. They get ignored if they don’t match reality in Salesforce.",
      "link": "https://www.onyx.app/5291343-4"
    },
    {
      "text": "James Choi: That’s helpful. Let me anchor on the one area where I think we can deliver value fastest: the forecasting driver model.  \nWith the sales_forecast feature, we’re not just reading stage and close date. We’re combining stage age, last meaningful touch, next meeting scheduled—or not—and cycle-time benchmarks by segment. Then, if you want, we weight opportunities by Customer_Analyzer fit tier so Tier 1 accounts have a different baseline expectation than long-shot accounts.  \nThe point isn’t a black box score. It’s explainable: “This deal moved from best-case to pipeline because it’s 22 days past typical stage age and no next meeting is booked.” Would that kind of driver-based explanation help you sell the forecast internally?",
      "link": "https://www.onyx.app/5291343-5"
    },
    {
      "text": "Jonathan Mason: The explainable part is good. But I’m worried you’re assuming our CRM is clean enough for that. It’s… not. Close dates get pushed, stages don’t change, next steps are missing half the time. So wouldn’t the output just be garbage, or worse, a bunch of alerts that everyone learns to ignore?",
      "link": "https://www.onyx.app/5291343-6"
    },
    {
      "text": "James Choi: Totally fair—and that’s one of the main failure modes of forecasting tools. If the CRM is stale, you get false positives and alert fatigue.  \nTwo thoughts: First, Sales_Accelerator uses activity signals as a counterbalance, so even if a stage isn’t updated, the system sees there hasn’t been a meeting in 30 days, no emails replied to, and flags slippage risk. Second, we typically start with a short data hygiene baseline—like three fields we ask reps and managers to keep consistent: stage, next step, and close date range. We don’t need perfection to start improving accuracy.  \nHow bad is it today on those three—stage, next step, close date?",
      "link": "https://www.onyx.app/5291343-7"
    },
    {
      "text": "Jonathan Mason: Stage is inconsistent. Next step is basically optional unless a manager is looking. Close dates are… aspirational. And I’m not sure we can enforce more process right now. The team is already stretched.",
      "link": "https://www.onyx.app/5291343-8"
    },
    {
      "text": "James Choi: Understood. If asking for more fields is a non-starter, we can still drive value on the SDR side where the inputs are simpler.  \nThe SDR use case you mentioned last time—prioritizing outbound—comes straight from Customer_Analyzer. We’d take your fit tiers, bring them into Sales_Accelerator, and then it recommends the next 50 accounts to contact, daily or weekly. For each account, it can suggest an opener and proof points aligned to that segment’s positioning blocks from Customer_Analyzer. That way reps aren’t staring at a list—they’re getting “who, why, and what to say” in one place.  \nIf we could improve connect-to-meeting rates by focusing on Tier 1 and Tier 2 with better openers, would that be meaningful this quarter?",
      "link": "https://www.onyx.app/5291343-9"
    },
    {
      "text": "Jonathan Mason: In theory, sure. But we already have sequences in Outreach. And reps don’t love switching tools. If your “next 50” list lives somewhere else, they’ll ignore it and go back to what’s easy.",
      "link": "https://www.onyx.app/5291343-10"
    },
    {
      "text": "James Choi: Makes sense. We’re not trying to replace Outreach sequences. The way most teams use Sales_Accelerator is as the prioritization and guidance layer: it tells Outreach what the priority accounts are and provides the messaging inputs—so reps can still run sequences, but they’re aimed at the right accounts with the right angle.  \nWhere do reps spend the most time today—finding accounts, choosing messaging, or just grinding through tasks?",
      "link": "https://www.onyx.app/5291343-11"
    },
    {
      "text": "Jonathan Mason: Finding good accounts and deciding who’s actually worth it. Messaging is mostly templated. But again—if the list isn’t trustworthy, they won’t follow it.",
      "link": "https://www.onyx.app/5291343-12"
    },
    {
      "text": "James Choi: Let’s test trust directly. What would make a “next 50” list trustworthy for you? Is it purely fit tier? Or do you need it to incorporate engagement and intent—like recent site visits, reply behavior, meeting history?",
      "link": "https://www.onyx.app/5291343-13"
    },
    {
      "text": "Jonathan Mason: Fit tier is a start, but we’ve had “Tier 1” accounts that never respond. So you’d need engagement signals. And we’d need to see why an account is in the top 50, not just “because the system says so.”",
      "link": "https://www.onyx.app/5291343-14"
    },
    {
      "text": "James Choi: Great—so two requirements: include engagement, and explainability.  \nThat’s aligned with how Sales_Accelerator works: it ranks accounts using fit tier plus activity/engagement signals, and it shows drivers like “Tier 1 fit + opened last two emails + recent meeting with a sister business unit,” versus “Tier 1 fit but no engagement in 60 days—deprioritized.”  \nIf we did a pilot, we could start with one SDR pod, one segment, and compare outcomes: meeting rate, time-to-first-touch on Tier 1, and pipeline created. Is that the kind of validation you’d need before rolling it out?",
      "link": "https://www.onyx.app/5291343-15"
    },
    {
      "text": "Jonathan Mason: Maybe. But I’m still stuck on data. Engagement in our systems is messy too. Emails logged inconsistently, meetings not always captured. I don’t want to buy another layer that depends on perfect tracking.",
      "link": "https://www.onyx.app/5291343-16"
    },
    {
      "text": "James Choi: That’s fair. The minimum viable setup would be: connect Salesforce, ingest Customer_Analyzer fit tiers, and capture enough activity signals to avoid blind spots. But if email and meeting data are incomplete, it will reduce ranking quality and make forecasts noisy.  \nLet me ask bluntly: do you have a mandate—or appetite—to fix activity capture this quarter?",
      "link": "https://www.onyx.app/5291343-17"
    },
    {
      "text": "Jonathan Mason: Honestly? No. We’ve tried. It becomes a change management project. And I don’t have air cover for that right now.",
      "link": "https://www.onyx.app/5291343-18"
    },
    {
      "text": "James Choi: Got it. If activity capture and CRM hygiene can’t improve, we’re at risk of you paying for something and then being disappointed because the guidance feels off. I don’t want that outcome.  \nCould we shift the scope to something less dependent on perfect logging—like using Customer_Analyzer fit tiers to power a simple prioritized target list and messaging library, without turning on full forecasting and alerts yet?",
      "link": "https://www.onyx.app/5291343-19"
    },
    {
      "text": "Jonathan Mason: That sounds closer, but we already get fit tiers from Customer_Analyzer. If we’re not turning on forecasting and the alerts, what am I really buying with Sales_Accelerator? Another UI?",
      "link": "https://www.onyx.app/5291343-20"
    },
    {
      "text": "James Choi: Fair challenge. The incremental value would be the “execution layer”—the next-best-action workflow, the daily recommended accounts, and the segment-aligned openers tied to each account—so managers can coach to a consistent plan and reps don’t improvise. But if your team won’t adopt another workflow, that value won’t land.  \nLet me ask: what systems do your SDRs actually live in day to day—Salesforce, Outreach, something else?",
      "link": "https://www.onyx.app/5291343-21"
    },
    {
      "text": "Jonathan Mason: Outreach and Slack. Salesforce only when they’re forced to.",
      "link": "https://www.onyx.app/5291343-22"
    },
    {
      "text": "James Choi: That’s helpful context. If Salesforce is a compliance tool and Outreach is the workbench, then a Salesforce-adjacent layer will struggle unless it pushes actions into Outreach. We can integrate, but it’s still a rollout.  \nAt this point, it sounds like timing and operational readiness might be the bigger blockers than the product itself. Would it be accurate to say you’re interested, but you can’t take on a process/tool change until you’ve stabilized the basics?",
      "link": "https://www.onyx.app/5291343-23"
    },
    {
      "text": "Jonathan Mason: Yeah, that’s basically it. I don’t want to be the guy who bought a forecasting tool and then everyone complains the CRM is garbage. And I don’t have the leverage to fix the CRM right now.",
      "link": "https://www.onyx.app/5291343-24"
    },
    {
      "text": "James Choi: Understood. I’d rather be candid than force a deal that doesn’t succeed.  \nTwo options: we pause and revisit in a quarter when you’re ready to tackle hygiene and activity capture, or we do a very small proof-of-concept that’s scoped to one motion—like prioritizing Tier 1 outbound—provided we can deliver it inside Outreach where reps already work. Would either of those be worth exploring?",
      "link": "https://www.onyx.app/5291343-25"
    },
    {
      "text": "Jonathan Mason: Not right now. We’re in the middle of a re-org, and tools are basically frozen unless it’s mission-critical. Let’s revisit later.",
      "link": "https://www.onyx.app/5291343-26"
    },
    {
      "text": "James Choi: That makes sense. What’s a realistic checkpoint—end of Q1? And between now and then, would it be helpful if I sent over a short readiness checklist—like the minimum CRM/activity signals needed for reliable forecast and recommendations—so you can assess where things stand without committing?",
      "link": "https://www.onyx.app/5291343-27"
    },
    {
      "text": "Jonathan Mason: Sure, send it. End of Q1 is fine. If we get through the re-org and leadership wants better forecasting again, I’ll bring you back in.",
      "link": "https://www.onyx.app/5291343-28"
    },
    {
      "text": "James Choi: Perfect. I’ll email a one-pager: minimum data requirements, what we can do with just Customer_Analyzer fit tiers, and what improves when activity capture is solid. I’ll also include an example of the explainable forecast drivers so you can show your VP what “not a black box” looks like.  \nThanks, Jonathan. I’ll follow up by email and then we’ll pencil something for late Q1.",
      "link": "https://www.onyx.app/5291343-29"
    },
    {
      "text": "Jonathan Mason: Sounds good. Thanks, James.",
      "link": "https://www.onyx.app/5291343-30"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "james_choi@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "jonathan_mason@meridianoak_holdings.onyx.app"
    }
  ]
}