{
  "id": "FIREFLIES_5056388",
  "semantic_identifier": "5056388 - Zephyrroot Materials - sales_call - Discussion with Colton Medina",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-10-12 00:00:00",
  "metadata": {
    "meeting_date": "2025-10-12 00:00:00",
    "duration_min": "16"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-10"
      ],
      "year_month": "2025-10",
      "meeting_title": "5056388 - Zephyrroot Materials - sales_call - Discussion with Colton Medina",
      "organizer_email": "arjun_mehta@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Arjun Mehta: Hi Colton—good to see you again. Last time you mentioned you’re trying to get clearer on which customer segments are actually best for Zephyrroot and where to place roadmap bets. I wanted to pick up there and show how Customer_Analyzer’s fit estimation can make that concrete and usable for product planning. How are you thinking about segments today?",
      "link": "https://www.onyx.app/9499507-1"
    },
    {
      "text": "Colton Medina: Hey Arjun. Yeah, we’ve got a decent amount of data, but it’s messy. We segment by industry and company size, but the personas overlap a lot—R&D, procurement, plant managers—sometimes in the same account. So it’s hard to tell what “good fit” really means versus just “loud customer.”",
      "link": "https://www.onyx.app/9499507-2"
    },
    {
      "text": "Arjun Mehta: That makes a lot of sense, especially in materials where buying committees are real. The core thing we do with fit estimation is: you define the fit drivers that matter for you—industry, size, technographics if relevant, problem severity, willingness to pay, time-to-value, adoption/usage patterns, support burden, even churn-risk signals—and we compute a 0–100 fit score at both the account level and at segment level. Then we show a driver breakdown so you can see why a segment scores high or low. If you’re open to it, what are the outcomes you want to optimize for in the next two quarters—conversion, retention, expansion, or reducing support load?",
      "link": "https://www.onyx.app/9499507-3"
    },
    {
      "text": "Colton Medina: For product planning, it’s mostly retention and expansion. We’re seeing churn in a couple of segments we thought were ideal. And the support team says some customers are high touch in ways we didn’t anticipate.",
      "link": "https://www.onyx.app/9499507-4"
    },
    {
      "text": "Arjun Mehta: Perfect use case. In Customer_Analyzer we can ingest your CRM fields, onboarding survey answers, product usage events, and support tickets—then tie those to outcomes like renewal and expansion. The fit score won’t just be “who looks like our ICP on paper,” it’ll be “who actually retains and grows given how they adopt and what support burden they create.” That way your roadmap bets are grounded in observed outcomes, not assumptions.  \nBefore I go deeper—do you have a consistent definition today for “segment,” or is that part of the problem?",
      "link": "https://www.onyx.app/9499507-5"
    },
    {
      "text": "Colton Medina: That’s part of the problem. We have industry segments, but then we also track application type, and then persona. They overlap. Sometimes the same account fits multiple buckets and we end up with contradictory conclusions.",
      "link": "https://www.onyx.app/9499507-6"
    },
    {
      "text": "Arjun Mehta: Totally fair—and it’s one of the common failure modes if segment definitions aren’t clean. What we typically do in the setup is define a small number of mutually exclusive segment views. For example: one segmentation for firmographics (industry/size), and another for “use case/application type.” You can keep persona as a layer, but we avoid using persona as the primary segmentation if it causes overlap. Customer_Analyzer will still let you slice by persona, but the “recommended ICP profile” is usually anchored in the segmentation that best predicts retention/expansion.  \nIf we were to start simple: could we pick, say, 5–7 industries and 2–3 size bands as your first segmentation—and then a separate view for application type?",
      "link": "https://www.onyx.app/9499507-7"
    },
    {
      "text": "Colton Medina: We could. I worry we’ll spend a lot of time arguing internally about where accounts belong. Also, our CRM data isn’t perfect. Industry fields are sometimes wrong or blank.",
      "link": "https://www.onyx.app/9499507-8"
    },
    {
      "text": "Arjun Mehta: Two good callouts. On the first: we don’t require perfection on day one. We can start with “best available” definitions, run the analysis, and let the driver breakdown show where ambiguity is actually hurting the recommendations. Often the data reveals that two segments you thought were different behave the same—or that one segment is hiding two very different adoption patterns.  \nOn the CRM quality: we can use a mix of signals. If industry is missing, we can still compute fit based on usage patterns, support burden, time-to-value proxies, and survey answers. The fit score includes confidence indicators, so you’ll know when a segment’s score is based on sparse data.",
      "link": "https://www.onyx.app/9499507-9"
    },
    {
      "text": "Colton Medina: Okay. So practically, what does the output look like for product planning? I don’t want another dashboard that we look at once.",
      "link": "https://www.onyx.app/9499507-10"
    },
    {
      "text": "Arjun Mehta: Completely. The two outputs you’ll actually use are:  \n1) The fit score with driver breakdown and segment comparisons—so you can see, for example, “Mid-market industrial manufacturing scores 82 because adoption is fast and expansion is high, but support burden is moderate,” versus “SMB specialty labs score 55 because time-to-value is slow and churn-risk signals are high.”  \n2) A recommended ICP profile based on observed outcomes—so you can codify “this is who we build for next” and align product and go-to-market.  \nFor roadmap: you can identify high-fit customers with unmet needs by looking at “high fit + high support burden” or “high fit + feature adoption stalls.” That points to product bets that unlock retention/expansion.",
      "link": "https://www.onyx.app/9499507-11"
    },
    {
      "text": "Colton Medina: That “high fit plus support burden” angle is interesting. We’ve got some customers we love strategically, but they’re constantly opening tickets. I’m not sure if that means bad fit or just gaps we should fix.",
      "link": "https://www.onyx.app/9499507-12"
    },
    {
      "text": "Arjun Mehta: Exactly the kind of nuance the driver breakdown helps with. If the fit is high because willingness to pay and expansion are strong, but support burden is dragging the score down, that’s a signal for targeted product investment—especially if those issues are common in a segment you want to win. If, on the other hand, the segment has slow time-to-value and low adoption across the board, that’s more “maybe not our ICP right now.”  \nWould it be useful if we modeled fit drivers explicitly around retention and expansion as your primary outcome, with support burden as a negative driver?",
      "link": "https://www.onyx.app/9499507-13"
    },
    {
      "text": "Colton Medina: Yes. But I’m still thinking about the overlapping segments problem. If we do it wrong, the recommendations could be confusing, and then my team won’t trust it.",
      "link": "https://www.onyx.app/9499507-14"
    },
    {
      "text": "Arjun Mehta: That’s a healthy concern. Here’s how we de-risk it: we start with a workshop where we define 2–3 segmentation schemas and agree on one “primary” for ICP recommendations. Then we run an initial fit estimation over, say, the last 12–18 months of accounts and outcomes. We’ll review the segment comparisons together and check: do the differences align with what you’d expect? Where they don’t, we inspect the driver breakdown and the underlying data.  \nAnd importantly—Customer_Analyzer doesn’t hide the “why.” If a segment scores low, you’ll see whether it’s because of adoption patterns, time-to-value, or churn-risk signals—so it’s easier to build trust.",
      "link": "https://www.onyx.app/9499507-15"
    },
    {
      "text": "Colton Medina: That sounds workable. What would you need from us to do a pilot?",
      "link": "https://www.onyx.app/9499507-16"
    },
    {
      "text": "Arjun Mehta: For a pilot focused on product planning, we’d want:  \n- CRM export or connection for firmographics and opportunity outcomes (won/lost, deal size if you have it).  \n- Product usage events or a summary table—enough to capture adoption/engagement patterns.  \n- Support ticket data (tags, volume, time-to-close) so we can quantify support burden.  \nThen we’ll define fit drivers together—probably 6–10 drivers to start—and select your primary segmentation. We can have an initial readout in about two weeks after data access, depending on integrations.",
      "link": "https://www.onyx.app/9499507-17"
    },
    {
      "text": "Colton Medina: Two weeks is fast. If we do this, what would “success” look like at the end of the pilot?",
      "link": "https://www.onyx.app/9499507-18"
    },
    {
      "text": "Arjun Mehta: Great question. I’d propose three concrete success criteria:  \n1) We identify 1–2 segments with demonstrably higher retention/expansion fit than your current target—backed by driver breakdown.  \n2) We identify 1–2 “high-fit but high-friction” patterns that translate directly into a roadmap bet (e.g., onboarding bottleneck, integration gap) and quantify impact.  \n3) We produce a draft ICP profile your product and GTM leaders agree is credible enough to act on—meaning it influences prioritization next cycle.  \nDoes that match what you’d want?",
      "link": "https://www.onyx.app/9499507-19"
    },
    {
      "text": "Colton Medina: Yes. I’d add one more: I need something I can take to our VP Product and not get torn apart on methodology.",
      "link": "https://www.onyx.app/9499507-20"
    },
    {
      "text": "Arjun Mehta: Totally. The methodology is transparent—fit drivers are explicit, weights are configurable, and every score has traceable signals underneath. In the readout, we’ll include a “segment definition” appendix so it’s clear how accounts were classified, and we’ll flag where definitions are ambiguous. We can also run a sensitivity check—like “if we change the weight on support burden, does the ICP recommendation change?”—so leadership sees it’s robust.",
      "link": "https://www.onyx.app/9499507-21"
    },
    {
      "text": "Colton Medina: That would help. What’s the next step—do you want to send over a pilot proposal?",
      "link": "https://www.onyx.app/9499507-22"
    },
    {
      "text": "Arjun Mehta: Yes. If you’re aligned, I’ll send a one-page pilot plan today: scope, required data sources, timeline, and success criteria. Then we schedule a 60-minute segmentation and fit-driver workshop—ideally with you and one person from product ops or analytics. After that, we’ll kick off data access.  \nAre you comfortable being the internal sponsor, or should we loop in your VP Product for the workshop?",
      "link": "https://www.onyx.app/9499507-23"
    },
    {
      "text": "Colton Medina: I can sponsor it, but I’d like to loop in my VP for the workshop so we don’t have to re-litigate later. I can get her on for the first 20 minutes at least.",
      "link": "https://www.onyx.app/9499507-24"
    },
    {
      "text": "Arjun Mehta: Perfect. I’ll propose times for next week. Last question to tailor the plan: do you already have a short list of “segments we think are best,” even if you’re not confident?",
      "link": "https://www.onyx.app/9499507-25"
    },
    {
      "text": "Colton Medina: Yeah—mid-market industrial manufacturers and a subset of specialty chemical producers. But I’m not sure about the latter because they churn more.",
      "link": "https://www.onyx.app/9499507-26"
    },
    {
      "text": "Arjun Mehta: Great starting hypothesis. The pilot will test that directly and show whether the churn is a segment-level issue or tied to specific fit drivers like time-to-value or support burden. I’ll send the pilot plan and a quick data checklist right after this. If we can get the workshop on the calendar, we’re in good shape.",
      "link": "https://www.onyx.app/9499507-27"
    },
    {
      "text": "Colton Medina: Sounds good. Send it over, and I’ll start pulling in the right people for data access. Let’s do it.",
      "link": "https://www.onyx.app/9499507-28"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "arjun_mehta@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "colton_medina@zephyrroot_materials.onyx.app"
    }
  ]
}