{
  "id": "FIREFLIES_6051909",
  "semantic_identifier": "6051909 - Zenithbrook Pharmaceuticals - sales_pitch - Discussion with Connor Foster",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-10-10 00:00:00",
  "metadata": {
    "meeting_date": "2025-10-10 00:00:00",
    "duration_min": "39"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-10"
      ],
      "year_month": "2025-10",
      "meeting_title": "6051909 - Zenithbrook Pharmaceuticals - sales_pitch - Discussion with Connor Foster",
      "organizer_email": "camila_vega@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Camila Vega: Hi Connor—Camila Vega here. Thanks for taking a few minutes. I’ll keep it tight. I’m calling because we work with teams that are trying to get really crisp on who their best customers are and why—and then turn that into messaging and targeting that actually improves conversion.",
      "link": "https://www.onyx.app/2103554-1"
    },
    {
      "text": "Connor Foster: Hi Camila. Yeah, I’ve got a few minutes. What are you reaching out about specifically?",
      "link": "https://www.onyx.app/2103554-2"
    },
    {
      "text": "Camila Vega: The product is called Customer_Analyzer. It pulls together customer signals you already have—CRM fields, onboarding responses, product usage, support tickets, even interview notes—and turns them into two practical outputs: a fit score by account or segment, and positioning recommendations you can use in marketing and sales.",
      "link": "https://www.onyx.app/2103554-3"
    },
    {
      "text": "Connor Foster: Okay. We’re a pharma company—so I’m not sure how that maps. Are you thinking commercial, or something else?",
      "link": "https://www.onyx.app/2103554-4"
    },
    {
      "text": "Camila Vega: Totally fair. I’m not assuming SaaS-only. The use case I see most often is: before you scale acquisition or a new go-to-market motion, you validate your “ideal customer profile” based on evidence, not gut feel. For a team like yours, that can be figuring out which customer segments—or partner types—are most likely to adopt, renew, expand, or require less support friction, depending on what you’re selling.",
      "link": "https://www.onyx.app/2103554-5"
    },
    {
      "text": "Connor Foster: We’re not really “scaling paid acquisition.” And we already have segmentation work that our insights team does.",
      "link": "https://www.onyx.app/2103554-6"
    },
    {
      "text": "Camila Vega: Makes sense. Where Customer_Analyzer tends to help is when segmentation exists, but it’s hard to connect it to outcomes—like “which segments actually convert faster” or “which ones churn less” or “which ones take forever to realize value.” The core feature is fit_estimation: it creates a 0–100 fit score at the account and segment level, with a driver breakdown for why the score is high or low.",
      "link": "https://www.onyx.app/2103554-7"
    },
    {
      "text": "Connor Foster: What exactly is the “fit score” based on? Because we’re very careful about data, and a lot of what you listed is not something we’d be comfortable piping into another system.",
      "link": "https://www.onyx.app/2103554-8"
    },
    {
      "text": "Camila Vega: Absolutely. The fit score is based on whatever drivers you choose and whatever signals you’re comfortable sharing. Teams typically start lightweight—firmographics, basic CRM fields, maybe onboarding survey data, and high-level engagement signals. The platform then shows segment comparisons—say Segment A vs Segment B—and highlights which drivers correlate to better outcomes.",
      "link": "https://www.onyx.app/2103554-9"
    },
    {
      "text": "Connor Foster: We don’t have “product usage events” in the way software companies do. And support tickets are in a system we can’t integrate with easily. So I’m not sure the dataset would be rich enough to do anything meaningful.",
      "link": "https://www.onyx.app/2103554-10"
    },
    {
      "text": "Camila Vega: That’s a common concern. Even with limited signals, you can still get directional clarity. For example, if you have accounts, deal stages, time-to-close, renewal or reorder signals, and a handful of attributes—industry, size, channel, region—you can start to see patterns. The output isn’t just a number; it’s “here’s what’s driving success and what’s driving friction.”",
      "link": "https://www.onyx.app/2103554-11"
    },
    {
      "text": "Connor Foster: We already do that analysis internally in Tableau and some Python. So what’s the incremental value?",
      "link": "https://www.onyx.app/2103554-12"
    },
    {
      "text": "Camila Vega: Two things. First, speed and consistency: instead of one-off analyses, you get an always-on view with driver breakdowns and segment comparisons you can share across marketing, sales, and product. Second, the positioning layer: it translates the fit insights into messaging recommendations—value props, differentiators, proof points, and objection handling—based on what the best-fit customers actually respond to.",
      "link": "https://www.onyx.app/2103554-13"
    },
    {
      "text": "Connor Foster: Positioning recommendations sounds… subjective. And we have brand and medical/legal review. We can’t just change messaging because a tool suggests it.",
      "link": "https://www.onyx.app/2103554-14"
    },
    {
      "text": "Camila Vega: Totally understood. It’s not meant to replace governance—more to propose drafts grounded in evidence so your team isn’t starting from a blank page. And you can constrain it to approved language and claims. But if that part is less relevant, the fit estimation alone can help you prioritize which segments are worth investing in.",
      "link": "https://www.onyx.app/2103554-15"
    },
    {
      "text": "Connor Foster: Prioritize segments for what, though? Our targeting is set at a pretty high level already, and changes take months.",
      "link": "https://www.onyx.app/2103554-16"
    },
    {
      "text": "Camila Vega: If changes are slow, it can still help with where to focus near-term effort—like which segments to prioritize for field enablement, where to focus account-based outreach, or which segments are likely to expand so you can allocate resources. It also surfaces risk signals—support burden, adoption friction, churn risk proxies—if those are available.",
      "link": "https://www.onyx.app/2103554-17"
    },
    {
      "text": "Connor Foster: “If those are available” is doing a lot of work. I’m not trying to be difficult, but this feels like it’s built for SaaS startups. We’re not that.",
      "link": "https://www.onyx.app/2103554-18"
    },
    {
      "text": "Camila Vega: You’re not being difficult at all—that’s helpful context. Let me ask one quick question to see if there’s a fit: do you have a situation where sales and marketing disagree on what “good” looks like—like which accounts are worth pursuing or why certain opportunities stall?",
      "link": "https://www.onyx.app/2103554-19"
    },
    {
      "text": "Connor Foster: Not really. We have disagreements like anyone, but it’s not a major pain point right now. Our bigger issues are operational—systems, compliance, and internal priorities.",
      "link": "https://www.onyx.app/2103554-20"
    },
    {
      "text": "Camila Vega: Got it. In that case, it may not be the right timing. The only other angle I’ll mention is: teams use the fit score to reduce wasted cycles—fewer low-probability pursuits—especially when pipelines get noisy. But if you’re not feeling that pain, I don’t want to force it.",
      "link": "https://www.onyx.app/2103554-21"
    },
    {
      "text": "Connor Foster: Yeah, we’re not in a place where we’re shopping for a new analytics platform. And we have a freeze on new vendors until next quarter, anyway.",
      "link": "https://www.onyx.app/2103554-22"
    },
    {
      "text": "Camila Vega: Understood. Would it be worth a 20-minute follow-up next quarter just to see if priorities shift? I can also send a one-pager that explains the fit_estimation output—fit score, driver breakdown, and segment comparisons—so you can evaluate whether it overlaps with what you already do.",
      "link": "https://www.onyx.app/2103554-23"
    },
    {
      "text": "Connor Foster: You can send the one-pager, sure. But I can’t commit to a follow-up. If it looks relevant, I’ll share it internally.",
      "link": "https://www.onyx.app/2103554-24"
    },
    {
      "text": "Camila Vega: That’s fair. What’s the best email? And is there anyone else on your side who owns customer segmentation or commercial analytics that I should include so it doesn’t get lost?",
      "link": "https://www.onyx.app/2103554-25"
    },
    {
      "text": "Connor Foster: Email is connor.foster@zenithbrook.com. You can include our insights inbox—insights@zenithbrook.com. But again, no promises. We’re stretched thin.",
      "link": "https://www.onyx.app/2103554-26"
    },
    {
      "text": "Camila Vega: Perfect. I’ll send a concise overview with examples of the fit score and the driver breakdown, plus what inputs are optional vs required. If it’s clearly not a match, just reply “not now” and I’ll close the loop on my end.",
      "link": "https://www.onyx.app/2103554-27"
    },
    {
      "text": "Connor Foster: Sounds good. Thanks for keeping it brief.",
      "link": "https://www.onyx.app/2103554-28"
    },
    {
      "text": "Camila Vega: Of course. Appreciate your time, Connor. I’ll send that over shortly.",
      "link": "https://www.onyx.app/2103554-29"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "camila_vega@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "connor_foster@zenithbrook_pharmaceuticals.onyx.app"
    }
  ]
}