{
  "id": "FIREFLIES_6693827",
  "semantic_identifier": "6693827 - Oceanmint Beverages - sales_call - Discussion with Eugene Ray",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-10-07 00:00:00",
  "metadata": {
    "meeting_date": "2025-10-07 00:00:00",
    "duration_min": "38"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-10"
      ],
      "year_month": "2025-10",
      "meeting_title": "6693827 - Oceanmint Beverages - sales_call - Discussion with Eugene Ray",
      "organizer_email": "mina_park@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Mina Park: Hi Eugene—good to see you again. Last time you mentioned you’re feeling the pain of the same customer issue showing up across Zendesk, Intercom, and even CSM notes, and it’s hard to tell what’s truly widespread versus just loud. Does that still feel like the right problem to solve first?",
      "link": "https://www.onyx.app/6394036-1"
    },
    {
      "text": "Eugene Ray: Yeah, that’s still true. We keep re-triaging the same things. But we’ve also been burned by tools that promise “intelligence” and then create more cleanup work.",
      "link": "https://www.onyx.app/6394036-2"
    },
    {
      "text": "Mina Park: Totally fair. The reason I wanted this second call is to focus on one specific workflow: Issue_Tracker’s issue clustering. It ingests the raw inputs—tickets, chats, emails, even call-note summaries—then dedupes and groups them into issue clusters, with suggested names, top phrases, and representative examples. The goal is less manual sorting and more clarity on trends. How are you doing that clustering today?",
      "link": "https://www.onyx.app/6394036-3"
    },
    {
      "text": "Eugene Ray: Mostly manual tags and macros, plus our ops team pulls weekly reports. But the language varies a lot—enterprise customers describe problems differently than SMB. So clustering is where things often go wrong.",
      "link": "https://www.onyx.app/6394036-4"
    },
    {
      "text": "Mina Park: That’s exactly the scenario it’s built for. We use semantic similarity plus configurable rules—product area, platform, severity, keywords—so you’re not relying on one fuzzy model. And we have merge/split controls with guardrails, so your team can correct clusters and keep them stable over time. If I asked your team, what would “success” look like—fewer duplicates, faster routing, better visibility for product?",
      "link": "https://www.onyx.app/6394036-5"
    },
    {
      "text": "Eugene Ray: All of that, but the biggest is trust. If it merges the wrong stuff, we’ll stop using it. We can’t tell CSMs “this is the issue theme” if it’s actually two different bugs.",
      "link": "https://www.onyx.app/6394036-6"
    },
    {
      "text": "Mina Park: Makes sense. Let me ground it in your use case: CSM follow-up. With Issue_Tracker, CSMs can subscribe Oceanmint accounts to relevant clusters. When the linked Jira ticket ships, Issue_Tracker records the release milestone and keeps a history of which customers were notified and when. So it’s not just “we think this is trending,” it’s an auditable chain from customer evidence → cluster → engineering work → customer updates. How are you handling the “who did we notify” tracking today?",
      "link": "https://www.onyx.app/6394036-7"
    },
    {
      "text": "Eugene Ray: Spreadsheets and a bit of Salesforce tasks. It’s messy. But again—if the underlying cluster is wrong, the rest of the workflow is wrong too.",
      "link": "https://www.onyx.app/6394036-8"
    },
    {
      "text": "Mina Park: Agreed. So we usually start with a controlled rollout. Pick one product area—say, your ordering portal or mobile app—pipe in a subset of Zendesk/Intercom data, and have one ops owner review merge/split suggestions weekly for the first month. The system learns from the corrections, and you end up with stable clusters your team trusts. Would you have someone who could own that review step?",
      "link": "https://www.onyx.app/6394036-9"
    },
    {
      "text": "Eugene Ray: Maybe. But I’m skeptical about “learns from corrections.” We’ve tested similar tools and the model still drifted. Also, our tickets have a lot of short, low-context messages. “It’s broken” type stuff.",
      "link": "https://www.onyx.app/6394036-10"
    },
    {
      "text": "Mina Park: That’s a real constraint. In those cases, Issue_Tracker leans on the configurable rules and metadata—platform, product area, severity, keywords—so it doesn’t over-index on vague text. It also surfaces representative examples so the human can quickly validate whether the cluster is coherent. If the data is too thin, it’ll tend to fragment rather than over-merge, and you can decide what to merge intentionally. Does your team prefer fewer, broader buckets—or more granular clusters?",
      "link": "https://www.onyx.app/6394036-11"
    },
    {
      "text": "Eugene Ray: We prefer accuracy over neatness. But fragmentation is also a problem—if you end up with 40 clusters for the same root issue, we’re back to manual triage.",
      "link": "https://www.onyx.app/6394036-12"
    },
    {
      "text": "Mina Park: Right, and that’s why the merge/split workflow matters. You can merge those related fragments into a single theme and keep sub-issues as linked variants if needed. The system keeps links back to every source ticket, so you don’t lose evidence when you consolidate. If we could show you that for one noisy area—like “checkout failures” or “inventory sync”—would that address the trust concern?",
      "link": "https://www.onyx.app/6394036-13"
    },
    {
      "text": "Eugene Ray: It would help, but I’d need to see it on our data. And I’m worried about the time cost. We’re not staffed to babysit an AI clustering system.",
      "link": "https://www.onyx.app/6394036-14"
    },
    {
      "text": "Mina Park: Understood. The aim isn’t to create a new operational burden. Most customers start with a light-touch cadence—like 30 minutes a week for the first couple of weeks, then it tapers once clusters stabilize. But let’s pressure-test: what would be an unacceptable time burden for your team?",
      "link": "https://www.onyx.app/6394036-15"
    },
    {
      "text": "Eugene Ray: Anything beyond an hour a week ongoing is a non-starter. And even then, I’d have to justify it against just improving our tagging and reporting.",
      "link": "https://www.onyx.app/6394036-16"
    },
    {
      "text": "Mina Park: That’s fair. If we can reduce duplicate triage work enough, that hour should pay for itself. The other piece is visibility: clusters make the volume and trend obvious, so teams don’t underestimate widespread problems hidden across many tickets. Do you have a recent example where something looked small but turned out bigger?",
      "link": "https://www.onyx.app/6394036-17"
    },
    {
      "text": "Eugene Ray: Yeah—our loyalty points redemption errors. It trickled in as random complaints, then suddenly it was everywhere. But we still had to manually connect the dots.",
      "link": "https://www.onyx.app/6394036-18"
    },
    {
      "text": "Mina Park: That’s a great candidate cluster. We could stand up a pilot focused on loyalty redemption: ingest the last 90 days of Zendesk and Intercom, cluster by product area + keywords, then validate whether the tool correctly groups the variants. And then connect the cluster to the Jira ticket so once it ships, you have the customer notification history. If that pilot worked, would you be ready to move toward purchase?",
      "link": "https://www.onyx.app/6394036-19"
    },
    {
      "text": "Eugene Ray: Maybe, but I’m not there yet. We’re also in the middle of a Jira workflow migration, and introducing another layer between support and delivery feels risky.",
      "link": "https://www.onyx.app/6394036-20"
    },
    {
      "text": "Mina Park: Totally—timing matters. Issue_Tracker is meant to sit between, but it doesn’t replace Jira or your support tools; it links to them. Still, if your workflows are in flux, the integration work could feel like more change. When does that migration settle down?",
      "link": "https://www.onyx.app/6394036-21"
    },
    {
      "text": "Eugene Ray: Two months, realistically. And procurement is tight this quarter. So even if we liked it, I don’t know we can buy now.",
      "link": "https://www.onyx.app/6394036-22"
    },
    {
      "text": "Mina Park: Got it. If purchase timing is the blocker, one option is a no-cost data sample evaluation—limited scope, no production integrations—just to prove the clustering quality on your historical data. But I want to be respectful: if the biggest concern is accuracy plus bandwidth, is it worth doing that evaluation now, or would it just distract?",
      "link": "https://www.onyx.app/6394036-23"
    },
    {
      "text": "Eugene Ray: It would probably distract. And honestly, the risk of false merges is my main worry. If the clustering is even slightly off, the teams will stop trusting it, and then we’ve paid for something we can’t operationalize.",
      "link": "https://www.onyx.app/6394036-24"
    },
    {
      "text": "Mina Park: I hear you. If you’re not confident the team will adopt it, it’s not the right time to force it. What I can do is send a short plan for a post-migration pilot—specific success criteria like “<1 hour/week maintenance,” “no critical false merges in top 10 clusters,” and “CSM notification history captured for one theme.” Then we can revisit once the Jira changes are done. Would that be helpful?",
      "link": "https://www.onyx.app/6394036-25"
    },
    {
      "text": "Eugene Ray: Yes, send that. But I want to be clear—I’m not committing to a pilot or a purchase. We need to stabilize our current process first.",
      "link": "https://www.onyx.app/6394036-26"
    },
    {
      "text": "Mina Park: Completely fair. I’ll send a one-pager with scope, what data we’d need, and how we’d measure cluster quality and effort. And I’ll include what we’d do if fragmentation or false merges show up—like rule tuning and a review cadence. Is there anyone else you want copied, or should it just be you for now?",
      "link": "https://www.onyx.app/6394036-27"
    },
    {
      "text": "Eugene Ray: Just me for now. If it looks promising, I’ll bring in support ops later.",
      "link": "https://www.onyx.app/6394036-28"
    },
    {
      "text": "Mina Park: Perfect. I’ll get that over today. Thanks for being candid, Eugene—this helps us not oversell. I’ll follow up in a few weeks to see where you are on the Jira migration.",
      "link": "https://www.onyx.app/6394036-29"
    },
    {
      "text": "Eugene Ray: Sounds good. Thanks, Mina.",
      "link": "https://www.onyx.app/6394036-30"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mina_park@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "eugene_ray@oceanmint_beverages.onyx.app"
    }
  ]
}