{
  "id": "FIREFLIES_6890610",
  "semantic_identifier": "6890610 - Firefly Meridian Labs - sales_call - Discussion with Thomas Gray",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-10-21 00:00:00",
  "metadata": {
    "meeting_date": "2025-10-21 00:00:00",
    "duration_min": "31"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-10"
      ],
      "year_month": "2025-10",
      "meeting_title": "6890610 - Firefly Meridian Labs - sales_call - Discussion with Thomas Gray",
      "organizer_email": "camila_vega@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Camila Vega: Hi Thomas—good to see you again. Last time you mentioned you’re trying to be more deliberate about which industries Firefly Meridian Labs targets next quarter, and you liked the idea of using retention and support load to guide that. Does that still feel like the priority?",
      "link": "https://www.onyx.app/6065657-1"
    },
    {
      "text": "Thomas Gray: Yeah, that’s still the big one. We’ve been spreading ourselves thin. Some industries churn fast or just hammer support, and we want to stop chasing those deals.",
      "link": "https://www.onyx.app/6065657-2"
    },
    {
      "text": "Camila Vega: Perfect. Then I want to focus today on one core piece of Customer_Analyzer: our fit estimation. The goal would be to give you a defensible fit score by industry and segment, and specifically tie it to outcomes you care about—retention and support burden—so you can prioritize where to aim marketing and sales.",
      "link": "https://www.onyx.app/6065657-3"
    },
    {
      "text": "Thomas Gray: Okay. When you say “fit score,” what’s actually going into it? Because in theory that sounds great, but our data is… not pristine.",
      "link": "https://www.onyx.app/6065657-4"
    },
    {
      "text": "Camila Vega: Totally fair, and I want to be upfront: scoring is only as good as the signals available. Practically, we start with what you have. For your use case, I’d propose a first version built from three buckets:\n1) Firmographics: industry, company size, maybe region if that matters.\n2) Outcome signals: retention/renewal status, expansion, time-to-value if you track it.\n3) Support burden: ticket volume, severity, time to resolution, and optionally themes if you tag them.\nThen Customer_Analyzer produces a 0–100 fit score per account, and aggregates it by segment—like Industry A SMB vs Industry A mid-market—plus a driver breakdown that explains why.",
      "link": "https://www.onyx.app/6065657-5"
    },
    {
      "text": "Thomas Gray: The driver breakdown is interesting. But here’s the issue: our CRM industry field is messy. Reps type whatever. And our support system isn’t consistently tagged either. I don’t want a fancy dashboard that’s built on junk.",
      "link": "https://www.onyx.app/6065657-6"
    },
    {
      "text": "Camila Vega: That’s the right skepticism. Two things we do to handle that without turning this into a six-month data cleanup project:\nFirst, we flag missingness and confidence. If an industry field is inconsistent, we’ll show you coverage and how much the score is relying on that driver versus others. So you can tell “this segment’s score is solid” versus “this is directional.”\nSecond, we can normalize a lot of the mess automatically. For industry, we typically map free-text values into a controlled list—either your preferred taxonomy or a standard one—so “Health,” “Healthcare,” “MedTech,” doesn’t fragment your segmenting.\nWould that kind of “confidence + normalization” address the concern, or is there a specific data gap you’re worried about?",
      "link": "https://www.onyx.app/6065657-7"
    },
    {
      "text": "Thomas Gray: The confidence part helps. The biggest gap is usage data. We have some product events, but they’re not super consistent across customers. If usage is part of the fit, that might skew things.",
      "link": "https://www.onyx.app/6065657-8"
    },
    {
      "text": "Camila Vega: Yep—and we don’t have to force usage into the first pass. For the “which industries next quarter” decision, you can get a lot of value from retention + support burden + basic firmographics alone. Then, once you’re comfortable, we can layer in adoption patterns where coverage is good.\nAlso, the system will show you, per segment, which drivers are contributing most. If usage coverage is low, it won’t dominate the score; it’ll show as sparse and lower confidence.",
      "link": "https://www.onyx.app/6065657-9"
    },
    {
      "text": "Thomas Gray: Got it. So we could start simpler. What would the output look like for me, as the person trying to make a recommendation internally?",
      "link": "https://www.onyx.app/6065657-10"
    },
    {
      "text": "Camila Vega: You’d have a few views that map directly to that conversation:\n- A segment comparison table: industries on rows, segments like SMB/mid-market on columns, with average fit score and confidence.\n- A “why” panel for each segment: top positive drivers (e.g., high retention, low support hours) and negative drivers (e.g., slow time-to-value, high escalation rate).\n- And a recommended ICP profile based on observed outcomes—basically: “Here’s the segment that looks most likely to renew and expand with the least support drag.”\nSo when someone asks, “Why are we deprioritizing Industry X?” you can say, “Because they churn 2x faster and generate 3x tickets per account, and the model weights those drivers heavily.”",
      "link": "https://www.onyx.app/6065657-11"
    },
    {
      "text": "Thomas Gray: That’s the kind of narrative I need. But I’m also thinking about edge cases. We have one industry that’s noisy in support because of a few big problematic accounts. Would the score over-penalize the whole segment?",
      "link": "https://www.onyx.app/6065657-12"
    },
    {
      "text": "Camila Vega: Great question. We handle outliers in two ways:\n1) You can see distribution, not just averages—so if it’s “two accounts dragging the whole industry,” it’s obvious.\n2) You can configure the fit drivers to use robust metrics—median support burden, percentile bands, or even exclude specific known outliers while you investigate.\nAnd since you get the driver breakdown, you can spot “support burden is the only reason this segment is low,” and drill into which accounts are causing it.",
      "link": "https://www.onyx.app/6065657-13"
    },
    {
      "text": "Thomas Gray: Okay. That makes it less scary. What do you need from us to get a meaningful first cut?",
      "link": "https://www.onyx.app/6065657-14"
    },
    {
      "text": "Camila Vega: Minimal starting set:\n- CRM export with account ID, industry, size band, stage history if you have it, and renewal status or contract start/end dates.\n- Support data keyed to account: ticket count, severity if available, and time-to-close or hours.\nIf we can get those two, we can produce an initial fit model focused on your stated use case within a couple of weeks, then review it together and tune drivers/weights.",
      "link": "https://www.onyx.app/6065657-15"
    },
    {
      "text": "Thomas Gray: Two weeks is reasonable. But we’ll need to involve RevOps for the CRM export and Support Ops for the ticket data. They’ll ask: how much ongoing maintenance is this?",
      "link": "https://www.onyx.app/6065657-16"
    },
    {
      "text": "Camila Vega: Day-to-day, it’s light. Once the initial mapping is set—industry normalization rules, account ID matching—updates can run on a schedule. If your fields stay consistent, it’s mostly hands-off. The main “maintenance” is you occasionally deciding to add a new driver or adjust a definition—for example, if you redefine what counts as “high severity.”\nI can also give RevOps a short checklist: required fields, preferred formats, and what we do when fields are missing.",
      "link": "https://www.onyx.app/6065657-17"
    },
    {
      "text": "Thomas Gray: That would help. Another concern: if the CRM industry is free text, we can normalize it, but what if we have accounts with multiple business lines? They might not fit cleanly into one industry.",
      "link": "https://www.onyx.app/6065657-18"
    },
    {
      "text": "Camila Vega: In that case, we usually support a primary industry plus an “industry tags” field. If you have a notes field or a secondary category, we can map that into tags. Then you can analyze both “primary industry segments” and cross-cutting tags like “regulated,” “high compliance,” or “embedded IT.”\nBut for a first pass, we can keep it simple: primary industry with a “mixed/other” bucket, and we’ll call out where ambiguity is affecting confidence.",
      "link": "https://www.onyx.app/6065657-19"
    },
    {
      "text": "Thomas Gray: Makes sense. So if we do this and it tells us Industry A is high fit and Industry B is low fit—how do we translate that into action beyond just a chart?",
      "link": "https://www.onyx.app/6065657-20"
    },
    {
      "text": "Camila Vega: Great—this is where the fit estimation becomes a buying decision tool, not a reporting tool. Concretely:\n- You use the fit score to set targeting: which industries get budget and SDR capacity next quarter.\n- You set qualification: what “good fit” looks like so reps stop forcing bad deals through.\n- And you align product/CS: if a segment is high revenue but low fit due to time-to-value or support, that becomes a focused improvement initiative.\nFor today, since we’re trying to get you to a decision: I’d propose we define success criteria for a pilot that ends with a clear “go/no-go” on rolling it out.",
      "link": "https://www.onyx.app/6065657-21"
    },
    {
      "text": "Thomas Gray: Okay. What would the pilot look like?",
      "link": "https://www.onyx.app/6065657-22"
    },
    {
      "text": "Camila Vega: Pilot scope:\n- Use case: “Prioritize which industries to target next quarter using retention and support burden signals.”\n- Data: last 12–18 months of renewals + support tickets + current CRM firmographics.\n- Deliverables: segment fit ranking, driver breakdown, and a recommended ICP shortlist—say top 3 industries and 2 “avoid” industries—with confidence indicators.\n- Review: one working session with you and RevOps to validate assumptions, then an exec-ready readout you can take to your leadership team.\nIf we can’t create a ranking you trust because the data is too sparse, we stop. If it’s useful, we move to annual.",
      "link": "https://www.onyx.app/6065657-23"
    },
    {
      "text": "Thomas Gray: That’s pretty clean. What’s the commercial side—do we pay for the pilot, or is it rolled into the subscription?",
      "link": "https://www.onyx.app/6065657-24"
    },
    {
      "text": "Camila Vega: We typically structure it as a paid pilot that rolls into the subscription—so you’re not paying twice. For Firefly Meridian Labs, given your scope, it would be a 6-week pilot with a fixed fee, and if you move forward, that fee is credited toward your first term. If you don’t move forward, you’ve still paid for the work and outputs you can keep.",
      "link": "https://www.onyx.app/6065657-25"
    },
    {
      "text": "Thomas Gray: I like the crediting approach. I’ll need rough numbers to get approval.",
      "link": "https://www.onyx.app/6065657-26"
    },
    {
      "text": "Camila Vega: Absolutely. Before I throw numbers, one quick check: assuming the pilot delivers a ranking your team trusts—meaning you can confidently say “we’re focusing on these industries next quarter”—are you the person who would sponsor moving to the annual subscription, or is there someone else who signs?",
      "link": "https://www.onyx.app/6065657-27"
    },
    {
      "text": "Thomas Gray: I’d sponsor it, but our VP of Growth signs. I can bring it to her if I have a clear pilot plan and price.",
      "link": "https://www.onyx.app/6065657-28"
    },
    {
      "text": "Camila Vega: Perfect. Here’s what I’ll do: I’ll send a one-page pilot proposal today with scope, required fields, timeline, and pricing options. Then we book a 25-minute call with you and your VP of Growth early next week to align on the decision criteria.\nIn parallel, can you intro me to RevOps and Support Ops so we can validate data availability this week?",
      "link": "https://www.onyx.app/6065657-29"
    },
    {
      "text": "Thomas Gray: Yes. I can loop in Jenna in RevOps and Malik in Support Ops. Send me what you need and I’ll make the intro.",
      "link": "https://www.onyx.app/6065657-30"
    },
    {
      "text": "Camila Vega: Great. Last thing—on the data quality concern: if we discover the CRM industry field is too inconsistent, are you open to us using a light enrichment pass or a standardized mapping to clean it, or is that a hard no internally?",
      "link": "https://www.onyx.app/6065657-31"
    },
    {
      "text": "Thomas Gray: We can do mapping. Enrichment might be a harder sell, but mapping what we already have is fine.",
      "link": "https://www.onyx.app/6065657-32"
    },
    {
      "text": "Camila Vega: Perfect. Then we’ll design the pilot to rely on mapping first, and we’ll only propose enrichment if we hit a wall—and we’d get explicit approval.\nI’ll send the pilot doc and the field checklist right after this. Anything else you want to make sure we cover before we talk commercial next week?",
      "link": "https://www.onyx.app/6065657-33"
    },
    {
      "text": "Thomas Gray: No, I think you hit the main concerns. If you can keep it lightweight and still give me a credible “go target these industries” output, that’s exactly what we need.",
      "link": "https://www.onyx.app/6065657-34"
    },
    {
      "text": "Camila Vega: That’s the goal. I’ll follow up shortly with the proposal and next steps, and we’ll aim to have the data validation call booked by Friday.",
      "link": "https://www.onyx.app/6065657-35"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "camila_vega@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "thomas_gray@firefly_meridian_labs.onyx.app"
    }
  ]
}