{
  "id": "FIREFLIES_9260472",
  "semantic_identifier": "9260472 - Stonebridge Microfinance - sales_pitch - Discussion with Beau Medina",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-10-16 00:00:00",
  "metadata": {
    "meeting_date": "2025-10-16 00:00:00",
    "duration_min": "23"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-10"
      ],
      "year_month": "2025-10",
      "meeting_title": "9260472 - Stonebridge Microfinance - sales_pitch - Discussion with Beau Medina",
      "organizer_email": "mina_park@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Mina Park: Hi Beau—Mina Park here. Thanks for taking a few minutes. I’ll keep this quick. I work with teams that are trying to get clearer on which customer segments are actually a great fit and then arm sales with messaging and objection handling that matches what’s working in the real world.",
      "link": "https://www.onyx.app/5686960-1"
    },
    {
      "text": "Beau Medina: Hey Mina. Sure, but I’ve got about five minutes before I jump to another meeting.",
      "link": "https://www.onyx.app/5686960-2"
    },
    {
      "text": "Mina Park: Perfect. The reason I reached out is we’ve been seeing a pattern with financial services orgs—especially lenders and microfinance—where the CRM and product data tells a very different story than the “ideal customer profile” everyone thinks they have. Our product, Customer_Analyzer, pulls in signals you already have—CRM fields, onboarding surveys, product usage events, support tickets—and computes a fit score by account and by segment, 0 to 100, with a driver breakdown of why it’s high or low.",
      "link": "https://www.onyx.app/5686960-3"
    },
    {
      "text": "Beau Medina: Okay. We already have reporting in Salesforce and some dashboards. What’s different from what BI is doing?",
      "link": "https://www.onyx.app/5686960-4"
    },
    {
      "text": "Mina Park: Totally fair. BI usually tells you “what happened.” Customer_Analyzer is geared to answer “who should we pursue next and how should we talk to them.” Two pieces are most relevant: first, fit estimation—so you can define fit drivers like industry, size, problem severity, adoption patterns, support burden, churn signals—and it returns a fit score plus the underlying drivers. Second, it compares segments—like small community lenders vs larger institutions—so you can see where retention, expansion, and conversion actually concentrate.",
      "link": "https://www.onyx.app/5686960-5"
    },
    {
      "text": "Beau Medina: We don’t really sell to “segments” in a formal way. We’re pretty relationship-driven. And honestly, we’re not looking to add another tool right now.",
      "link": "https://www.onyx.app/5686960-6"
    },
    {
      "text": "Mina Park: Understood. When I say segments, it can be as simple as “accounts with shorter time-to-value” or “accounts with high support burden” rather than a strict industry bucket. Where this tends to land quickly is sales enablement: we generate an objection-handling guide tied to your strongest value drivers for best-fit accounts. So instead of generic talk tracks, reps get “When a prospect like X says Y, here are the proof points and differentiators that map to what our best customers actually care about.”",
      "link": "https://www.onyx.app/5686960-7"
    },
    {
      "text": "Beau Medina: We already have battlecards and a pretty solid enablement library. Our team updates them quarterly.",
      "link": "https://www.onyx.app/5686960-8"
    },
    {
      "text": "Mina Park: That’s great—what we usually see is battlecards are built from opinions and a few anecdotes. This ties them to observed outcomes. For example, if the driver breakdown shows that “integration complexity” correlates with lower fit and higher churn risk, that becomes a clear qualification and objection strategy: when integration comes up, you either position your approach more precisely—or you disqualify earlier and save cycles. On the flip side, if “willingness to pay” and “problem severity” are the strongest drivers for high-fit accounts, the messaging and proof points get tuned around that.",
      "link": "https://www.onyx.app/5686960-9"
    },
    {
      "text": "Beau Medina: I hear you, but we’re a regulated environment. We’re not going to pipe support tickets and usage data into a new SaaS without a long security review. That’s a big lift.",
      "link": "https://www.onyx.app/5686960-10"
    },
    {
      "text": "Mina Park: Makes sense. A lot of teams start lighter: we can begin with CRM fields and onboarding survey data only—whatever you’re comfortable with—and still produce an initial fit model. Then, if it’s valuable, we expand inputs over time. The goal for the first pass is just to show, “Here are the top fit drivers, here’s how accounts stack rank, and here’s what messaging is resonating with those high-fit groups.”",
      "link": "https://www.onyx.app/5686960-11"
    },
    {
      "text": "Beau Medina: Even that is still work on our side. And candidly, we’re heads-down on a core system migration. New projects are basically frozen until that’s done.",
      "link": "https://www.onyx.app/5686960-12"
    },
    {
      "text": "Mina Park: Got it. In that case, I can keep this super scoped. The next step I’d normally suggest is a 30-minute working session where we map your current “best customer” definition to 6–8 fit drivers, and we’d show you what outputs look like—fit score, driver breakdown, and a draft objection-handling outline. But if the timing’s not right, I don’t want to force it.",
      "link": "https://www.onyx.app/5686960-13"
    },
    {
      "text": "Beau Medina: Yeah, I don’t think I can commit to a working session. Also, I’m not the buyer for this. Enablement sits with RevOps and our Head of Sales, and any tooling goes through IT.",
      "link": "https://www.onyx.app/5686960-14"
    },
    {
      "text": "Mina Park: Helpful—who would you suggest I speak with on RevOps or sales leadership? If I could get 20 minutes with the right owner, I can tailor it to Stonebridge specifically—no heavy prep, just a conversation about where you’re seeing friction: low conversion in certain deal types, longer cycles, churn pockets, that kind of thing.",
      "link": "https://www.onyx.app/5686960-15"
    },
    {
      "text": "Beau Medina: I’d rather not loop people in right now. Everyone’s swamped, and we’ve been burned by tools that promise “AI insights” and then need months of data wrangling.",
      "link": "https://www.onyx.app/5686960-16"
    },
    {
      "text": "Mina Park: That’s fair. To address that directly: the only thing we’d need to validate early is whether you can export a basic account table with outcomes—like stage progression or renewal—and a handful of attributes. If that’s not feasible during the migration, it probably doesn’t make sense to pursue now.",
      "link": "https://www.onyx.app/5686960-17"
    },
    {
      "text": "Beau Medina: Exactly. Exports are messy at the moment, and our data hygiene isn’t great. So any scoring model would be questionable.",
      "link": "https://www.onyx.app/5686960-18"
    },
    {
      "text": "Mina Park: Understood. Last quick question then—so I know whether to follow up later: is the bigger pain for you today more on acquisition (which deals to chase and how to position) or retention (which accounts are at risk)?",
      "link": "https://www.onyx.app/5686960-19"
    },
    {
      "text": "Beau Medina: Honestly, neither is urgent right now. We’re stabilizing operations. We’re not trying to optimize messaging at the moment.",
      "link": "https://www.onyx.app/5686960-20"
    },
    {
      "text": "Mina Park: That’s clear. In that case, I’ll back off. Would it be okay if I sent a one-pager describing the fit score output and the sales enablement use case—just so you have it on hand when the migration settles?",
      "link": "https://www.onyx.app/5686960-21"
    },
    {
      "text": "Beau Medina: You can send it, but I can’t promise I’ll look at it. If you follow up, make it later in the year.",
      "link": "https://www.onyx.app/5686960-22"
    },
    {
      "text": "Mina Park: Totally. I’ll send a concise overview and I’ll set a reminder to check back in Q3. Thanks for being direct, Beau—appreciate the time.",
      "link": "https://www.onyx.app/5686960-23"
    },
    {
      "text": "Beau Medina: No problem. Thanks, Mina.",
      "link": "https://www.onyx.app/5686960-24"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mina_park@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "beau_medina@stonebridge_microfinance.onyx.app"
    }
  ]
}