{
  "id": "FIREFLIES_2413115",
  "semantic_identifier": "2413115 - Glimmersage Health - sales_pitch - Discussion with Christopher Burke",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-08-17 00:00:00",
  "metadata": {
    "meeting_date": "2025-08-17 00:00:00",
    "duration_min": "22"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-08"
      ],
      "year_month": "2025-08",
      "meeting_title": "2413115 - Glimmersage Health - sales_pitch - Discussion with Christopher Burke",
      "organizer_email": "megan_foster@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Megan Foster: Hi Christopher, Megan Foster here—thanks for taking a few minutes. Did I catch you at an okay time?",
      "link": "https://www.onyx.app/1992493-1"
    },
    {
      "text": "Christopher Burke: Yeah, I’ve got a few minutes. What’s up?",
      "link": "https://www.onyx.app/1992493-2"
    },
    {
      "text": "Megan Foster: Great. I’ll keep it short. I’m reaching out because we’ve been working with product and growth teams at healthcare orgs to get much clearer on which customer segments are truly “high-fit” and what unmet needs they have—so teams can make better roadmap bets and stop chasing noisy signals. The product is called Customer_Analyzer. Are you the right person for product planning decisions at Glimmersage Health, or is that someone else?",
      "link": "https://www.onyx.app/1992493-3"
    },
    {
      "text": "Christopher Burke: I’m involved, but we have a product ops person and the VP Product owns most of that. What exactly does it do?",
      "link": "https://www.onyx.app/1992493-4"
    },
    {
      "text": "Megan Foster: Totally. At a high level, Customer_Analyzer ingests signals you already have—CRM fields, onboarding survey responses, product usage events, support tickets, even interview notes—and turns that into two things: a fit score by segment and positioning recommendations you can actually use. For today, I wanted to focus on one piece: positioning recommendations tied directly to what your best customers say and do, so your team can align faster on who to prioritize and why. Does segment prioritization or ICP alignment feel like a pain right now?",
      "link": "https://www.onyx.app/1992493-5"
    },
    {
      "text": "Christopher Burke: It’s always a discussion, but we’re not in a huge mess. We do quarterly planning and pull reports. We’re okay.",
      "link": "https://www.onyx.app/1992493-6"
    },
    {
      "text": "Megan Foster: That makes sense. Where we usually see teams get stuck is: the “reports” tell you what happened, but not which segments are most aligned with your current strengths or what language will resonate with them. Our positioning_recommendation feature takes the segments you care about and generates editable messaging blocks—value prop, differentiators, proof points to gather, and common objections—linked back to the evidence from tickets, usage, and survey language. The idea is you can go from “we think this segment is good” to “here’s why they’re high-fit and how we should message to win more deals” in a week, not a quarter.",
      "link": "https://www.onyx.app/1992493-7"
    },
    {
      "text": "Christopher Burke: We already have messaging. Marketing handles that. I’m not sure we need another tool for it.",
      "link": "https://www.onyx.app/1992493-8"
    },
    {
      "text": "Megan Foster: Fair. The way product teams use it isn’t to replace marketing—it’s to connect roadmap planning to customer reality. For example: if a segment shows high retention and heavy usage of a specific workflow, and support tickets show a repeated unmet need, the tool surfaces that as a fit driver. Then the positioning recs translate it into “here’s the use case to lead with” and “here’s the proof point we should collect,” which can inform both roadmap bets and what sales/marketing emphasizes. Do you have a single place today where product, sales, and marketing agree on fit drivers for your best customers?",
      "link": "https://www.onyx.app/1992493-9"
    },
    {
      "text": "Christopher Burke: Not really “single place,” no. But we’re not trying to boil the ocean. We’re resource-constrained, and I’m cautious about adding more systems.",
      "link": "https://www.onyx.app/1992493-10"
    },
    {
      "text": "Megan Foster: Completely understood. If it helps, we’re not asking you to re-platform anything. Most teams start by connecting just a couple sources—like HubSpot/Salesforce fields plus a support system—and running a first pass on 2–3 segments. The output is basically a working doc: segment-specific value prop, top use cases, differentiators, and objection handling, all editable. That tends to make roadmap conversations more concrete: “Segment A is higher fit because of X drivers; Segment B looks tempting but churn risk shows up in Y signals.” Is churn or misfit customers something you’ve dealt with recently?",
      "link": "https://www.onyx.app/1992493-11"
    },
    {
      "text": "Christopher Burke: Churn is always a concern, but we’re already tracking it. Again, not sure a tool is the answer.",
      "link": "https://www.onyx.app/1992493-12"
    },
    {
      "text": "Megan Foster: That’s fair. Can I ask one question to see if this is even worth a deeper look? In your last planning cycle, did you have debate around which customer types to build for—like clinical groups vs admin-heavy organizations—or was it pretty settled?",
      "link": "https://www.onyx.app/1992493-13"
    },
    {
      "text": "Christopher Burke: There’s always debate, but it’s mostly opinion plus some revenue data. It’s the usual.",
      "link": "https://www.onyx.app/1992493-14"
    },
    {
      "text": "Megan Foster: That’s exactly the “usual” we try to improve: blending revenue with product usage patterns and qualitative language. The fit score component helps quantify which segments match your product’s current strengths—so you’re not betting roadmap on loud customers. Then positioning_recommendation turns that into practical messaging blocks, so when you do pick a segment, everyone can execute consistently. If you’re open to it, the next step would be a 30-minute working session where we map your segments and talk through what signals you have—no commitment, just see if the outputs would be useful.",
      "link": "https://www.onyx.app/1992493-15"
    },
    {
      "text": "Christopher Burke: I’m probably not the right person to commit to that. And honestly, our calendar is slammed this month. We’re mid-release.",
      "link": "https://www.onyx.app/1992493-16"
    },
    {
      "text": "Megan Foster: Got it. If you’re not the owner, who would you suggest I speak with—VP Product or Product Ops? I can also send a one-pager you can forward.",
      "link": "https://www.onyx.app/1992493-17"
    },
    {
      "text": "Christopher Burke: You can send something, but I can’t promise I’ll prioritize it. VP Product is tough to get time with right now.",
      "link": "https://www.onyx.app/1992493-18"
    },
    {
      "text": "Megan Foster: Understood. Before I send it, what would make it relevant enough to earn 30 minutes later—roadmap prioritization, segment selection, or aligning messaging for a go-to-market push?",
      "link": "https://www.onyx.app/1992493-19"
    },
    {
      "text": "Christopher Burke: Roadmap prioritization is always relevant, but we’re already using a framework. I’m not looking to change process right now.",
      "link": "https://www.onyx.app/1992493-20"
    },
    {
      "text": "Megan Foster: That makes sense—process change mid-release is the worst time. What we can do is position this as “analysis support,” not a process overhaul: connect two data sources, generate segment fit drivers, and output a short set of recommendations your team can sanity-check. If that doesn’t provide new insight, you stop. Would it be reasonable to revisit after your release—say in six weeks?",
      "link": "https://www.onyx.app/1992493-21"
    },
    {
      "text": "Christopher Burke: Maybe. I can’t really commit. Send the info and we’ll see.",
      "link": "https://www.onyx.app/1992493-22"
    },
    {
      "text": "Megan Foster: Will do. Last quick detail so I tailor it: what systems are you using for support tickets and CRM today?",
      "link": "https://www.onyx.app/1992493-23"
    },
    {
      "text": "Christopher Burke: Zendesk and Salesforce.",
      "link": "https://www.onyx.app/1992493-24"
    },
    {
      "text": "Megan Foster: Perfect—those are common for us. I’ll send a short overview focused on product planning: how the fit scoring highlights high-fit customers with unmet needs, and how positioning_recommendation turns that into editable messaging blocks and an objection-handling playbook tied to evidence. If you can, forward it to your Product Ops lead or VP Product. If you’d rather, just reply with who owns ICP/segment decisions and I’ll reach out directly.",
      "link": "https://www.onyx.app/1992493-25"
    },
    {
      "text": "Christopher Burke: Okay. Send it over. No promises on timing.",
      "link": "https://www.onyx.app/1992493-26"
    },
    {
      "text": "Megan Foster: Totally fair. Thanks for the time, Christopher—I’ll keep it concise and follow up after your release window unless I hear otherwise.",
      "link": "https://www.onyx.app/1992493-27"
    },
    {
      "text": "Christopher Burke: Sounds good. Bye.",
      "link": "https://www.onyx.app/1992493-28"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "megan_foster@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "christopher_burke@glimmersage_health.onyx.app"
    }
  ]
}