{
  "id": "FIREFLIES_3234567",
  "semantic_identifier": "3234567 - Meridianoak Holdings - sales_pitch - Discussion with Jonathan Mason",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-08-25 00:00:00",
  "metadata": {
    "meeting_date": "2025-08-25 00:00:00",
    "duration_min": "17"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-08"
      ],
      "year_month": "2025-08",
      "meeting_title": "3234567 - Meridianoak Holdings - sales_pitch - Discussion with Jonathan Mason",
      "organizer_email": "james_choi@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "James Choi: Hi Jonathan, James Choi here. Thanks for taking a few minutes—did I catch you at an okay time?",
      "link": "https://www.onyx.app/6913809-1"
    },
    {
      "text": "Jonathan Mason: Hey James, yeah, I’ve got about five minutes. What’s up?",
      "link": "https://www.onyx.app/6913809-2"
    },
    {
      "text": "James Choi: Perfect. I’ll keep it tight. I’m calling because a lot of teams like yours end up with two recurring problems: forecasting that feels like educated guessing near the end of the quarter, and SDR/AEs not always knowing which accounts to focus on first—or what to do next when deals start to stall. We built Sales_Accelerator to sit on top of your CRM and turn the signals you already have into a clear “here’s what’s likely to close” and “here’s what to do next” system.",
      "link": "https://www.onyx.app/6913809-3"
    },
    {
      "text": "Jonathan Mason: We’re on Salesforce today, and forecasting is… yeah, it’s a pain. But we already have reports and dashboards. What makes this different?",
      "link": "https://www.onyx.app/6913809-4"
    },
    {
      "text": "James Choi: Totally fair. The difference is we don’t just summarize stage data—we combine it with activity signals and cycle-time benchmarks to produce an explainable forecast. So instead of “it’s in stage 3, therefore 60%,” you’ll see drivers like: stage age is high, last touch was 12 days ago, no next meeting scheduled, and historically deals like this slip. Then you get commit/best-case/pipeline views and slippage diagnostics that tell you where the risk is coming from—not just that risk exists.",
      "link": "https://www.onyx.app/6913809-5"
    },
    {
      "text": "Jonathan Mason: Explainable forecast would help. Our leadership always asks “why” and we end up arguing about the numbers.",
      "link": "https://www.onyx.app/6913809-6"
    },
    {
      "text": "James Choi: Exactly. The “why” is what reduces the back-and-forth. And it’s not just for managers—Sales_Accelerator then turns those drivers into recommended next actions. For example: “Book the next meeting,” “loop in an exec,” or “run a re-engagement sequence,” based on patterns from similar deals and what’s currently missing in the opportunity.",
      "link": "https://www.onyx.app/6913809-7"
    },
    {
      "text": "Jonathan Mason: Okay. But you mentioned prioritization too—how does that work?",
      "link": "https://www.onyx.app/6913809-8"
    },
    {
      "text": "James Choi: Great question. One common use case is for SDR teams: we pull fit tiers—either from your existing scoring model or, if you’re using Customer_Analyzer, its fit score and positioning blocks—into Sales_Accelerator. Then it recommends the next set of accounts to contact, like the next 50, based on fit plus buying signals and your team’s capacity. And for each account it can generate segment-aligned openers and proof points so reps aren’t starting from a blank page.",
      "link": "https://www.onyx.app/6913809-9"
    },
    {
      "text": "Jonathan Mason: We don’t use Customer_Analyzer today, but we do have basic ICP tiers. Our SDRs still waste time on accounts that never convert.",
      "link": "https://www.onyx.app/6913809-10"
    },
    {
      "text": "James Choi: That’s a perfect starting point. We can ingest your tiers and CRM data first—no rip-and-replace. The immediate lift tends to be: SDRs spend less time debating what’s “good,” and managers get consistency in outreach focus. Then, as you mature it, you can layer in more signals and tighten the weighting over time.",
      "link": "https://www.onyx.app/6913809-11"
    },
    {
      "text": "Jonathan Mason: What data do you actually need from Salesforce to do the forecasting side?",
      "link": "https://www.onyx.app/6913809-12"
    },
    {
      "text": "James Choi: Typically: opportunity stages and timestamps, close dates, amounts, rep/segment attribution, and your activity data—calls, emails, meetings—either logged in Salesforce or via your engagement tool integration. Then we apply cycle-time benchmarks by segment and stage. The output is forecast by rep/segment/source, plus stage conversion and slippage diagnostics. One feature leaders like is scenario planning—like, “If we add 20 SQLs in Tier 1 this month, what’s the likely impact on pipeline coverage and expected revenue?” It turns planning into something you can test, not just hope.",
      "link": "https://www.onyx.app/6913809-13"
    },
    {
      "text": "Jonathan Mason: Scenario planning is interesting. We’re constantly debating whether to add top-of-funnel volume or focus on late-stage.",
      "link": "https://www.onyx.app/6913809-14"
    },
    {
      "text": "James Choi: Exactly the kind of debate this makes more concrete. And because it’s explainable, you can see which lever matters most—win rate, cycle time, stage conversion, or activity volume—rather than guessing.",
      "link": "https://www.onyx.app/6913809-15"
    },
    {
      "text": "Jonathan Mason: How long does it take to get value? I don’t want another tool that takes months to configure.",
      "link": "https://www.onyx.app/6913809-16"
    },
    {
      "text": "James Choi: Totally. For most teams, initial value comes fast because we’re sitting on top of the CRM you already use. A common rollout is: week one, connect Salesforce and activity data; week two, validate benchmarks and segments; then managers and reps start seeing the forecast drivers and “deal-at-risk” alerts. For SDR prioritization, once the tiers are mapped, you can start recommending the next accounts almost immediately.",
      "link": "https://www.onyx.app/6913809-17"
    },
    {
      "text": "Jonathan Mason: And reps actually follow the recommendations? Tools often get ignored.",
      "link": "https://www.onyx.app/6913809-18"
    },
    {
      "text": "James Choi: That’s the right concern. We focus on two things to drive adoption: first, recommendations are tied to outcomes reps care about—like “this deal is slipping because there’s no next meeting” rather than generic reminders. Second, the guidance is embedded into their workflow—so it’s not “go check another dashboard,” it’s “here are the top actions for today and the reasons.” Managers also use the same view in 1:1s, which reinforces it.",
      "link": "https://www.onyx.app/6913809-19"
    },
    {
      "text": "Jonathan Mason: Makes sense. What would you want from us to evaluate it properly?",
      "link": "https://www.onyx.app/6913809-20"
    },
    {
      "text": "James Choi: For a proper evaluation, I’d suggest a 30–45 minute working session with you and whoever owns forecasting or sales ops. We’d map your stages and segments, look at how you’re currently forecasting, and pick one of two starting points: (1) forecasting and deal-risk drivers for leadership visibility, or (2) SDR prioritization using your ICP tiers to improve outbound efficiency. Then we can scope a quick pilot with clear success metrics.",
      "link": "https://www.onyx.app/6913809-21"
    },
    {
      "text": "Jonathan Mason: I’m interested, especially in the forecasting drivers and slippage diagnostics. That’s where we get the most heat end of quarter.",
      "link": "https://www.onyx.app/6913809-22"
    },
    {
      "text": "James Choi: Great—then let’s center the session on that. If you’re open to it, we can also spend five minutes on how SDR prioritization would work using your existing ICP tiers, just to see if it’s worth a second phase.",
      "link": "https://www.onyx.app/6913809-23"
    },
    {
      "text": "Jonathan Mason: Yeah, that’s fine. Who should join on our side—our sales ops lead and maybe my VP?",
      "link": "https://www.onyx.app/6913809-24"
    },
    {
      "text": "James Choi: Sales ops is ideal, and if your VP can join for the first 15 minutes to align on what “good forecasting” means for them, even better. I’ll bring a quick walkthrough of the forecast views—commit/best-case/pipeline—and a sample of the explainable drivers so you can see what it looks like.",
      "link": "https://www.onyx.app/6913809-25"
    },
    {
      "text": "Jonathan Mason: Okay. Send me a couple of times next week. Tuesday afternoon or Thursday morning could work.",
      "link": "https://www.onyx.app/6913809-26"
    },
    {
      "text": "James Choi: Perfect. I’ll email you two options—Tuesday at 2:00 or Thursday at 10:00—and a short agenda: current process, data sources, forecast driver examples, and what a pilot would look like. Sound good?",
      "link": "https://www.onyx.app/6913809-27"
    },
    {
      "text": "Jonathan Mason: Sounds good. Send it over and I’ll get the right folks.",
      "link": "https://www.onyx.app/6913809-28"
    },
    {
      "text": "James Choi: Will do. Thanks Jonathan—appreciate the time today. I’ll follow up shortly with the invite and agenda.",
      "link": "https://www.onyx.app/6913809-29"
    },
    {
      "text": "Jonathan Mason: Thanks, James. Talk soon.",
      "link": "https://www.onyx.app/6913809-30"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "james_choi@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "jonathan_mason@meridianoak_holdings.onyx.app"
    }
  ]
}