{
  "id": "FIREFLIES_3673809",
  "semantic_identifier": "3673809 - Deltavantage Group - sales_pitch - Discussion with Mia Newman",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-08-16 00:00:00",
  "metadata": {
    "meeting_date": "2025-08-16 00:00:00",
    "duration_min": "37"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-08"
      ],
      "year_month": "2025-08",
      "meeting_title": "3673809 - Deltavantage Group - sales_pitch - Discussion with Mia Newman",
      "organizer_email": "camila_vega@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Camila Vega: Hi Mia, it’s Camila Vega—thanks for taking a few minutes. I’ll keep this short. I wanted to share how Sales_Accelerator can help Deltavantage Group turn your CRM and intent signals into very clear “who to contact next” and “what to say” guidance for SDRs and AEs.",
      "link": "https://www.onyx.app/2272715-1"
    },
    {
      "text": "Mia Newman: Hi Camila—sure, I’ve got a few minutes. What exactly does it do, and how is it different from what we already have in Salesforce?",
      "link": "https://www.onyx.app/2272715-2"
    },
    {
      "text": "Camila Vega: Great question. Sales_Accelerator sits on top of Salesforce rather than replacing it. The simplest way to describe it is: it takes the data you already have—account details, engagement signals, and your existing fit/segmentation work—and converts that into next-best actions. Two areas it’s strongest: (1) sales initiation recommendations, like your next 50 accounts to work and the best opener per account, and (2) early warnings when deals or sequences are going off track so reps can course-correct before pipeline slips.",
      "link": "https://www.onyx.app/2272715-3"
    },
    {
      "text": "Mia Newman: When you say “best opener,” is that just generic AI email writing? Because we’ve tried that and it didn’t really stick.",
      "link": "https://www.onyx.app/2272715-4"
    },
    {
      "text": "Camila Vega: Totally fair—this isn’t generic copy. The key is it anchors the message in your ICP and positioning. If you’re using Customer_Analyzer today—or even if you’re doing fit scoring in another way—Sales_Accelerator consumes that fit score and the positioning blocks, then recommends what angle to lead with and which proof points and objection handlers to include. And it shows the rationale: “Here’s why this account is a fit, here’s the segment, here’s the trigger we detected,” so it’s explainable and coachable.",
      "link": "https://www.onyx.app/2272715-5"
    },
    {
      "text": "Mia Newman: Okay. We do have some segmentation and an ICP model, but it’s not always reflected in SDR outreach. Reps either pick accounts randomly or chase whoever is loudest.",
      "link": "https://www.onyx.app/2272715-6"
    },
    {
      "text": "Camila Vega: That’s exactly the gap we’re designed to close. One common use case: your SDR team pulls fit tiers from Customer_Analyzer into Sales_Accelerator, and then the system recommends the next 50 accounts to contact—prioritized by fit plus intent/engagement. For each account, it generates a segment-aligned first touch: an email opener, a LinkedIn opener, and a call talk track, with the proof points that match that segment. So instead of “spray and pray,” it becomes “work the best list, with the best angle, consistently.”",
      "link": "https://www.onyx.app/2272715-7"
    },
    {
      "text": "Mia Newman: That sounds nice in theory. But we’ve got strict messaging and compliance reviews. I can’t have reps freelancing, and I can’t have a tool making claims we wouldn’t approve.",
      "link": "https://www.onyx.app/2272715-8"
    },
    {
      "text": "Camila Vega: 100%—and we built around that. The playbooks are customizable and centrally controlled: you can lock in approved positioning blocks, approved proof points, and approved objection handlers per segment. Reps aren’t generating net-new claims; they’re selecting from what you’ve already vetted. And because each suggestion links back to the fit drivers and segment messaging, it’s easy for managers to audit and for enablement to tune.",
      "link": "https://www.onyx.app/2272715-9"
    },
    {
      "text": "Mia Newman: How much lift is this to implement? We’re already juggling a few RevOps projects.",
      "link": "https://www.onyx.app/2272715-10"
    },
    {
      "text": "Camila Vega: Implementation is intentionally lightweight because it’s an execution layer. We connect to Salesforce, ingest your existing account and activity data, and then connect to Customer_Analyzer outputs—fit tier and segment positioning blocks. From there, you define a couple initiation playbooks: for example, “Tier 1 accounts in Segment A” and “Tier 2 accounts in Segment B.” Most teams start with one motion—SDR outbound—so you can see impact quickly without boiling the ocean.",
      "link": "https://www.onyx.app/2272715-11"
    },
    {
      "text": "Mia Newman: What does “impact” look like? Are you measuring meetings booked, reply rate, pipeline?",
      "link": "https://www.onyx.app/2272715-12"
    },
    {
      "text": "Camila Vega: The near-term metrics are reply rate, positive reply rate, and meeting creation—because we’re improving prioritization and first-touch relevance. We also track coverage: are reps actually working the right accounts consistently. And then downstream, we can correlate to pipeline creation by segment and by fit tier. The goal is to reduce wasted prospecting time and tighten the link between your ICP strategy and actual daily rep activity.",
      "link": "https://www.onyx.app/2272715-13"
    },
    {
      "text": "Mia Newman: Our SDR managers would love “coverage,” honestly. Right now it’s hard to tell if reps are ignoring the right accounts or if the list itself is wrong.",
      "link": "https://www.onyx.app/2272715-14"
    },
    {
      "text": "Camila Vega: Exactly. The “next 50 accounts” view makes it visible and consistent—managers can see what the tool recommended, what reps did, and where they deviated. And if something isn’t working—say Segment B messaging isn’t landing—you can adjust the playbook once and everyone’s outreach updates, rather than hoping each rep figures it out.",
      "link": "https://www.onyx.app/2272715-15"
    },
    {
      "text": "Mia Newman: How does it decide the “next 50”? If it’s just fit score, we already have that in a dashboard.",
      "link": "https://www.onyx.app/2272715-16"
    },
    {
      "text": "Camila Vega: Fit score is one input, but not the whole story. The recommendation combines fit tier with engagement and intent signals—things like recent site activity, email engagement, form fills, event attendance, and CRM events. It also considers practical constraints—owner, stage, recent touches—so you don’t spam accounts or recommend ones already in motion. The result is a prioritized, actionable queue, not a static dashboard.",
      "link": "https://www.onyx.app/2272715-17"
    },
    {
      "text": "Mia Newman: Got it. We’re also trying to make SDR messaging more consistent across segments. Would it handle different talk tracks?",
      "link": "https://www.onyx.app/2272715-18"
    },
    {
      "text": "Camila Vega: Yes. For each segment you define, Sales_Accelerator produces a playbook bundle: first-touch email, LinkedIn opener, call talk track, and a suggested meeting agenda. The talk track isn’t a script that sounds robotic; it’s a structured outline: the positioning angle, 2–3 proof points tailored to that segment, and likely objections with approved responses. That consistency is usually what improves conversion while keeping brand voice intact.",
      "link": "https://www.onyx.app/2272715-19"
    },
    {
      "text": "Mia Newman: This is resonating. If we did a pilot, what would you need from us?",
      "link": "https://www.onyx.app/2272715-20"
    },
    {
      "text": "Camila Vega: For a tight pilot focused on SDR outbound, I’d suggest: connect Salesforce, connect Customer_Analyzer (or your fit/segment export), pick two segments and one fit tier to start, and select one SDR team. Then we run it for a few weeks and compare: meetings created per rep, positive reply rate, and time-to-first-meeting against your baseline. Minimal disruption, and it’s easy to expand if the numbers move.",
      "link": "https://www.onyx.app/2272715-21"
    },
    {
      "text": "Mia Newman: Who typically owns this internally—RevOps or Sales Enablement?",
      "link": "https://www.onyx.app/2272715-22"
    },
    {
      "text": "Camila Vega: Usually RevOps owns the integration and reporting, while Enablement and SDR leadership own the playbooks and coaching. The nice thing is it creates a shared system: RevOps ensures the right data and rules, Enablement ensures messaging is approved and consistent, and managers use it day-to-day to drive activity.",
      "link": "https://www.onyx.app/2272715-23"
    },
    {
      "text": "Mia Newman: Okay. I think it’s worth a deeper look. Can we set up a longer demo with my SDR lead and our RevOps manager?",
      "link": "https://www.onyx.app/2272715-24"
    },
    {
      "text": "Camila Vega: Absolutely. If we do 45 minutes, I can show the “next 50 accounts” workflow, how the segment-based openers are generated with the rationale, and how managers review coverage and outcomes. Who are the right people on your side, and what does your calendar look like later this week or early next?",
      "link": "https://www.onyx.app/2272715-25"
    },
    {
      "text": "Mia Newman: Let’s do early next week. I’ll invite Jordan from RevOps and Priya, our SDR manager. Monday afternoon or Tuesday morning works.",
      "link": "https://www.onyx.app/2272715-26"
    },
    {
      "text": "Camila Vega: Perfect—Tuesday morning works well on my end. I’ll send a hold for Tuesday at 10:00am your time with a short agenda: current workflow, connect-the-dots with your fit tiers, and a live walkthrough of initiation recommendations and playbook controls. Sound good?",
      "link": "https://www.onyx.app/2272715-27"
    },
    {
      "text": "Mia Newman: Yes, send it over. If it really keeps reps aligned to our segments while improving meetings, we’ll be interested.",
      "link": "https://www.onyx.app/2272715-28"
    },
    {
      "text": "Camila Vega: Great—I’ll get that on your calendar, and I’ll include a quick pre-read so Jordan can see what data we’d pull from Salesforce and Customer_Analyzer. Thanks, Mia—looking forward to it.",
      "link": "https://www.onyx.app/2272715-29"
    },
    {
      "text": "Mia Newman: Thanks, Camila. Talk Tuesday.",
      "link": "https://www.onyx.app/2272715-30"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "camila_vega@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mia_newman@deltavantage_group.onyx.app"
    }
  ]
}