{
  "id": "FIREFLIES_3987557",
  "semantic_identifier": "3987557 - Nightfall Beacon Entertainment - sales_pitch - Discussion with Audrey Pierce",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-08-10 00:00:00",
  "metadata": {
    "meeting_date": "2025-08-10 00:00:00",
    "duration_min": "28"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-08"
      ],
      "year_month": "2025-08",
      "meeting_title": "3987557 - Nightfall Beacon Entertainment - sales_pitch - Discussion with Audrey Pierce",
      "organizer_email": "james_choi@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "James Choi: Hi Audrey—James Choi here. Thanks for taking a few minutes. I’ll be quick: I’m calling because a lot of teams end up guessing which customer segments to lean into next quarter, and it usually shows up later as higher support load or churn. I wanted to share how Customer_Analyzer helps make that decision more data-driven, especially when you’re balancing retention and support burden.",
      "link": "https://www.onyx.app/6648824-1"
    },
    {
      "text": "Audrey Pierce: Hey James—sure, I’ve got a few minutes. We’re actually in planning mode right now, so that’s relevant. What exactly does it do?",
      "link": "https://www.onyx.app/6648824-2"
    },
    {
      "text": "James Choi: Customer_Analyzer pulls together the customer signals you already have—things like CRM fields, product usage, onboarding surveys, support tickets, even notes from interviews—and turns them into a simple fit score by account and by segment. So instead of “we think mid-market is better,” you can see “mid-market scores 82 because adoption is fast and retention is strong, while SMB scores 54 because support burden is high and time-to-value is longer.”",
      "link": "https://www.onyx.app/6648824-3"
    },
    {
      "text": "Audrey Pierce: Okay. We have data in a few places, but we’ve never really unified it. When you say fit score—what is it actually measuring?",
      "link": "https://www.onyx.app/6648824-4"
    },
    {
      "text": "James Choi: Great question. The fit score is essentially “how well does this customer type match your product’s current strengths right now.” You can define the drivers—industry, company size, technographics, problem severity, willingness to pay, time-to-value, adoption patterns, support burden, churn risk signals. Then the system outputs a 0–100 score plus a driver breakdown so you can see why it’s high or low. It also compares segments side-by-side so your team can align quickly.",
      "link": "https://www.onyx.app/6648824-5"
    },
    {
      "text": "Audrey Pierce: That sounds useful, but we’re Nightfall Beacon Entertainment—we’re pretty particular about segments. We’re not a typical B2B SaaS. Does it still work if our segmentation is more… nuanced?",
      "link": "https://www.onyx.app/6648824-6"
    },
    {
      "text": "James Choi: Totally. The segmentation is flexible. Some teams do classic firmographics; others do “use case segments,” or “channel segments,” or “content library size,” or “live events vs on-demand.” The key is: as long as there are signals that correlate with outcomes—retention, expansion, conversion, support load—Customer_Analyzer can model it. We’re not forcing you into a template; we’re helping you test which segment definitions actually predict success.",
      "link": "https://www.onyx.app/6648824-7"
    },
    {
      "text": "Audrey Pierce: Interesting. Our biggest debate right now is which industries to prioritize next quarter. We’ve got retention data, but support tickets are telling a different story—some of our “best” customers are expensive to support.",
      "link": "https://www.onyx.app/6648824-8"
    },
    {
      "text": "James Choi: That is exactly the use case where we tend to see quick wins: prioritizing which industries to target next quarter using retention and support burden signals. Customer_Analyzer can weight both. For example, if an industry has high retention but also high support burden and slow time-to-value, the score might land in the middle—and the driver breakdown would explicitly show “retention strong, support burden high.” Then you can decide: do we invest in product improvements to lower support, or do we shift targeting toward the segment that renews *and* is lower-touch?",
      "link": "https://www.onyx.app/6648824-9"
    },
    {
      "text": "Audrey Pierce: That would help us have a less emotional conversation internally. Right now it’s a lot of opinions.",
      "link": "https://www.onyx.app/6648824-10"
    },
    {
      "text": "James Choi: Exactly. And it also reduces the “we picked the wrong segment” risk. One thing teams like is the recommended ICP profile the system generates based on observed outcomes—so it’s not just reporting; it’s suggesting: “Here’s what your best-fit customers have in common,” grounded in retention and expansion patterns.",
      "link": "https://www.onyx.app/6648824-11"
    },
    {
      "text": "Audrey Pierce: What data would you need from us to get started? I’m a little concerned about implementation drag.",
      "link": "https://www.onyx.app/6648824-12"
    },
    {
      "text": "James Choi: Fair. We keep the first step lightweight. For a first pass, we typically start with three inputs: basic CRM account fields, whatever you have for retention/renewal outcomes, and support ticket metadata—volume, categories, time-to-resolution. That alone usually lets us build an initial fit model for industry prioritization. If you also have product usage events, even better, but we don’t need perfection on day one.",
      "link": "https://www.onyx.app/6648824-13"
    },
    {
      "text": "Audrey Pierce: And how long until we see something actionable? We’re making next-quarter decisions pretty soon.",
      "link": "https://www.onyx.app/6648824-14"
    },
    {
      "text": "James Choi: If you can get us access to the core sources, you can usually see a first cut in a couple of weeks—often faster depending on the systems. The key deliverables would be: industry-by-industry fit scores, the driver breakdown for each, and a segment comparison view that makes it easy to pick where to place bets next quarter.",
      "link": "https://www.onyx.app/6648824-15"
    },
    {
      "text": "Audrey Pierce: How do you avoid it being a black box? I’ve seen “scores” before that no one trusts.",
      "link": "https://www.onyx.app/6648824-16"
    },
    {
      "text": "James Choi: Totally hear you. That’s why we emphasize the driver breakdown. Every score comes with “here’s what drove it”—like adoption speed, support burden, churn signals—so you can sanity check it. We also show segment comparisons and let you adjust the fit drivers and weights, so it reflects how *you* define success. The goal is something your product, marketing, and sales teams can all agree on, not a mysterious number.",
      "link": "https://www.onyx.app/6648824-17"
    },
    {
      "text": "Audrey Pierce: Okay, that’s helpful. If we did this, who typically owns it internally? Product? Marketing? RevOps?",
      "link": "https://www.onyx.app/6648824-18"
    },
    {
      "text": "James Choi: Often it’s a small triangle: someone from Product or Growth who cares about retention and time-to-value, someone from Marketing or Sales who cares about targeting and messaging, and RevOps or Analytics to help with data access. But for the initial “which industries next quarter” question, it can be just you plus whoever owns support ops and the CRM data.",
      "link": "https://www.onyx.app/6648824-19"
    },
    {
      "text": "Audrey Pierce: Makes sense. And you mentioned positioning recommendations—are you pitching that too, or is today mainly the fit scoring?",
      "link": "https://www.onyx.app/6648824-20"
    },
    {
      "text": "James Choi: Today I’d keep it focused on fit scoring because it maps directly to your immediate planning need. That said, once you know which segments are best-fit, we can also generate positioning recommendations—value props, differentiators, proof points, objection handling—tailored to those segments. But I don’t want to overload you on this call.",
      "link": "https://www.onyx.app/6648824-21"
    },
    {
      "text": "Audrey Pierce: Appreciate that. I’d like to see an example of what the output looks like—especially the segment comparison and the driver breakdown.",
      "link": "https://www.onyx.app/6648824-22"
    },
    {
      "text": "James Choi: Perfect. How about we do a 30-minute working session this week: I’ll walk you through a sample dashboard—fit scores by industry, support burden overlay, and how the recommended ICP is formed. If it resonates, we can talk about what data sources you have and what an initial pilot would look like for Nightfall Beacon Entertainment.",
      "link": "https://www.onyx.app/6648824-23"
    },
    {
      "text": "Audrey Pierce: Yeah, that would be useful. Can you loop in someone from my team who owns support analytics? They’ll have the best context on ticket drivers.",
      "link": "https://www.onyx.app/6648824-24"
    },
    {
      "text": "James Choi: Absolutely. Who should I include?",
      "link": "https://www.onyx.app/6648824-25"
    },
    {
      "text": "Audrey Pierce: Include Maya Chen—she runs support ops reporting. And I can bring our RevOps manager if schedules allow.",
      "link": "https://www.onyx.app/6648824-26"
    },
    {
      "text": "James Choi: Great—Maya Chen. I’ll send a calendar invite for a 30-minute session. Do you prefer Wednesday afternoon or Thursday morning?",
      "link": "https://www.onyx.app/6648824-27"
    },
    {
      "text": "Audrey Pierce: Thursday morning would be better—say 10:00?",
      "link": "https://www.onyx.app/6648824-28"
    },
    {
      "text": "James Choi: Thursday at 10:00 works. I’ll send the invite with a short agenda: (1) example fit estimation outputs—industry prioritization, (2) how support burden and retention are combined, (3) what data we’d need for a first-pass model, and (4) next steps if you want to pilot. Sound good?",
      "link": "https://www.onyx.app/6648824-29"
    },
    {
      "text": "Audrey Pierce: Sounds good. Send it over, and I’ll confirm with Maya.",
      "link": "https://www.onyx.app/6648824-30"
    },
    {
      "text": "James Choi: Will do. Thanks, Audrey—talk Thursday.",
      "link": "https://www.onyx.app/6648824-31"
    },
    {
      "text": "Audrey Pierce: Thanks, James. Talk then.",
      "link": "https://www.onyx.app/6648824-32"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "james_choi@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "audrey_pierce@nightfall_beacon_entertainment.onyx.app"
    }
  ]
}