{
  "id": "FIREFLIES_5293041",
  "semantic_identifier": "5293041 - Granitewave Consulting - sales_pitch - Discussion with Debra Hawkins",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-08-20 00:00:00",
  "metadata": {
    "meeting_date": "2025-08-20 00:00:00",
    "duration_min": "26"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-08"
      ],
      "year_month": "2025-08",
      "meeting_title": "5293041 - Granitewave Consulting - sales_pitch - Discussion with Debra Hawkins",
      "organizer_email": "mina_park@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Mina Park: Hi Debra—Mina Park here. Thanks for taking a few minutes. I work with teams that run on Salesforce or HubSpot and feel like pipeline reviews turn into a manual “hunt for problems” exercise. Is now still good?",
      "link": "https://www.onyx.app/4346530-1"
    },
    {
      "text": "Debra Hawkins: Yes, I’ve got a few minutes. And yes—pipeline reviews can definitely feel like that.",
      "link": "https://www.onyx.app/4346530-2"
    },
    {
      "text": "Mina Park: Perfect. I’ll keep it tight. The reason I reached out is we built Sales_Accelerator, which sits on top of your CRM and helps reps and managers convert signals into action—specifically by flagging risk early and giving a clear “what to do next” list so deals don’t silently slip. Before I jump in—what does your weekly pipeline hygiene look like today at Granitewave? More spreadsheet-driven, or inside the CRM?",
      "link": "https://www.onyx.app/4346530-3"
    },
    {
      "text": "Debra Hawkins: Mostly inside Salesforce, but there’s still a lot of manual work. Managers are asking reps for updates, and we’re chasing down basic stuff like next steps and stale stages.",
      "link": "https://www.onyx.app/4346530-4"
    },
    {
      "text": "Mina Park: That’s exactly the gap we focus on. One core capability is warning_alerts—proactive alerts when an account or opportunity is likely to slip or lose momentum. It’s not just “something changed,” it’s specific risk types like: inactivity—no touches in X days, stage aging beyond your benchmark, no upcoming meeting on the calendar, champion risk when it looks single-threaded, and forecast risk when a commit deal is weakening.",
      "link": "https://www.onyx.app/4346530-5"
    },
    {
      "text": "Debra Hawkins: We definitely have stage aging and “no next meeting” issues. Those are common.",
      "link": "https://www.onyx.app/4346530-6"
    },
    {
      "text": "Mina Park: Right—and the difference is we don’t stop at the alert. We route the alert wherever your team actually works—Slack, email, or directly in Salesforce—and we attach a recommended remediation action. So instead of a manager telling a rep “fix your pipeline,” the rep gets something like: “No upcoming meeting; recommended: send 3-option times and confirm decision process,” or “Single-threaded; recommended: schedule exec alignment or add technical stakeholder,” depending on the deal pattern.",
      "link": "https://www.onyx.app/4346530-7"
    },
    {
      "text": "Debra Hawkins: Interesting. How noisy does that get? Our reps already feel like they’re drowning in notifications.",
      "link": "https://www.onyx.app/4346530-8"
    },
    {
      "text": "Mina Park: Totally fair. The design goal is fewer, higher-confidence alerts that drive action. Two ways we keep it from becoming noise: first, alert thresholds are benchmarked to your process—your stage aging norms, your activity cadence, your cycle lengths—so we’re not firing generic rules. Second, we can roll alerts up into a prioritized queue: “here are the top 10 fixes that will most improve forecast health this week.” That way it’s not 40 pings; it’s an ordered list.",
      "link": "https://www.onyx.app/4346530-9"
    },
    {
      "text": "Debra Hawkins: That “top 10 fixes” sounds helpful. My managers spend time just figuring out what to focus on.",
      "link": "https://www.onyx.app/4346530-10"
    },
    {
      "text": "Mina Park: Exactly. One of the most common use cases is a manager running weekly pipeline hygiene automatically. Instead of spending the first 30 minutes of a pipeline meeting identifying gaps—missing next steps, stale opps, single-threaded deals—the system surfaces them ahead of time and assigns the highest-impact actions to the right rep. Then the meeting can be about deal strategy, not data cleanup.",
      "link": "https://www.onyx.app/4346530-11"
    },
    {
      "text": "Debra Hawkins: That would change the tone of our pipeline calls, honestly.",
      "link": "https://www.onyx.app/4346530-12"
    },
    {
      "text": "Mina Park: That’s what we hear. Quick question: when a deal slips at Granitewave, what’s the most common “we should’ve seen this sooner” reason? Is it lack of activity, unclear timeline, multi-threading, something else?",
      "link": "https://www.onyx.app/4346530-13"
    },
    {
      "text": "Debra Hawkins: Usually it’s that we thought we had a timeline, but there wasn’t a real next meeting locked in—or the deal was stuck with one champion and then went dark.",
      "link": "https://www.onyx.app/4346530-14"
    },
    {
      "text": "Mina Park: Then you’re in the sweet spot for warning_alerts. We can flag “no upcoming meeting” as a leading indicator, and “champion risk” when there’s only one contact actively engaged. We also look at stage aging—so if a deal has been in a stage longer than what wins typically look like, you’ll get an early warning before it becomes a forecast surprise.",
      "link": "https://www.onyx.app/4346530-15"
    },
    {
      "text": "Debra Hawkins: And this is all on top of Salesforce? We don’t want another CRM.",
      "link": "https://www.onyx.app/4346530-16"
    },
    {
      "text": "Mina Park: Exactly—Sales_Accelerator is an execution layer. We’re not asking reps to live somewhere else. We sit on top of Salesforce/HubSpot and push actions back into the systems you already use. Reps see recommended next steps, managers see risk and coverage, and ops can tune the rules and benchmarks without rebuilding your process.",
      "link": "https://www.onyx.app/4346530-17"
    },
    {
      "text": "Debra Hawkins: Okay. How much setup is involved? We don’t have endless ops bandwidth.",
      "link": "https://www.onyx.app/4346530-18"
    },
    {
      "text": "Mina Park: Setup is typically lightweight because we start with what’s already in your CRM—stages, activity logs, meetings, contacts, and notes. Then we configure the alert types you care about most—like inactivity, stage aging, no upcoming meeting, and champion risk—and decide where to route them. If you want, we can start with just two alert categories and the “top 10 fixes” queue for managers, prove it reduces slippage, and expand from there.",
      "link": "https://www.onyx.app/4346530-19"
    },
    {
      "text": "Debra Hawkins: That phased approach makes sense. Do you integrate with anything else we use?",
      "link": "https://www.onyx.app/4346530-20"
    },
    {
      "text": "Mina Park: Yes—especially if you’re already using something like Customer_Analyzer. Sales_Accelerator can consume fit scores and positioning blocks so the alerts can prioritize “high-fit but at-risk” deals first. In practice, that means if an account is a strong match but it’s going stale, it bubbles to the top for intervention rather than getting lost among lower-fit noise.",
      "link": "https://www.onyx.app/4346530-21"
    },
    {
      "text": "Debra Hawkins: We do have something like that—fit scoring. Our issue is acting on it consistently.",
      "link": "https://www.onyx.app/4346530-22"
    },
    {
      "text": "Mina Park: Exactly. A lot of teams have insights, but not a consistent, explainable system that turns them into daily actions. The outcome we aim for is: fewer surprise slips, cleaner pipeline hygiene without nagging, and a more reliable forecast because risk is surfaced early with a specific fix attached.",
      "link": "https://www.onyx.app/4346530-23"
    },
    {
      "text": "Debra Hawkins: What would you need from me to see if this fits?",
      "link": "https://www.onyx.app/4346530-24"
    },
    {
      "text": "Mina Park: For the next step, I’d suggest a 30-minute working session with you and whoever owns Salesforce/pipeline cadence—maybe sales ops or a frontline manager. We’ll map your current pipeline hygiene flow, pick the two or three alert types that would have caught your last few slips, and show what the rep task queue and manager view would look like in your environment. If it’s compelling, we can outline a short pilot.",
      "link": "https://www.onyx.app/4346530-25"
    },
    {
      "text": "Debra Hawkins: I’m open to that. I’d want our Sales Ops lead on it.",
      "link": "https://www.onyx.app/4346530-26"
    },
    {
      "text": "Mina Park: Great. Who is the right Sales Ops contact, and what does your calendar look like early next week—Tuesday or Wednesday?",
      "link": "https://www.onyx.app/4346530-27"
    },
    {
      "text": "Debra Hawkins: Our Sales Ops lead is Jordan Lee. Tuesday afternoon could work.",
      "link": "https://www.onyx.app/4346530-28"
    },
    {
      "text": "Mina Park: Perfect—how about Tuesday at 2:00 pm your time for 30 minutes? I’ll send an invite to you and Jordan, and I’ll include a couple of prep questions—mainly your stage definitions and what you consider “stale” by stage—so we can make it concrete.",
      "link": "https://www.onyx.app/4346530-29"
    },
    {
      "text": "Debra Hawkins: Tuesday at 2 works. Send it over and I’ll loop Jordan in if needed.",
      "link": "https://www.onyx.app/4346530-30"
    },
    {
      "text": "Mina Park: Will do. Thanks, Debra—looking forward to showing you how the alerts and the prioritized fix list can take the manual chasing out of pipeline hygiene.",
      "link": "https://www.onyx.app/4346530-31"
    },
    {
      "text": "Debra Hawkins: Thanks, Mina. Talk Tuesday.",
      "link": "https://www.onyx.app/4346530-32"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mina_park@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "debra_hawkins@granitewave_consulting.onyx.app"
    }
  ]
}