{
  "id": "FIREFLIES_5417505",
  "semantic_identifier": "5417505 - Quicksilver Freight - sales_pitch - Discussion with Noor Farooq",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-08-13 00:00:00",
  "metadata": {
    "meeting_date": "2025-08-13 00:00:00",
    "duration_min": "44"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-08"
      ],
      "year_month": "2025-08",
      "meeting_title": "5417505 - Quicksilver Freight - sales_pitch - Discussion with Noor Farooq",
      "organizer_email": "megan_foster@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Megan Foster: Hi Noor—Megan Foster here. Thanks for taking a few minutes. I’ll keep this short: I wanted to share how Sales_Accelerator helps teams like Quicksilver Freight tighten forecast accuracy and catch deal slippage early, without ripping out your CRM.",
      "link": "https://www.onyx.app/3870371-1"
    },
    {
      "text": "Noor Farooq: Hi Megan—sure. We can do a quick overview. What is it exactly, and how is it different from what we already do in Salesforce?",
      "link": "https://www.onyx.app/3870371-2"
    },
    {
      "text": "Megan Foster: Great question. Sales_Accelerator sits on top of Salesforce or HubSpot as a sales execution layer. It doesn’t replace your CRM—it uses your existing stage data plus activity signals like calls, emails, meetings, and stage age. Then it produces explainable forecasts and flags risk drivers—so you’re not just seeing “pipeline is light,” you’re seeing *why* and what to do about it.",
      "link": "https://www.onyx.app/3870371-3"
    },
    {
      "text": "Noor Farooq: We already have dashboards. Our challenge is that the numbers still feel… optimistic until the last two weeks of the quarter.",
      "link": "https://www.onyx.app/3870371-4"
    },
    {
      "text": "Megan Foster: That’s exactly the problem we designed for. Our core feature is sales_forecast: opportunity- and pipeline-level forecasting that blends CRM stage with activity signals and cycle-time benchmarks. It gives you commit, best-case, and pipeline views, but also slippage diagnostics—like which stages are aging, where conversion is dropping, and which deals have gone “quiet.”",
      "link": "https://www.onyx.app/3870371-5"
    },
    {
      "text": "Noor Farooq: Okay. When you say “quiet,” what do you mean? We have reps who don’t log everything.",
      "link": "https://www.onyx.app/3870371-6"
    },
    {
      "text": "Megan Foster: Totally normal. We look at multiple drivers, so it’s not dependent on perfect data entry. For example: last meaningful touch, whether there’s a next meeting scheduled, stage age relative to your historical cycle times, and conversion rates for similar deals. If you *do* have activity capture via email/calendar integrations, it becomes even stronger—but we can still add value with what’s in Salesforce today.",
      "link": "https://www.onyx.app/3870371-7"
    },
    {
      "text": "Noor Farooq: And it can actually tell me what’s driving the forecast? That’s been a sticking point—leadership doesn’t trust a “black box.”",
      "link": "https://www.onyx.app/3870371-8"
    },
    {
      "text": "Megan Foster: Yes—explainability is a big differentiator. Every forecast rollup is backed by drivers you can click into: “This segment is down because Stage 2-to-3 conversion dropped 12%,” or “These five deals are at risk because stage age is 2x normal and there’s no next meeting.” The goal is to make it defensible in forecast calls.",
      "link": "https://www.onyx.app/3870371-9"
    },
    {
      "text": "Noor Farooq: That would help. We spend a lot of time arguing about numbers instead of fixing the pipeline. How does it help us fix things, though?",
      "link": "https://www.onyx.app/3870371-10"
    },
    {
      "text": "Megan Foster: That’s where the sales ops use case comes in. Sales_Accelerator shows stage-to-stage conversion by segment and rep so you can identify bottlenecks—then it recommends process adjustments and helps you monitor if they’re working. A common example is adding a security or procurement step earlier so deals don’t stall late. In your world—freight and logistics—I often see stalls around compliance paperwork, carrier onboarding, or IT integrations. If those steps are happening too late, you get end-of-quarter surprises.",
      "link": "https://www.onyx.app/3870371-11"
    },
    {
      "text": "Noor Farooq: That hits close to home. We’ve had deals sit because requirements surface late—then we lose momentum.",
      "link": "https://www.onyx.app/3870371-12"
    },
    {
      "text": "Megan Foster: Exactly. Instead of discovering that in week 12, you’d see the pattern in week 3: “Deals in Segment A are aging in this stage, and reps with earlier ‘requirements confirmed’ steps convert faster.” Then you can operationalize that into your process, coaching, or even stage definitions.",
      "link": "https://www.onyx.app/3870371-13"
    },
    {
      "text": "Noor Farooq: Interesting. How much work is it to set up? We don’t have a lot of bandwidth in ops right now.",
      "link": "https://www.onyx.app/3870371-14"
    },
    {
      "text": "Megan Foster: The initial lift is usually light because we’re layering on top of the CRM. We connect to Salesforce, ingest opportunity and stage history, and map a few key fields. Then we calibrate benchmarks like typical stage duration and conversion by segment. Most teams can start seeing useful diagnostics quickly, then refine over time.",
      "link": "https://www.onyx.app/3870371-15"
    },
    {
      "text": "Noor Farooq: We also have different motions—mid-market is faster, enterprise is slower. Does it separate those out?",
      "link": "https://www.onyx.app/3870371-16"
    },
    {
      "text": "Megan Foster: Yes. Forecasts can be broken down by segment, source, rep, and motion—so you’re not comparing apples to oranges. The scenario planning is useful too: you can ask, “If we add X more SQLs in our best segment, what’s the expected revenue impact?” It helps ops and leadership align on what to do, not just what happened.",
      "link": "https://www.onyx.app/3870371-17"
    },
    {
      "text": "Noor Farooq: Scenario planning sounds helpful. We’re constantly debating whether we need more top-of-funnel or if we just need to unblock late-stage deals.",
      "link": "https://www.onyx.app/3870371-18"
    },
    {
      "text": "Megan Foster: We can support both perspectives with data. You’ll see whether the problem is pipeline coverage, stage conversion, or slippage. And because the drivers are transparent, it turns into an action-oriented conversation: “These deals need next meetings scheduled,” “These are stalled because procurement step is missing,” “This segment is converting fine but needs more volume.”",
      "link": "https://www.onyx.app/3870371-19"
    },
    {
      "text": "Noor Farooq: How do you handle rep adoption? If it’s yet another tool they have to live in, it’ll be a hard sell internally.",
      "link": "https://www.onyx.app/3870371-20"
    },
    {
      "text": "Megan Foster: We try to meet reps where they already work. The idea is not to create a second CRM; it’s to give them a clear view of what’s at risk and what’s driving their number. For managers and sales ops, it reduces the manual spreadsheet work before forecast calls. We typically position it as: fewer status-chasing meetings, more targeted coaching.",
      "link": "https://www.onyx.app/3870371-21"
    },
    {
      "text": "Noor Farooq: Makes sense. If we wanted to evaluate this, what would you need from us?",
      "link": "https://www.onyx.app/3870371-22"
    },
    {
      "text": "Megan Foster: For a proper assessment, I’d suggest a longer working session—maybe 45 minutes—with you and whoever owns forecasting or pipeline reporting. We’d cover: your current Salesforce setup, how you define stages, what “commit” means internally, and where you’ve seen the biggest forecast misses. If you can share a few anonymized examples of slipped deals, we can show how Sales_Accelerator would have flagged them earlier and what the drivers would have been.",
      "link": "https://www.onyx.app/3870371-23"
    },
    {
      "text": "Noor Farooq: That seems reasonable. I’d want our sales ops manager involved—she owns the dashboards and forecast meetings.",
      "link": "https://www.onyx.app/3870371-24"
    },
    {
      "text": "Megan Foster: Perfect. If you’re open to it, I’ll send a calendar link for a deeper dive: we can tailor it to Quicksilver Freight’s segments and look at stage-to-stage conversion and slippage patterns you’re seeing. Even if you don’t move forward, you’ll walk away with a clearer picture of where the bottleneck is.",
      "link": "https://www.onyx.app/3870371-25"
    },
    {
      "text": "Noor Farooq: Okay—let’s do that. Next week is better for me. Tuesday or Wednesday afternoon?",
      "link": "https://www.onyx.app/3870371-26"
    },
    {
      "text": "Megan Foster: Wednesday afternoon works. How about 2:00 PM your time? I’ll invite you and your sales ops manager, and I’ll include a short agenda: current forecast process, bottlenecks by stage, and what an explainable forecast model would look like layered on Salesforce.",
      "link": "https://www.onyx.app/3870371-27"
    },
    {
      "text": "Noor Farooq: 2:00 PM Wednesday works. Send it over and I’ll add our ops lead.",
      "link": "https://www.onyx.app/3870371-28"
    },
    {
      "text": "Megan Foster: Great—thanks Noor. I’ll send the invite today along with a couple of prep questions so we can make the session useful. Talk next Wednesday.",
      "link": "https://www.onyx.app/3870371-29"
    },
    {
      "text": "Noor Farooq: Sounds good. Talk then.",
      "link": "https://www.onyx.app/3870371-30"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "megan_foster@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "noor_farooq@quicksilver_freight.onyx.app"
    }
  ]
}