{
  "id": "FIREFLIES_6974822",
  "semantic_identifier": "6974822 - Echostone Industries - sales_call - Discussion with Terry Bennett",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-08-26 00:00:00",
  "metadata": {
    "meeting_date": "2025-08-26 00:00:00",
    "duration_min": "24"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-08"
      ],
      "year_month": "2025-08",
      "meeting_title": "6974822 - Echostone Industries - sales_call - Discussion with Terry Bennett",
      "organizer_email": "sneha_reddy@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Sneha Reddy: Hi Terry—good to see you again. Last time you mentioned your team is drowning in repeated customer issues across Zendesk and Intercom, and that it’s hard to connect those themes back to Jira work and account impact in Salesforce. Today I wanted to show how Issue_Tracker specifically tackles that “same issue, different words, different places” problem and helps product leadership prioritize what to fix next.",
      "link": "https://www.onyx.app/2255520-1"
    },
    {
      "text": "Terry Bennett: Hi Sneha. Yeah, that’s still the pain. We’ve got a lot of noise and not enough clarity. I’m open to hearing it, but I’m also wary of adding another layer that our support and product teams have to babysit.",
      "link": "https://www.onyx.app/2255520-2"
    },
    {
      "text": "Sneha Reddy: Totally fair. The way Issue_Tracker is designed, it’s not meant to replace Zendesk or Jira—it sits between them. Two pieces I want to focus on for Echostone: first, the integrations/connectors so you can ingest from Zendesk/Intercom and sync to Jira/Linear with back-links; second, the way it ties issue clusters to customer/value context—Salesforce or HubSpot plus your Customer_Analyzer fit tiers—so the “what matters most” ranking isn’t just volume-based.",
      "link": "https://www.onyx.app/2255520-3"
    },
    {
      "text": "Terry Bennett: Okay. The connector story is the make-or-break for us. We’ve been burned by “integrations” that are basically a CSV export plus some brittle mapping.",
      "link": "https://www.onyx.app/2255520-4"
    },
    {
      "text": "Sneha Reddy: Understood. The connectors are bi-directional where it matters. On ingest, we pull tickets and conversations from Zendesk/Intercom, and we keep the original links so anyone can click back to the source thread. On the delivery side, when a cluster is escalated into engineering work, we sync metadata into Jira—like theme, impacted customers, and priority reason—and we also keep the backlink from the Jira issue to the cluster so PMs don’t lose the context.",
      "link": "https://www.onyx.app/2255520-5"
    },
    {
      "text": "Terry Bennett: And field mapping? Our Zendesk is… customized. Different forms per product line, and tags are inconsistent.",
      "link": "https://www.onyx.app/2255520-6"
    },
    {
      "text": "Sneha Reddy: We support field mapping and rules—so you can map your forms, tags, custom fields into a normalized issue object. And you can set dedupe rules, like “if these fields match, treat as same theme,” or “keep separate if product line differs.” The goal is: no duplicate data entry, and your existing tools remain the systems of record.",
      "link": "https://www.onyx.app/2255520-7"
    },
    {
      "text": "Terry Bennett: You said “dedupe rules.” That’s where I start to get nervous. We tried clustering in another tool and it merged unrelated issues—especially when enterprise customers describe problems in their own jargon. Support lost trust in it fast.",
      "link": "https://www.onyx.app/2255520-8"
    },
    {
      "text": "Sneha Reddy: That’s a common failure mode. Issue_Tracker clusters based on multiple signals, not just keyword similarity, and you can tune it. Plus, there’s a feedback loop: when your team splits or merges clusters, the model learns your patterns.",
      "link": "https://www.onyx.app/2255520-9"
    },
    {
      "text": "Terry Bennett: How much effort is “tune it”? Because my support ops team is two people. If they have to spend hours correcting merges, it defeats the purpose.",
      "link": "https://www.onyx.app/2255520-10"
    },
    {
      "text": "Sneha Reddy: The typical rollout we do is start narrow: one channel—say Zendesk—and one product area. For the first couple weeks we monitor clustering quality and set guardrails. Once it’s stable, we expand. The time burden is usually front-loaded.",
      "link": "https://www.onyx.app/2255520-11"
    },
    {
      "text": "Terry Bennett: “Usually” is doing a lot of work there. Our data is messy. And we have segmentation nuances—Tier-1 ICP accounts use different terms than SMB. I worry we’ll either get false merges that hide real issues, or fragmented clusters that don’t actually reduce noise.",
      "link": "https://www.onyx.app/2255520-12"
    },
    {
      "text": "Sneha Reddy: That’s exactly why tying in Customer_Analyzer fit tiers helps. When the system sees the same underlying theme across segments, it can keep it grouped but still show you “how it manifests” by segment and channel. And on prioritization, Product leadership can weight the cluster by ICP tier—so a cluster impacting Tier-1 accounts rises above a similar-volume cluster in low-fit segments.",
      "link": "https://www.onyx.app/2255520-13"
    },
    {
      "text": "Terry Bennett: The prioritization piece is attractive. But again—if the clustering is off, the weighting doesn’t matter. We’ll just be confidently prioritizing the wrong thing.",
      "link": "https://www.onyx.app/2255520-14"
    },
    {
      "text": "Sneha Reddy: Fair. Let me ask: what would “good enough” clustering look like for you? Like, 80% accurate without manual corrections? Or is it higher?",
      "link": "https://www.onyx.app/2255520-15"
    },
    {
      "text": "Terry Bennett: For this to be credible internally, I’d need it to be very high. Our PMs will not tolerate another “AI bucket” that’s wrong half the time. And support won’t adopt it if they have to do cleanup.",
      "link": "https://www.onyx.app/2255520-16"
    },
    {
      "text": "Sneha Reddy: Makes sense. One way we reduce risk is doing a short proof-of-value: ingest, say, 60 days of Zendesk tickets plus Intercom conversations for one product line, connect Salesforce for account tier, and then measure: cluster precision, merge/split rates, and the time it takes your team to validate. If it’s not meeting the bar, you don’t proceed.",
      "link": "https://www.onyx.app/2255520-17"
    },
    {
      "text": "Terry Bennett: That sounds like a pilot. What does that require on our side? Access, security review, and then someone has to be accountable to validate results. We’re slammed this quarter.",
      "link": "https://www.onyx.app/2255520-18"
    },
    {
      "text": "Sneha Reddy: On your side, it’s mainly API access to Zendesk/Intercom and read access to Salesforce objects for account value and segmentation fields. We can start read-only. Validation can be as lightweight as weekly 30-minute reviews with one support lead and one PM.",
      "link": "https://www.onyx.app/2255520-19"
    },
    {
      "text": "Terry Bennett: Security is going to be non-trivial. Also, our Salesforce data isn’t clean. Account value and segmentation are outdated in places. If Issue_Tracker depends on that, we’ll end up with misleading “business impact” prioritization.",
      "link": "https://www.onyx.app/2255520-20"
    },
    {
      "text": "Sneha Reddy: We can still prioritize by signals other than Salesforce value—like number of impacted customers, severity, open pipeline risk if you connect opportunities. But yes, the richer the CRM context, the better.",
      "link": "https://www.onyx.app/2255520-21"
    },
    {
      "text": "Terry Bennett: We’re not connecting opportunity data to another tool right now. That’s a sensitive topic internally. And honestly, the last thing I want is support tickets being used to escalate deal panic across sales.",
      "link": "https://www.onyx.app/2255520-22"
    },
    {
      "text": "Sneha Reddy: Totally. We can keep it to account tier and basic firmographics, or even just Customer_Analyzer tiers, without opportunities. The core win is giving product leadership a defensible, searchable history of decisions—why a theme was prioritized, and where it stands in delivery tracking in Jira.",
      "link": "https://www.onyx.app/2255520-23"
    },
    {
      "text": "Terry Bennett: The history part is good. But we already do some of that in Confluence and Jira labels. It’s messy, but it exists. I’m trying to understand what would materially change day-to-day.",
      "link": "https://www.onyx.app/2255520-24"
    },
    {
      "text": "Sneha Reddy: Day-to-day: support stops triaging the same issue ten different ways; PMs see a unified theme with evidence and impacted customers; engineering gets a single Jira link with context; leadership gets a ranked list grounded in ICP tier rather than whoever shouts loudest. The connector backbone is what keeps it from becoming another silo.",
      "link": "https://www.onyx.app/2255520-25"
    },
    {
      "text": "Terry Bennett: I get the promise. I’m just not convinced the clustering won’t become the bottleneck. Especially with the language variation problem I mentioned. And we’ve had tooling sprawl—people resist adopting “one more dashboard.”",
      "link": "https://www.onyx.app/2255520-26"
    },
    {
      "text": "Sneha Reddy: If adoption is the concern, we can meet users where they are: support stays in Zendesk, engineering stays in Jira, and Issue_Tracker is the layer that connects the dots. Most users don’t have to live inside it.",
      "link": "https://www.onyx.app/2255520-27"
    },
    {
      "text": "Terry Bennett: But someone has to. Someone has to own the clusters, resolve disputes, and decide what’s the “issue object.” That becomes a new operational role.",
      "link": "https://www.onyx.app/2255520-28"
    },
    {
      "text": "Sneha Reddy: It can be part of an existing role—support ops or a product ops function. And we’d help set up workflows: when to split/merge, how to escalate, and what “done” means.",
      "link": "https://www.onyx.app/2255520-29"
    },
    {
      "text": "Terry Bennett: We don’t have product ops. And support ops is at capacity. So I’m trying to be realistic: even if the tool works, the operational overhead might sink it.",
      "link": "https://www.onyx.app/2255520-30"
    },
    {
      "text": "Sneha Reddy: Understood. Given that, would it be helpful if we scoped the pilot to require almost no ongoing governance—just measure whether it can auto-cluster accurately enough with minimal intervention?",
      "link": "https://www.onyx.app/2255520-31"
    },
    {
      "text": "Terry Bennett: Maybe. But I’m not sure we can even prioritize a pilot this quarter. We’re in the middle of a Zendesk workflow overhaul, and we’re standardizing Jira projects. Introducing another integration point right now feels risky.",
      "link": "https://www.onyx.app/2255520-32"
    },
    {
      "text": "Sneha Reddy: That’s fair timing-wise. If now isn’t right for a pilot, the next step could be lighter: we can do a technical validation session—30 minutes—with your admin to review the connector requirements and see if there are any blockers.",
      "link": "https://www.onyx.app/2255520-33"
    },
    {
      "text": "Terry Bennett: I don’t think I want to pull admins into this yet. It’ll trigger a bunch of internal process. Let me be candid: I like the prioritization-by-ICP concept, but the clustering trust issue plus our resourcing makes this a hard sell right now.",
      "link": "https://www.onyx.app/2255520-34"
    },
    {
      "text": "Sneha Reddy: I appreciate the candor. If I summarize: the value is there, but you’re worried about false merges/fragmented clusters eroding trust, and you don’t have capacity to govern a new issue layer during your Zendesk and Jira standardization. Is that accurate?",
      "link": "https://www.onyx.app/2255520-35"
    },
    {
      "text": "Terry Bennett: Yes, that’s it. Also, security and CRM data quality. Too many dependencies.",
      "link": "https://www.onyx.app/2255520-36"
    },
    {
      "text": "Sneha Reddy: Got it. Would it make sense to revisit after your Zendesk overhaul is complete—say, in eight to ten weeks—when your taxonomy and fields are more stable? That actually improves clustering quality.",
      "link": "https://www.onyx.app/2255520-37"
    },
    {
      "text": "Terry Bennett: That could be a better time. I can’t promise anything, but you can circle back. For now, I don’t want to move into procurement or a pilot.",
      "link": "https://www.onyx.app/2255520-38"
    },
    {
      "text": "Sneha Reddy: Understood. I’ll send a short recap with what we discussed—especially the dependency list and how we’d mitigate clustering risk—so you have it on hand. And I’ll follow up in a couple months to see where things stand.",
      "link": "https://www.onyx.app/2255520-39"
    },
    {
      "text": "Terry Bennett: Sounds good. Thanks, Sneha.",
      "link": "https://www.onyx.app/2255520-40"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "sneha_reddy@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "terry_bennett@echostone_industries.onyx.app"
    }
  ]
}