{
  "id": "FIREFLIES_7122903",
  "semantic_identifier": "7122903 - Radiant Vale Utilities - sales_pitch - Discussion with Sophia Chen",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-08-06 00:00:00",
  "metadata": {
    "meeting_date": "2025-08-06 00:00:00",
    "duration_min": "30"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-08"
      ],
      "year_month": "2025-08",
      "meeting_title": "7122903 - Radiant Vale Utilities - sales_pitch - Discussion with Sophia Chen",
      "organizer_email": "camila_vega@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Camila Vega: Hi Sophia—Camila Vega here. Thanks for taking a few minutes. I’ll keep this tight. I’m calling because we built Issue_Tracker to help support and product teams stop drowning in duplicate tickets by turning raw customer noise into a small set of clear, prioritized issue themes.",
      "link": "https://www.onyx.app/8102147-1"
    },
    {
      "text": "Sophia Chen: Hi Camila. Okay—what do you mean by “issue themes,” exactly?",
      "link": "https://www.onyx.app/8102147-2"
    },
    {
      "text": "Camila Vega: Great question. Issue_Tracker connects to your support channels—think Zendesk, Intercom, email—and continuously ingests tickets, chats, even call-note summaries. Then our issue clustering automatically deduplicates and groups them into semantic clusters, like “billing portal times out on Safari” or “meter data export missing columns,” instead of 300 separate tickets scattered across agents and queues.",
      "link": "https://www.onyx.app/8102147-3"
    },
    {
      "text": "Sophia Chen: We already tag tickets and we have some macros. How is this different from tagging?",
      "link": "https://www.onyx.app/8102147-4"
    },
    {
      "text": "Camila Vega: Tags are a start, but they depend on perfect, consistent agent behavior—and they don’t usually merge duplicates across wording differences. Clustering looks at the actual text and groups similar reports together, then suggests a cluster name, highlights top phrases, and gives you representative examples. You can also merge or split clusters with guardrails, so you’re not locked into a black box.",
      "link": "https://www.onyx.app/8102147-5"
    },
    {
      "text": "Sophia Chen: Hmm. We’re in utilities, so our issues can be pretty specific. Also, we get a lot of “my bill seems wrong” that’s not always the same root cause.",
      "link": "https://www.onyx.app/8102147-6"
    },
    {
      "text": "Camila Vega: Totally. That’s why each cluster can carry structured context beyond “same complaint.” You can configure rules by product area, platform, severity, or keywords, and you can label suspected root cause categories—bug vs UX vs missing feature vs integration. For “bill seems wrong,” you might end up with separate clusters like “TOU rate misapplied,” “estimated read confusion,” “PDF bill totals mismatch,” each with links back to the original conversations.",
      "link": "https://www.onyx.app/8102147-7"
    },
    {
      "text": "Sophia Chen: Okay. What’s the output supposed to be? We still have to send things to engineering in Jira.",
      "link": "https://www.onyx.app/8102147-8"
    },
    {
      "text": "Camila Vega: Exactly—and we’re not trying to replace Jira. Issue_Tracker standardizes an “issue object” that stays linked to the source tickets and can be routed downstream. Practically, support ops can take, say, 5,000 monthly tickets and have them clustered into around 80 active themes, then route the top 10 clusters weekly to product/engineering—each with representative examples and the list of affected customers.",
      "link": "https://www.onyx.app/8102147-9"
    },
    {
      "text": "Sophia Chen: We don’t do 5,000 tickets a month. And we already have a weekly triage meeting with product.",
      "link": "https://www.onyx.app/8102147-10"
    },
    {
      "text": "Camila Vega: Makes sense. Even at smaller volumes, the big benefit is visibility and defensibility. Instead of someone saying “I feel like we’re hearing this a lot,” you can show volume trends, what customers are impacted, and the supporting evidence—without manually hunting for examples. It reduces duplicate triage work and helps prevent widespread issues from being underestimated because they’re scattered across many tickets.",
      "link": "https://www.onyx.app/8102147-11"
    },
    {
      "text": "Sophia Chen: I’m trying to understand the lift. Setting up clustering sounds like a project. We’re short-staffed.",
      "link": "https://www.onyx.app/8102147-12"
    },
    {
      "text": "Camila Vega: The initial setup is usually lightweight: connect the support channel, map a few fields, and define any rules you care about—like segment or product line. The system starts clustering automatically, and your team can refine it via merge/split as you go. It’s designed to reduce work, not create a new taxonomy project.",
      "link": "https://www.onyx.app/8102147-13"
    },
    {
      "text": "Sophia Chen: Integrations are always the hard part for us. Security review, vendor onboarding, all that. What data do you ingest?",
      "link": "https://www.onyx.app/8102147-14"
    },
    {
      "text": "Camila Vega: Primarily the text and metadata you already have in the support system—ticket body, subject, timestamps, basic attributes. And we keep links back to the system of record so you can always trace a cluster to the original sources. We can also scope what’s ingested depending on your policies.",
      "link": "https://www.onyx.app/8102147-15"
    },
    {
      "text": "Sophia Chen: We’re pretty strict. Also, our tooling isn’t Zendesk. We have an older platform plus some shared inboxes.",
      "link": "https://www.onyx.app/8102147-16"
    },
    {
      "text": "Camila Vega: Got it. If it’s a custom or older platform, we’d want to confirm what connectors are feasible—sometimes we can ingest via email or API exports, but I don’t want to overpromise without seeing what you’re using. What’s the primary system today?",
      "link": "https://www.onyx.app/8102147-17"
    },
    {
      "text": "Sophia Chen: It’s a vendor-built portal with limited APIs. And honestly, we’re not planning to change it this year.",
      "link": "https://www.onyx.app/8102147-18"
    },
    {
      "text": "Camila Vega: Understood. If APIs are limited, that might constrain real-time clustering. In some cases we can work off periodic exports, but if that’s not possible, Issue_Tracker may not be a fit right now. Before we call it, can I ask—what’s the biggest pain in your current triage process: duplicate reports, routing, or proving impact to engineering?",
      "link": "https://www.onyx.app/8102147-19"
    },
    {
      "text": "Sophia Chen: Proving impact is hard, but we manage. The bigger issue is engineering capacity. Even if we had perfect clusters, we still can’t move faster.",
      "link": "https://www.onyx.app/8102147-20"
    },
    {
      "text": "Camila Vega: That’s fair. Where Issue_Tracker tends to help there is ensuring the limited engineering capacity is aimed at what matters most—because you can see which clusters are most widespread and which customer groups are affected. But if your constraint is purely capacity and not prioritization or visibility, it may not move the needle enough.",
      "link": "https://www.onyx.app/8102147-21"
    },
    {
      "text": "Sophia Chen: Also, we already do some aggregation manually—our support leads summarize top issues and send them to product. It’s not perfect, but it works.",
      "link": "https://www.onyx.app/8102147-22"
    },
    {
      "text": "Camila Vega: Makes sense. The main difference would be automating that aggregation so your leads aren’t spending hours stitching together examples, and making sure duplicates don’t inflate or hide the real signal. But I hear you—if the current workflow is “good enough,” it’s hard to justify adding a new layer.",
      "link": "https://www.onyx.app/8102147-23"
    },
    {
      "text": "Sophia Chen: Yeah, and I’m not the final decision maker for new tools anyway. I’m more on the operations side, and we’re in a budget freeze.",
      "link": "https://www.onyx.app/8102147-24"
    },
    {
      "text": "Camila Vega: Thanks for being direct. Given the budget freeze and the integration constraints, it may not be the right time. Would it be useful if I sent a one-pager that outlines the clustering and the weekly “top themes” workflow, just so you have it on file if priorities change?",
      "link": "https://www.onyx.app/8102147-25"
    },
    {
      "text": "Sophia Chen: You can send it, but I can’t promise I’ll get to it soon. We’re slammed.",
      "link": "https://www.onyx.app/8102147-26"
    },
    {
      "text": "Camila Vega: Totally understood. I’ll keep it brief. Last question—if you were to revisit something like this later, who would be the right person to evaluate integrations and security requirements?",
      "link": "https://www.onyx.app/8102147-27"
    },
    {
      "text": "Sophia Chen: Probably someone in IT security plus our applications manager. But again, we’re not adding vendors this quarter.",
      "link": "https://www.onyx.app/8102147-28"
    },
    {
      "text": "Camila Vega: Got it. I won’t push for a full sales call right now. I’ll email the one-pager and a short checklist of what we’d need from the support platform to make clustering work. If later in the year you move toward a new support system or want to reduce the manual summarization effort, we can pick it back up.",
      "link": "https://www.onyx.app/8102147-29"
    },
    {
      "text": "Sophia Chen: Okay. Send it over. Thanks.",
      "link": "https://www.onyx.app/8102147-30"
    },
    {
      "text": "Camila Vega: Will do. Thanks for the time, Sophia.",
      "link": "https://www.onyx.app/8102147-31"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "camila_vega@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "sophia_chen@radiant_vale_utilities.onyx.app"
    }
  ]
}