{
  "id": "FIREFLIES_7998870",
  "semantic_identifier": "7998870 - Umbraleaf Biotech - sales_call - Discussion with Larry Delgado",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-08-08 00:00:00",
  "metadata": {
    "meeting_date": "2025-08-08 00:00:00",
    "duration_min": "45"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-08"
      ],
      "year_month": "2025-08",
      "meeting_title": "7998870 - Umbraleaf Biotech - sales_call - Discussion with Larry Delgado",
      "organizer_email": "sneha_reddy@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Sneha Reddy: Hi Larry, good to see you again. Last time you mentioned the support team is drowning in repeat tickets and it’s hard to tell what’s truly urgent versus just loud. I wanted to focus today on how Issue_Tracker clusters and prioritizes issues so you can get to a decision on whether it’s worth piloting at Umbraleaf.",
      "link": "https://www.onyx.app/2061375-1"
    },
    {
      "text": "Larry Delgado: Hi Sneha. Yes, still a problem. We’re getting slammed, but I’m not convinced adding another tool is the answer. We already have Zendesk and Jira, and a lot of process around them.",
      "link": "https://www.onyx.app/2061375-2"
    },
    {
      "text": "Sneha Reddy: Totally fair. Issue_Tracker isn’t trying to replace Zendesk or Jira. It sits in between and standardizes an “issue object”—a theme with evidence, impacted customers, and linked Jira work—so teams stop debating what’s real and what matters most. The two things I’d like to show conceptually are: clustering to reduce noise and issue prioritization that’s explainable and tied to business impact.",
      "link": "https://www.onyx.app/2061375-3"
    },
    {
      "text": "Larry Delgado: When you say “sits in between,” that’s the part that worries me. Another interface, another thing to maintain. Our support ops manager will push back hard if we’re asking reps to work in three systems.",
      "link": "https://www.onyx.app/2061375-4"
    },
    {
      "text": "Sneha Reddy: Understood. In most deployments, support reps keep working in Zendesk. Issue_Tracker continuously ingests and deduplicates in the background. The output is for support ops and product: instead of 5,000 tickets a month, you see ~80 active themes with representative examples and a list of affected customers. Then you route the top 10 clusters weekly into your product/engineering review.",
      "link": "https://www.onyx.app/2061375-5"
    },
    {
      "text": "Larry Delgado: That “top 10” sounds nice, but we already tag tickets and have macros. The real fight is prioritization—product thinks everything is “not planned” and support thinks everything is urgent. How are you actually scoring it?",
      "link": "https://www.onyx.app/2061375-6"
    },
    {
      "text": "Sneha Reddy: Great question. The issue_prioritization feature ranks clusters with a transparent score based on inputs you control: frequency and velocity, severity tags, customer tier or ARR, churn-risk flags, and segment/ICP importance. If you have Customer_Analyzer, we can weight issues that impact your highest-fit biotech segments more heavily. And if you connect CRM or Sales_Accelerator, we can boost issues that are blocking late-stage opportunities or creating forecast risk.",
      "link": "https://www.onyx.app/2061375-7"
    },
    {
      "text": "Larry Delgado: We don’t use Customer_Analyzer today, and our CRM data is messy. Also, my concern is that “revenue exposure” and “deal risk” are going to bias everything toward sales noise. We’re biotech—some issues are compliance or lab workflow critical even if it’s not a huge ARR customer.",
      "link": "https://www.onyx.app/2061375-8"
    },
    {
      "text": "Sneha Reddy: That makes sense. You can tune it so severity and regulatory flags carry more weight than ARR. The point is: the score is explainable, not a black box. In the Support view, it can emphasize SLA risk and severity; in Product, impact versus effort; in Exec, revenue exposure. You can start with a simple model: frequency + severity, and add business weighting later if you want.",
      "link": "https://www.onyx.app/2061375-9"
    },
    {
      "text": "Larry Delgado: Okay, but we already have dashboards that show top ticket categories. The missing piece is getting engineering to trust it and act. They live in Jira. If Issue_Tracker becomes yet another place they have to check, it’ll die.",
      "link": "https://www.onyx.app/2061375-10"
    },
    {
      "text": "Sneha Reddy: Agree. The happy path is: Issue_Tracker clusters and produces a short weekly “theme packet”—evidence links back to the Zendesk tickets, impacted customers list, trend line—then you push a single Jira epic per theme. Engineers stay in Jira; the epic stays linked to the theme so support can see status without chasing PMs.",
      "link": "https://www.onyx.app/2061375-11"
    },
    {
      "text": "Larry Delgado: “Push a Jira epic per theme” sounds like roadmapping. We already use Productboard for that. We’re trying to reduce tools, not add them. This is starting to overlap.",
      "link": "https://www.onyx.app/2061375-12"
    },
    {
      "text": "Sneha Reddy: It’s not meant to be a roadmapping tool—more like a triage layer. Productboard can still own roadmap decisions. Issue_Tracker just makes sure the underlying issue data is deduped, prioritized, and connected to customers and tickets so you don’t lose context.",
      "link": "https://www.onyx.app/2061375-13"
    },
    {
      "text": "Larry Delgado: But if product is already making roadmap calls in Productboard, why would they come to Issue_Tracker for prioritization? That’s exactly the adoption risk I see.",
      "link": "https://www.onyx.app/2061375-14"
    },
    {
      "text": "Sneha Reddy: That’s fair. The way teams adopt it is by using it as the single source of truth for “what are customers actually experiencing,” not “what are we building.” The prioritization helps align support and product on what’s painful and widespread—then product still decides where it lands on the roadmap.",
      "link": "https://www.onyx.app/2061375-15"
    },
    {
      "text": "Larry Delgado: Let me be blunt: we’ve been burned by “single source of truth” promises. Data gets stale, integrations break, and then we’re reconciling two realities. How heavy is the integration work here?",
      "link": "https://www.onyx.app/2061375-16"
    },
    {
      "text": "Sneha Reddy: For a pilot, we typically start with read-only ingestion from Zendesk and a lightweight Jira linkage. You’d choose a subset—say one product area—and we’d cluster tickets into themes, then validate the top themes with your support ops lead. No big migration.",
      "link": "https://www.onyx.app/2061375-17"
    },
    {
      "text": "Larry Delgado: And what about access controls? Some tickets have sensitive patient-related notes. Even if we redact, legal is very strict. If you’re ingesting “continuous conversations,” that’s a red flag.",
      "link": "https://www.onyx.app/2061375-18"
    },
    {
      "text": "Sneha Reddy: We can scope ingestion fields and apply redaction rules, and we support permissioning. But if legal requires zero replication outside Zendesk, then the pilot would be tough. We’d need to confirm whether metadata-only clustering would be acceptable.",
      "link": "https://www.onyx.app/2061375-19"
    },
    {
      "text": "Larry Delgado: That’s the kind of thing I wish we’d covered earlier. Because if you can’t ingest the content, clustering loses value. Tags and categories aren’t consistent enough for us to rely on.",
      "link": "https://www.onyx.app/2061375-20"
    },
    {
      "text": "Sneha Reddy: That’s a good point. If you can’t ingest enough signal, the deduping and evidence linking won’t be as strong. Could we involve your security or legal team for 20 minutes to understand constraints? If we can clear that, the value is pretty direct: fewer duplicate tickets, and a defensible weekly top-themes list.",
      "link": "https://www.onyx.app/2061375-21"
    },
    {
      "text": "Larry Delgado: Possibly, but I’m not sure I want to pull them in yet. We’re also midstream on a Zendesk reconfiguration project. Our support ops capacity is close to zero for new experiments.",
      "link": "https://www.onyx.app/2061375-22"
    },
    {
      "text": "Sneha Reddy: Understood. If time is the constraint, we could keep it minimal: two weeks of historical Zendesk data, we generate the clusters, and we review the top 10 themes together—no workflow change for agents. That gives you a clear read on whether the prioritization and clustering match reality.",
      "link": "https://www.onyx.app/2061375-23"
    },
    {
      "text": "Larry Delgado: Even that requires approvals and data handling review. And I’m still not convinced the output is different enough from what our support ops analyst can do with reporting plus a bit of manual synthesis. They already send a weekly summary to product.",
      "link": "https://www.onyx.app/2061375-24"
    },
    {
      "text": "Sneha Reddy: The difference is consistency and scale—going from thousands of tickets to themes automatically, with deduped evidence and customer lists. It reduces the manual work and makes prioritization less subjective, especially when there’s disagreement.",
      "link": "https://www.onyx.app/2061375-25"
    },
    {
      "text": "Larry Delgado: I hear you, but at Umbraleaf the bigger issue isn’t making the list—it’s getting product and engineering to commit. A prettier theme packet won’t change incentives. And if this creates another queue they need to look at, it could actually slow us down.",
      "link": "https://www.onyx.app/2061375-26"
    },
    {
      "text": "Sneha Reddy: That’s fair. Where I’ve seen it help is by tying themes to business impact so execs can back the priorities. But if the bottleneck is organizational alignment rather than clarity, then we should be honest about that.",
      "link": "https://www.onyx.app/2061375-27"
    },
    {
      "text": "Larry Delgado: Exactly. And given the compliance constraints, plus the fact that we’re already invested in Productboard workflows, I don’t think we’re in a place to add a triage layer this quarter.",
      "link": "https://www.onyx.app/2061375-28"
    },
    {
      "text": "Sneha Reddy: I appreciate the directness. Would it make sense to pause and revisit after the Zendesk project? Or would it help if I sent a one-pager clarifying boundaries—what Issue_Tracker does and doesn’t do—so you can share internally without it being framed as “another ticketing system”?",
      "link": "https://www.onyx.app/2061375-29"
    },
    {
      "text": "Larry Delgado: You can send the one-pager, but I’m not committing to a next step right now. Maybe we revisit in six months. For this quarter, we’re heads down and risk-averse on tooling.",
      "link": "https://www.onyx.app/2061375-30"
    },
    {
      "text": "Sneha Reddy: Got it. I’ll send a concise summary—especially around not replacing Zendesk/Jira and how prioritization is configurable—and you can decide if it’s worth re-opening later. Thanks for your time today, Larry.",
      "link": "https://www.onyx.app/2061375-31"
    },
    {
      "text": "Larry Delgado: Thanks, Sneha. Appreciate it.",
      "link": "https://www.onyx.app/2061375-32"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "sneha_reddy@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "larry_delgado@umbraleaf_biotech.onyx.app"
    }
  ]
}