{
  "id": "FIREFLIES_8267577",
  "semantic_identifier": "8267577 - Orchardline Supply - sales_pitch - Discussion with Madeline Cho",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-08-18 00:00:00",
  "metadata": {
    "meeting_date": "2025-08-18 00:00:00",
    "duration_min": "42"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-08"
      ],
      "year_month": "2025-08",
      "meeting_title": "8267577 - Orchardline Supply - sales_pitch - Discussion with Madeline Cho",
      "organizer_email": "mina_park@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Mina Park: Hi Madeline, thanks for taking a few minutes—this is Mina Park. I work with teams that are trying to turn messy customer feedback and support noise into a clean, prioritized list of “what we fix next.” Does that sound relevant at Orchardline Supply right now?",
      "link": "https://www.onyx.app/6936773-1"
    },
    {
      "text": "Madeline Cho: Hi Mina—yes, it does. We’ve got feedback coming from support, account managers, and email threads, and it’s hard to know what’s actually urgent versus just loud.",
      "link": "https://www.onyx.app/6936773-2"
    },
    {
      "text": "Mina Park: That’s exactly the problem Issue_Tracker is built for. It’s an issue-intelligence and triage layer that sits between your support tools like Zendesk or Intercom and delivery tools like Jira or Linear—plus it pulls in customer and revenue context from your CRM. Instead of another ticketing system, it standardizes an “issue object”: the theme or root cause, the evidence from real conversations, and which customers are impacted—then keeps that linked to the downstream engineering work.",
      "link": "https://www.onyx.app/6936773-3"
    },
    {
      "text": "Madeline Cho: Okay. We’ve tried tags and dashboards, but it still turns into debates in triage meetings. What’s actually different?",
      "link": "https://www.onyx.app/6936773-4"
    },
    {
      "text": "Mina Park: Two things tend to change the game. First is deduping and clustering—Issue_Tracker continuously ingests customer-reported problems and requests and automatically groups duplicates into themes, so you don’t have ten tickets that look different but are actually the same root cause. Second is issue_prioritization: each cluster gets an explainable priority score based on inputs you control—frequency and velocity, severity, customer tier or ARR, churn-risk flags, and segment importance. The key is it’s not a black box; you can see why something rises to the top.",
      "link": "https://www.onyx.app/6936773-5"
    },
    {
      "text": "Madeline Cho: “Explainable” is good, because our product and support teams argue about severity all the time. How do you keep it from being just another score people ignore?",
      "link": "https://www.onyx.app/6936773-6"
    },
    {
      "text": "Mina Park: We’ve found the score matters most when it’s grounded in business impact and tailored views. Issue_Tracker can show different lenses for different teams: Support can see SLA and escalation risk; Product can see impact versus effort; Sales can see deal blockers; Exec can see revenue exposure. Everyone’s looking at the same clustered issues, but through the lens that matches their decision-making. That’s what reduces the circular debate.",
      "link": "https://www.onyx.app/6936773-7"
    },
    {
      "text": "Madeline Cho: We’re especially struggling with prioritizing issues for our best-fit customers. Sometimes lower-value segments flood us with volume and it crowds out what matters.",
      "link": "https://www.onyx.app/6936773-8"
    },
    {
      "text": "Mina Park: That’s a perfect fit for one of the core use cases. If you’re already segmenting customers by fit—say ICP Tier-1 versus lower-fit—Issue_Tracker can weight issue clusters using those fit tiers so problems impacting Tier-1 customers outrank similar-volume issues from low-fit segments. So you’re not just prioritizing by “how many people complained,” you’re prioritizing by “who is complaining” and what that means to retention and growth.",
      "link": "https://www.onyx.app/6936773-9"
    },
    {
      "text": "Madeline Cho: We do have fit tiers, but they live in different places depending on the team. Would we have to rebuild that?",
      "link": "https://www.onyx.app/6936773-10"
    },
    {
      "text": "Mina Park: Typically no. We can pull the customer tier signals from your CRM and, if you have something like a customer fit model, connect that context as well. The idea is to use what you already trust—ARR bands, segments, churn-risk flags—and apply it consistently to every issue cluster. If those signals are messy today, that’s actually a good starting point for a working session: we map the fields you have, decide which ones should influence priority, and set sensible defaults.",
      "link": "https://www.onyx.app/6936773-11"
    },
    {
      "text": "Madeline Cho: How does it connect to our engineering workflow? We live in Jira and our PMs don’t want another place to manage tickets.",
      "link": "https://www.onyx.app/6936773-12"
    },
    {
      "text": "Mina Park: Totally. Issue_Tracker isn’t trying to replace Jira. It sits between support and Jira. Once an issue theme is validated and prioritized, you can link it to the Jira epic or ticket your team already uses. The value is the issue object remains the source of truth for “why we’re doing this,” with evidence attached—support conversations, account notes—while Jira remains the system of record for delivery. That way, when someone asks “why is this P1,” you don’t have to dig through six tools and Slack threads.",
      "link": "https://www.onyx.app/6936773-13"
    },
    {
      "text": "Madeline Cho: Evidence is a big one for us—leadership always asks for examples and customer names, and we scramble.",
      "link": "https://www.onyx.app/6936773-14"
    },
    {
      "text": "Mina Park: Exactly. Each cluster maintains a defensible history: who reported it, what they said, how often it’s appearing, and which customers are impacted. That makes prioritization conversations faster and more consistent, and it makes status updates easier because you can trace the issue through to the engineering work and back to the original customer conversations.",
      "link": "https://www.onyx.app/6936773-15"
    },
    {
      "text": "Madeline Cho: This sounds promising. What would you need from us to see if it’s a fit?",
      "link": "https://www.onyx.app/6936773-16"
    },
    {
      "text": "Mina Park: For a first step, I’d suggest a 30–45 minute working session rather than a generic demo. We’d look at three things: one, where your customer-reported issues currently come from—Zendesk, Intercom, email, call notes; two, what customer context you trust most—ARR, segment, ICP tier; and three, how you run triage today—who decides, and what “priority” means at Orchardline. Then we can show you Issue_Tracker prioritizing a handful of real clusters in the Product view and the Exec revenue-exposure view.",
      "link": "https://www.onyx.app/6936773-17"
    },
    {
      "text": "Madeline Cho: I like the working session idea. If we can align on what to fix next without the weekly argument, that’s worth it. Who should join from your side and ours?",
      "link": "https://www.onyx.app/6936773-18"
    },
    {
      "text": "Mina Park: On our side, it’d be me and a solutions lead to map integrations and scoring inputs. From your side, ideally you, someone from Support Ops or Support leadership who owns Zendesk workflows, and a PM or product ops person who runs triage. If Sales is frequently escalating deal blockers, we can optionally include an account leader, but we can start lean.",
      "link": "https://www.onyx.app/6936773-19"
    },
    {
      "text": "Madeline Cho: Let’s start lean. I can bring our Support Ops manager and one PM who owns our triage meeting. Do you have times next week?",
      "link": "https://www.onyx.app/6936773-20"
    },
    {
      "text": "Mina Park: Yes—does Tuesday at 11am PT or Thursday at 2pm PT work? I’ll send a calendar invite with a short agenda and a few questions in advance—mainly which tools you’re using and what fields you rely on for tiers and revenue impact.",
      "link": "https://www.onyx.app/6936773-21"
    },
    {
      "text": "Madeline Cho: Tuesday at 11am PT works. Send it over and I’ll loop them in.",
      "link": "https://www.onyx.app/6936773-22"
    },
    {
      "text": "Mina Park: Perfect. I’ll send the invite right after this. Thanks, Madeline—looking forward to making triage a lot less painful at Orchardline.",
      "link": "https://www.onyx.app/6936773-23"
    },
    {
      "text": "Madeline Cho: Thanks, Mina. Talk Tuesday.",
      "link": "https://www.onyx.app/6936773-24"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mina_park@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "madeline_cho@orchardline_supply.onyx.app"
    }
  ]
}