{
  "id": "FIREFLIES_8710780",
  "semantic_identifier": "8710780 - Wildstone Paper Co - sales_pitch - Discussion with Hailey Lane",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-08-17 00:00:00",
  "metadata": {
    "meeting_date": "2025-08-17 00:00:00",
    "duration_min": "28"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-08"
      ],
      "year_month": "2025-08",
      "meeting_title": "8710780 - Wildstone Paper Co - sales_pitch - Discussion with Hailey Lane",
      "organizer_email": "sneha_reddy@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Sneha Reddy: Hi Hailey—Sneha Reddy here. Thanks for taking a few minutes. I’ll keep it tight: I work with teams trying to get clearer on who their best customers are and what to say to win more of them. Is now still good?",
      "link": "https://www.onyx.app/5677141-1"
    },
    {
      "text": "Hailey Lane: Yep, I’ve got a bit of time. What’s this about?",
      "link": "https://www.onyx.app/5677141-2"
    },
    {
      "text": "Sneha Reddy: Great. The product is Customer_Analyzer. It pulls signals you already have—CRM fields, onboarding survey responses, product usage events, support tickets, even interview notes—and turns that into two things: which customer segments are actually the best fit, and then the positioning to go win more of those deals. I was looking at Wildstone Paper Co at a high level—are you all actively deciding which industries to lean into next quarter?",
      "link": "https://www.onyx.app/5677141-3"
    },
    {
      "text": "Hailey Lane: Yeah, that’s a big topic for us. We have a few industries we serve and it’s not always clear which ones are worth the focus.",
      "link": "https://www.onyx.app/5677141-4"
    },
    {
      "text": "Sneha Reddy: That’s exactly the use case where we tend to help quickly—prioritizing industries using retention and support burden signals, not just top-line revenue. Quick question: when you debate “industry A vs. industry B,” what data do you usually use today?",
      "link": "https://www.onyx.app/5677141-5"
    },
    {
      "text": "Hailey Lane: Usually revenue and pipeline, some anecdotal feedback from sales and support. We do look at churn, but it’s messy. Support burden is mostly gut feel.",
      "link": "https://www.onyx.app/5677141-6"
    },
    {
      "text": "Sneha Reddy: Makes sense. What Customer_Analyzer does is normalize those signals so the conversation gets grounded. For example, we can weight retention, expansion, support ticket volume, time-to-resolution, product usage depth, and match that against what your product is strongest at delivering. Then it produces a fit score by segment—so you can see, “This industry retains 30% better but costs half the support,” versus “This one looks good in pipeline but churns and creates ticket spikes.”",
      "link": "https://www.onyx.app/5677141-7"
    },
    {
      "text": "Hailey Lane: That would be helpful. Our support team definitely feels like certain segments are louder, but we haven’t quantified it well.",
      "link": "https://www.onyx.app/5677141-8"
    },
    {
      "text": "Sneha Reddy: Exactly. And the second piece—where teams usually get stuck even after they pick a segment—is: “Okay, what do we actually say that will resonate?” This is where our positioning_recommendation feature comes in. Once you prioritize, it generates segment-specific positioning that’s tied back to the drivers and evidence. So you don’t just get generic copy—you get an editable set of messaging blocks like website hero copy, sales deck bullets, and email openers, plus a playbook for common objections.",
      "link": "https://www.onyx.app/5677141-9"
    },
    {
      "text": "Hailey Lane: When you say “tied back to evidence,” what do you mean?",
      "link": "https://www.onyx.app/5677141-10"
    },
    {
      "text": "Sneha Reddy: Great question. If the recommendation says, “Lead with reducing waste and downtime,” it’ll show you the underlying signals it learned from—like repeated language in tickets, onboarding surveys mentioning specific pain points, usage patterns that correlate with renewals, or notes from interviews. That way marketing and sales don’t argue about whether it’s real; they can click through and see the proof points behind it.",
      "link": "https://www.onyx.app/5677141-11"
    },
    {
      "text": "Hailey Lane: Got it. We do spend a lot of time debating messaging, especially when sales says one thing and marketing says another.",
      "link": "https://www.onyx.app/5677141-12"
    },
    {
      "text": "Sneha Reddy: That’s super common. The workflow we see at companies like yours is: first, align on which industries are truly profitable and sticky—using retention plus support burden. Second, generate positioning and objection handling for the top one or two segments so sales has a consistent narrative and marketing can update campaigns without weeks of back-and-forth.",
      "link": "https://www.onyx.app/5677141-13"
    },
    {
      "text": "Hailey Lane: This sounds like it could be useful. How heavy is the setup? We’re already stretched.",
      "link": "https://www.onyx.app/5677141-14"
    },
    {
      "text": "Sneha Reddy: Totally fair. We try to keep it light by starting with what you already have. A typical first pass is: connect CRM, pull a slice of support ticket data, and optionally import onboarding survey responses. If you have product usage events, that’s a bonus, but not mandatory for the first insight. The goal in week one is to produce an initial segment ranking and a draft positioning pack for the top segment—then you refine it with your team.",
      "link": "https://www.onyx.app/5677141-15"
    },
    {
      "text": "Hailey Lane: And who usually owns it internally? Marketing? Product? Sales ops?",
      "link": "https://www.onyx.app/5677141-16"
    },
    {
      "text": "Sneha Reddy: Usually it’s a shared initiative, but one person coordinates. Often it’s product marketing, growth, or revenue ops—someone who cares about segment decisions and messaging. For this first step, it’s enough that you can bring one stakeholder from marketing and one from sales or support to a working session.",
      "link": "https://www.onyx.app/5677141-17"
    },
    {
      "text": "Hailey Lane: Okay. What would you need from me to see if this is a fit?",
      "link": "https://www.onyx.app/5677141-18"
    },
    {
      "text": "Sneha Reddy: Two things. First, a quick sense of your current segmentation: what are the top 3–5 industries you serve, and which ones you’re considering doubling down on next quarter. Second, what data is easiest to access—CRM fields, retention by customer, and a rough export of support tickets by account. In a full call, we can map those signals and show you a sample output: an industry fit score table and the positioning recommendations for, say, your top two segments.",
      "link": "https://www.onyx.app/5677141-19"
    },
    {
      "text": "Hailey Lane: That would help. We have Salesforce data pretty clean, support tickets are in Zendesk, and retention is in our billing system. I can probably pull some of that.",
      "link": "https://www.onyx.app/5677141-20"
    },
    {
      "text": "Sneha Reddy: Perfect—Salesforce + Zendesk is a very common combo for us. If you’re open to it, the next step is a 30-minute deeper dive where I walk through what the segment scoring would look like for Wildstone Paper Co and show examples of the messaging blocks—like a segment-specific value prop, differentiators, proof points to collect, and an objection-handling playbook.",
      "link": "https://www.onyx.app/5677141-21"
    },
    {
      "text": "Hailey Lane: Yeah, I’m interested. Can we do later this week?",
      "link": "https://www.onyx.app/5677141-22"
    },
    {
      "text": "Sneha Reddy: Absolutely. How’s Thursday at 2pm your time? If that’s tight, I have Friday morning as well.",
      "link": "https://www.onyx.app/5677141-23"
    },
    {
      "text": "Hailey Lane: Thursday at 2 works. Should I invite anyone?",
      "link": "https://www.onyx.app/5677141-24"
    },
    {
      "text": "Sneha Reddy: If you can, invite whoever weighs in on industry prioritization—maybe someone from support or customer success, and someone from sales or marketing. Even one extra person is great. I’ll send a calendar invite with a short checklist of what data to bring—nothing fancy, just a couple exports if you have them.",
      "link": "https://www.onyx.app/5677141-25"
    },
    {
      "text": "Hailey Lane: Sounds good. Send it over and I’ll loop in our support lead.",
      "link": "https://www.onyx.app/5677141-26"
    },
    {
      "text": "Sneha Reddy: Perfect. I’ll get that on your calendar. Thanks, Hailey—looking forward to showing you what the first segment ranking and positioning recommendations could look like for next quarter.",
      "link": "https://www.onyx.app/5677141-27"
    },
    {
      "text": "Hailey Lane: Thanks, Sneha. Talk Thursday.",
      "link": "https://www.onyx.app/5677141-28"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "sneha_reddy@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "hailey_lane@wildstone_paper_co.onyx.app"
    }
  ]
}