{
  "id": "FIREFLIES_9315080",
  "semantic_identifier": "9315080 - Lighthouse Kinetics - sales_pitch - Discussion with Albert Medina",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-08-12 00:00:00",
  "metadata": {
    "meeting_date": "2025-08-12 00:00:00",
    "duration_min": "41"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-08"
      ],
      "year_month": "2025-08",
      "meeting_title": "9315080 - Lighthouse Kinetics - sales_pitch - Discussion with Albert Medina",
      "organizer_email": "mina_park@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Mina Park: Hi Albert—Mina Park from Customer_Analyzer. Thanks for taking a few minutes. I’ll keep it brief: we help product, marketing, and sales teams get really clear on who their best customers are and how to message to them so you win more of the right deals.",
      "link": "https://www.onyx.app/6044211-1"
    },
    {
      "text": "Albert Medina: Hi Mina. Sure—what exactly do you do that’s different from, say, our CRM reports and basic segmentation?",
      "link": "https://www.onyx.app/6044211-2"
    },
    {
      "text": "Mina Park: Great question. CRM reports tell you “what happened,” but they usually don’t tell you “who’s truly a great fit and why,” or how to translate that into positioning. Customer_Analyzer ingests signals you already have—CRM fields, onboarding surveys, product usage events, support tickets, even interview notes—and turns them into a fit score from 0 to 100 at both the account and segment level, plus a driver breakdown. So it’s not just “Mid-market converts better,” it’s “Mid-market converts and retains better because time-to-value is faster, adoption is higher, and support burden is lower,” for example.",
      "link": "https://www.onyx.app/6044211-3"
    },
    {
      "text": "Albert Medina: Okay. We’ve been trying to tighten our ICP, but it’s messy. We’re also split on whether we should push harder into SMB or mid-market this year.",
      "link": "https://www.onyx.app/6044211-4"
    },
    {
      "text": "Mina Park: That’s exactly the kind of decision we’re built for. The feature most teams start with is fit estimation. You define your fit drivers—industry, size, technographics, problem severity, willingness to pay, time-to-value, adoption patterns, support burden, churn risk—and we compute a fit score per account and then roll it up into segment comparisons. Then we recommend an ICP profile based on observed outcomes like retention, expansion, and conversion—not just gut feel.",
      "link": "https://www.onyx.app/6044211-5"
    },
    {
      "text": "Albert Medina: How much work is it to set up those “fit drivers”? That sounds like a lot of modeling.",
      "link": "https://www.onyx.app/6044211-6"
    },
    {
      "text": "Mina Park: We keep it lightweight. In the first pass, we’ll start with drivers you already track—firmographics from your CRM, a couple of product usage metrics, and maybe support ticket volume or categories. You don’t have to be perfect on day one. The model shows you the driver breakdown so you can see what’s actually influencing fit—then refine from there. Most teams get a usable read within a couple weeks, sometimes faster depending on data access.",
      "link": "https://www.onyx.app/6044211-7"
    },
    {
      "text": "Albert Medina: And what would we get out of it that we can act on immediately?",
      "link": "https://www.onyx.app/6044211-8"
    },
    {
      "text": "Mina Park: Two quick wins: prioritization and messaging. On prioritization, you get a clear read on which tier—SMB vs mid-market—matches your current strengths and which drivers are holding the other tier back. On messaging, once we know what “good fit” looks like, we generate positioning recommendations: value props, differentiators, proof points, and objection handling by segment. That’s especially useful if you’re building segment-specific landing pages and outbound messaging for two ICP tiers.",
      "link": "https://www.onyx.app/6044211-9"
    },
    {
      "text": "Albert Medina: We actually are trying to do exactly that—separate landing pages for SMB and mid-market, and our SDRs keep asking for better talk tracks. But I’m skeptical about “auto positioning.” Doesn’t it become generic?",
      "link": "https://www.onyx.app/6044211-10"
    },
    {
      "text": "Mina Park: Totally fair. The goal isn’t generic copy. It’s structured recommendations anchored in your own signals. For example, if mid-market customers show faster time-to-value and higher adoption in key workflows, we’ll suggest emphasizing “fast onboarding” and “team-wide adoption,” with proof points pulled from your outcomes—like retention or expansion patterns. If SMB has higher support burden or churn risk, the tool will flag that and recommend either: (a) a different positioning angle that reduces implementation friction, or (b) qualification criteria so sales doesn’t over-promise. It’s more like a positioning brief you can tailor, not a chatbot spitting out slogans.",
      "link": "https://www.onyx.app/6044211-11"
    },
    {
      "text": "Albert Medina: That’s interesting. How does it handle disagreements internally? Our product team thinks one thing, sales thinks another.",
      "link": "https://www.onyx.app/6044211-12"
    },
    {
      "text": "Mina Park: This is where the driver breakdown helps. Instead of debating anecdotes, you can show: “Here’s the fit score for SMB vs mid-market, here’s the top drivers, and here’s the observed outcomes.” It creates a shared language across teams. Even if people still disagree, they’re arguing from the same dataset.",
      "link": "https://www.onyx.app/6044211-13"
    },
    {
      "text": "Albert Medina: What data sources do you typically need? We have Salesforce, Intercom, and product events in Segment.",
      "link": "https://www.onyx.app/6044211-14"
    },
    {
      "text": "Mina Park: That’s a very common stack. Salesforce covers firmographics, pipeline, win/loss fields. Intercom gives you support burden and issue themes. Segment gives you usage and adoption patterns. With those three, you can usually get to a strong first fit model—enough to compare SMB vs mid-market and identify which signals correlate with renewals and expansion.",
      "link": "https://www.onyx.app/6044211-15"
    },
    {
      "text": "Albert Medina: And what does a successful rollout look like? I don’t want another tool that becomes a dashboard no one checks.",
      "link": "https://www.onyx.app/6044211-16"
    },
    {
      "text": "Mina Park: Completely agree. The best rollouts are tied to a specific decision and deliverables. In your case, I’d frame it as: “Decide ICP tier focus + ship two segment-specific landing pages + refresh outbound talk tracks.” We’d use fit estimation to confirm which tier is strongest and why, then translate the top drivers into messaging inputs—what we lead with, what proof points we use, what objections we preempt. Then marketing and sales have something concrete to implement, not just charts.",
      "link": "https://www.onyx.app/6044211-17"
    },
    {
      "text": "Albert Medina: If we did this, who on our side needs to be involved?",
      "link": "https://www.onyx.app/6044211-18"
    },
    {
      "text": "Mina Park: Usually one person from marketing or growth who owns messaging, someone from sales ops or revenue ops for CRM access, and optionally a product analytics person for the event data—though we can often work with whatever definitions you already have. For the first working session, it’s helpful if you and whoever owns segmentation/ICP can join so we align on the initial fit drivers and the SMB vs mid-market question.",
      "link": "https://www.onyx.app/6044211-19"
    },
    {
      "text": "Albert Medina: Makes sense. What kind of time commitment are we talking?",
      "link": "https://www.onyx.app/6044211-20"
    },
    {
      "text": "Mina Park: For the kickoff and setup: one 60-minute working session to define the drivers and the segment split, then a lighter data connection process. After that, we typically do a 45-minute readout where we show the fit scores, the driver breakdown, and the segment comparison. If it looks promising, we can do a follow-on session focused purely on converting it into landing page sections and outbound messaging.",
      "link": "https://www.onyx.app/6044211-21"
    },
    {
      "text": "Albert Medina: I like the structure. Before we schedule, can you give me an example of what the segment comparison output looks like?",
      "link": "https://www.onyx.app/6044211-22"
    },
    {
      "text": "Mina Park: Sure. You’ll see something like: SMB fit score 62, Mid-market fit score 81—just an example—and beneath that, a ranked list of drivers with contribution: time-to-value, adoption depth, support burden, willingness-to-pay proxies, churn risk signals. You can click into each driver to see the evidence—like usage milestones reached within 30 days, ticket rate per account, or retention curves. Then the recommended ICP profile summarizes the “best fit” traits: size range, industries that overperform, tech stack signals, and the key pains that correlate with success.",
      "link": "https://www.onyx.app/6044211-23"
    },
    {
      "text": "Albert Medina: That would be helpful. We’ve been trying to justify moving upmarket, but we keep getting pulled back into SMB because it’s easier top-of-funnel.",
      "link": "https://www.onyx.app/6044211-24"
    },
    {
      "text": "Mina Park: Exactly—this helps you quantify the tradeoff. If mid-market has higher fit but lower volume, you can adjust targeting and messaging accordingly: keep SMB campaigns but tighten qualification, while building a clearer narrative and proof points for mid-market. That’s where the segment-specific landing pages come in—so you’re not forcing one story to do two jobs.",
      "link": "https://www.onyx.app/6044211-25"
    },
    {
      "text": "Albert Medina: Okay. This sounds worth a deeper look. What are you proposing as next step?",
      "link": "https://www.onyx.app/6044211-26"
    },
    {
      "text": "Mina Park: Let’s schedule a full 45–60 minute walkthrough with a bit of pre-work. If you can bring a RevOps partner or someone who can speak to Salesforce fields and your Segment event taxonomy, we’ll use the first half to map the initial fit drivers and segments, and the second half to show you a sample output and how it becomes messaging for SMB vs mid-market. Does early next week work?",
      "link": "https://www.onyx.app/6044211-27"
    },
    {
      "text": "Albert Medina: Early next week should work. Tuesday afternoon is open on my end.",
      "link": "https://www.onyx.app/6044211-28"
    },
    {
      "text": "Mina Park: Perfect—how about Tuesday at 2:00 PM your time? I’ll send a calendar invite. I’ll also include a short checklist: which Salesforce objects/fields are most useful, what Segment events you consider “activation” and “adoption,” and which Intercom tags map to support burden. Nothing heavy—just to make the session productive.",
      "link": "https://www.onyx.app/6044211-29"
    },
    {
      "text": "Albert Medina: Sounds good. Send it over, and I’ll loop in our RevOps lead.",
      "link": "https://www.onyx.app/6044211-30"
    },
    {
      "text": "Mina Park: Great. Appreciate it, Albert. I’ll get that invite out today, and we’ll come prepared with a draft SMB vs mid-market segmentation framework so we can move quickly.",
      "link": "https://www.onyx.app/6044211-31"
    },
    {
      "text": "Albert Medina: Thanks Mina. Looking forward to it.",
      "link": "https://www.onyx.app/6044211-32"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mina_park@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "albert_medina@lighthouse_kinetics.onyx.app"
    }
  ]
}