{
  "id": "FIREFLIES_9372065",
  "semantic_identifier": "9372065 - Vertexhollow Design - sales_pitch - Discussion with Henry Willis",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-08-28 00:00:00",
  "metadata": {
    "meeting_date": "2025-08-28 00:00:00",
    "duration_min": "44"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-08"
      ],
      "year_month": "2025-08",
      "meeting_title": "9372065 - Vertexhollow Design - sales_pitch - Discussion with Henry Willis",
      "organizer_email": "camila_vega@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Camila Vega: Hi Henry—Camila Vega here. Thanks for taking a few minutes. I’ll keep it tight: I wanted to share how Issue_Tracker helps teams like Vertexhollow Design turn scattered support tickets and feature requests into a clear, prioritized set of “issue themes” that product, support, and sales can all act on.",
      "link": "https://www.onyx.app/5080983-1"
    },
    {
      "text": "Henry Willis: Hey Camila, sure—what do you mean by “issue themes”? We already have Zendesk and Jira, so I’m curious what’s different.",
      "link": "https://www.onyx.app/5080983-2"
    },
    {
      "text": "Camila Vega: Totally fair. We’re not trying to replace Zendesk or Jira. Issue_Tracker sits between them and standardizes what an “issue” is—so instead of 40 separate tickets that look slightly different, it deduplicates and clusters them into one theme with evidence, root cause notes, and the impacted customers—all still linked back to the original conversations and to the downstream Jira work.",
      "link": "https://www.onyx.app/5080983-3"
    },
    {
      "text": "Henry Willis: Okay, so it groups similar stuff together. We do some of that manually, but it’s messy. Where does the real value come in?",
      "link": "https://www.onyx.app/5080983-4"
    },
    {
      "text": "Camila Vega: Two places I think you’d feel quickly. First is issue prioritization. Once Issue_Tracker clusters the noise into themes, it ranks those clusters with an explainable priority score—based on things you can configure, like frequency and velocity, severity tags, customer tier/ARR, churn risk flags, and segment importance. So it’s not just “what’s loudest,” it’s “what’s most business-critical.”",
      "link": "https://www.onyx.app/5080983-5"
    },
    {
      "text": "Henry Willis: We struggle with that, honestly. Our support team is loud, sales escalations are loud, and product tries to do the right thing but it’s subjective.",
      "link": "https://www.onyx.app/5080983-6"
    },
    {
      "text": "Camila Vega: Exactly. Issue_Tracker makes the logic shared and defensible. Support can view it through an SLA-risk lens, product can look at impact vs. effort, sales can see deal blockers, and execs see revenue exposure. Same underlying issue object—different view, aligned prioritization.",
      "link": "https://www.onyx.app/5080983-7"
    },
    {
      "text": "Henry Willis: How hard is it to set up those inputs? We don’t have time for a huge implementation.",
      "link": "https://www.onyx.app/5080983-8"
    },
    {
      "text": "Camila Vega: Setup is usually lightweight because we pull from the systems you already use. For example, frequency/velocity comes from Zendesk or Intercom volume. Customer tier/ARR and segment importance can come from your CRM. Severity tags can be inferred from support metadata or defined rules. And the key is: the priority score is explainable, so when someone asks “why is this #2,” it shows the factors that drove it.",
      "link": "https://www.onyx.app/5080983-9"
    },
    {
      "text": "Henry Willis: That “why” would help. Our internal debates turn into opinions pretty fast. But I’m in customer success—how does it help my team day to day?",
      "link": "https://www.onyx.app/5080983-10"
    },
    {
      "text": "Camila Vega: Great question. One of the most common CS use cases is consistent customer follow-up. Your CSMs can subscribe accounts to relevant issue clusters—so if Henry’s managing a set of accounts impacted by, say, “export failures in large projects,” those accounts are attached to that cluster. Then when the linked Jira ticket ships, Issue_Tracker records the release milestone and automatically builds a history trail of which customers were notified and when.",
      "link": "https://www.onyx.app/5080983-11"
    },
    {
      "text": "Henry Willis: Interesting. We currently do that in spreadsheets and Slack reminders, and it’s easy to miss someone.",
      "link": "https://www.onyx.app/5080983-12"
    },
    {
      "text": "Camila Vega: That’s exactly what we see. The follow-up is where trust is won or lost, but it’s operationally painful. Issue_Tracker keeps the “promise” tied to the actual engineering work, and it makes it easy to answer: “Who is waiting on this? What did we tell them? Did we close the loop?”",
      "link": "https://www.onyx.app/5080983-13"
    },
    {
      "text": "Henry Willis: How does it know when something “ships”? Our Jira statuses aren’t always clean.",
      "link": "https://www.onyx.app/5080983-14"
    },
    {
      "text": "Camila Vega: We can map to whatever signal you trust—Jira status transitions, a release label, a merged PR tag, or even a specific “Released” workflow step. The goal is not perfection on day one; it’s to connect the customer-facing commitments to a consistent engineering milestone. Most teams start with a simple mapping and tighten it over time.",
      "link": "https://www.onyx.app/5080983-15"
    },
    {
      "text": "Henry Willis: Got it. You mentioned deal risk earlier—does this touch sales too? We’ve had a couple renewals get shaky because issues lingered.",
      "link": "https://www.onyx.app/5080983-16"
    },
    {
      "text": "Camila Vega: Yes, and it’s still the same core capability: prioritization with business context. If an issue is tied to high-ARR accounts or churn risk flags, it can bubble up. And for pipeline, Issue_Tracker can integrate with your CRM and tools like Sales_Accelerator so clusters that are blocking late-stage opportunities get boosted—so teams aren’t surprised when an “old bug” suddenly becomes a forecast problem.",
      "link": "https://www.onyx.app/5080983-17"
    },
    {
      "text": "Henry Willis: That’s appealing. We’ve had moments where support knows it’s bad, but product doesn’t realize it’s also tied to a renewal conversation.",
      "link": "https://www.onyx.app/5080983-18"
    },
    {
      "text": "Camila Vega: Exactly—Issue_Tracker is that bridge. It gives everyone one place to see the theme, the evidence, who’s impacted, and the downstream work—plus the rationale for why it’s prioritized. So CS doesn’t have to chase product for status, and product doesn’t have to guess which issues carry the most commercial risk.",
      "link": "https://www.onyx.app/5080983-19"
    },
    {
      "text": "Henry Willis: What does a typical week look like if we had it? Like, what would my team actually do in the tool?",
      "link": "https://www.onyx.app/5080983-20"
    },
    {
      "text": "Camila Vega: In a typical week: CS reviews the top clusters impacting their book of business, subscribes key accounts to those clusters, and uses the cluster page as the single source of truth for status and evidence. When there’s movement—like a Jira ticket moving to “Released”—Issue_Tracker logs it and prompts follow-up so CSMs can proactively notify customers. And when leadership asks “what’s the biggest customer pain this week,” you can answer with a ranked list grounded in impact, not anecdotes.",
      "link": "https://www.onyx.app/5080983-21"
    },
    {
      "text": "Henry Willis: Makes sense. One concern: we already have a lot of dashboards. How do you avoid becoming another place people ignore?",
      "link": "https://www.onyx.app/5080983-22"
    },
    {
      "text": "Camila Vega: Totally. We focus on being the connective tissue, not “yet another dashboard.” The reason people use it is because it reduces work: fewer duplicate triage meetings, fewer Slack threads asking “is this the same issue,” and fewer manual follow-up lists. And because it links back to Zendesk conversations and forward to Jira work, teams don’t feel like they’re double-entering data.",
      "link": "https://www.onyx.app/5080983-23"
    },
    {
      "text": "Henry Willis: If we wanted to evaluate this, what would you recommend as a starting point?",
      "link": "https://www.onyx.app/5080983-24"
    },
    {
      "text": "Camila Vega: I’d suggest a short working session where we pick one or two high-impact areas—like your top support drivers or renewal-risk themes—and connect Zendesk plus Jira and your CRM fields for tier/ARR. Then we’d tune a simple priority model and validate it with you: does the top 10 match what you intuitively feel, and can we explain the differences?",
      "link": "https://www.onyx.app/5080983-25"
    },
    {
      "text": "Henry Willis: That seems reasonable. What would you need from me to make that session productive?",
      "link": "https://www.onyx.app/5080983-26"
    },
    {
      "text": "Camila Vega: Two things: (1) a quick read on how you tier customers—ARR bands or segments—and (2) an example of a recent issue that caused churn risk or a tough renewal conversation. That lets us show, in a concrete way, how the cluster forms, how it gets scored, and how the follow-up history would have worked once it shipped.",
      "link": "https://www.onyx.app/5080983-27"
    },
    {
      "text": "Henry Willis: I can pull that together. I like the follow-up trail idea—our leadership asks for proof we closed the loop, and it’s hard to show.",
      "link": "https://www.onyx.app/5080983-28"
    },
    {
      "text": "Camila Vega: Exactly. It turns “we think we notified everyone” into “here’s the record: these accounts were impacted, here’s the release milestone, and here’s when each customer was contacted.” It’s simple, but it’s powerful for trust and for internal accountability.",
      "link": "https://www.onyx.app/5080983-29"
    },
    {
      "text": "Henry Willis: Okay—let’s do the deeper dive. Can we get something on the calendar next week?",
      "link": "https://www.onyx.app/5080983-30"
    },
    {
      "text": "Camila Vega: Absolutely. How about a 30-minute session Tuesday or Wednesday? I’ll invite you, and if you want, one product ops or support ops partner—just someone who knows your Zendesk/Jira fields. We’ll keep it practical and map it to one real theme.",
      "link": "https://www.onyx.app/5080983-31"
    },
    {
      "text": "Henry Willis: Wednesday works better. Send me a couple times and I’ll pick one.",
      "link": "https://www.onyx.app/5080983-32"
    },
    {
      "text": "Camila Vega: Will do. I’ll send two options for Wednesday along with a short checklist of what to bring. Thanks, Henry—looking forward to showing you how Issue_Tracker can take that manual triage and follow-up load off your team.",
      "link": "https://www.onyx.app/5080983-33"
    },
    {
      "text": "Henry Willis: Sounds good, Camila. Talk soon.",
      "link": "https://www.onyx.app/5080983-34"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "camila_vega@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "henry_willis@vertexhollow_design.onyx.app"
    }
  ]
}