{
  "id": "FIREFLIES_5332795",
  "semantic_identifier": "5332795 - Jadecircuit Electronics - sales_pitch - Discussion with Liliana Zamora",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-02-08 00:00:00",
  "metadata": {
    "meeting_date": "2025-02-08 00:00:00",
    "duration_min": "27"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-02"
      ],
      "year_month": "2025-02",
      "meeting_title": "5332795 - Jadecircuit Electronics - sales_pitch - Discussion with Liliana Zamora",
      "organizer_email": "james_choi@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "James Choi: Hi Liliana—James Choi here. Thanks for taking a few minutes. I know you’re busy at Jadecircuit Electronics, so I’ll keep this tight. I’m calling because a lot of product and revenue teams tell us they’re being asked, “Which industries should we double down on next quarter?” but the data is scattered across CRM, support, and product usage. Does that sound familiar?",
      "link": "https://www.onyx.app/7626006-1"
    },
    {
      "text": "Liliana Zamora: Yes, definitely. We’re debating a couple verticals right now, and everyone has a different opinion based on whatever data they’re closest to.",
      "link": "https://www.onyx.app/7626006-2"
    },
    {
      "text": "James Choi: That’s exactly the scenario Customer_Analyzer is built for. It’s a SaaS tool that pulls together signals like CRM fields, onboarding surveys, product usage events, and support tickets—and then it turns that into practical outputs you can act on. The two that matter most for a quick win are: segment fit scoring and positioning recommendations. Have you already standardized on an ICP, or is it still evolving?",
      "link": "https://www.onyx.app/7626006-3"
    },
    {
      "text": "Liliana Zamora: We have an ICP on paper, but in reality we keep bending it. And support load has been a big issue—some segments churn less, but they’re heavy on tickets.",
      "link": "https://www.onyx.app/7626006-4"
    },
    {
      "text": "James Choi: Perfect example. One common use case we see is prioritizing which industries to target next quarter using retention and support burden signals—not just revenue potential. Customer_Analyzer can take retention, expansion, support volume, and even ticket themes, and create a fit score by segment so you can see, “This industry retains well but costs us a ton in support,” versus “This one is lower support and faster time-to-value.”",
      "link": "https://www.onyx.app/7626006-5"
    },
    {
      "text": "Liliana Zamora: That’s interesting. We currently look at retention in a dashboard and support in another system, but we don’t really combine them in a disciplined way.",
      "link": "https://www.onyx.app/7626006-6"
    },
    {
      "text": "James Choi: Right—and when those aren’t combined, decisions become debate-driven. What’s nice is the fit score isn’t a black box you can’t explain. It’s tied to drivers—like “integrates with X,” “uses feature Y weekly,” “tickets per account,” “time to onboard,” that kind of thing—so when you present it internally, you can defend why one segment is a better bet next quarter.",
      "link": "https://www.onyx.app/7626006-7"
    },
    {
      "text": "Liliana Zamora: Okay. How does it handle messaging, though? Because even if we pick a segment, our marketing team struggles to translate that into a clear story.",
      "link": "https://www.onyx.app/7626006-8"
    },
    {
      "text": "James Choi: That leads into the second feature I think you’d care about: positioning recommendations. Once you pick the segments you want to prioritize, Customer_Analyzer generates segment-specific messaging blocks—like a value proposition, top use cases, key differentiators, proof points to collect, and even objection handling. It’s grounded in observed customer language, so you’re not guessing at what resonates.",
      "link": "https://www.onyx.app/7626006-9"
    },
    {
      "text": "Liliana Zamora: When you say “observed customer language,” where is that coming from?",
      "link": "https://www.onyx.app/7626006-10"
    },
    {
      "text": "James Choi: A few places—support tickets are a big one because they contain the actual phrases customers use when they’re frustrated or when something is working. It can also pull in onboarding surveys, interview notes if you have them, and even sales notes in CRM. The output is editable—think website hero copy variants, sales deck bullets, and email openers—so your team can refine it, but you’re starting from evidence-based drafts rather than a blank page.",
      "link": "https://www.onyx.app/7626006-11"
    },
    {
      "text": "Liliana Zamora: That would help. We’ve been rewriting messaging every quarter and it’s not clear what’s actually improving performance.",
      "link": "https://www.onyx.app/7626006-12"
    },
    {
      "text": "James Choi: Exactly. And because the recommendations are linked back to the underlying drivers and evidence, your team can see “We’re claiming this differentiator because accounts in this segment repeatedly cite it and have higher retention,” versus “We think it sounds good.” That tends to speed up alignment between product, marketing, and sales—less back-and-forth, fewer opinion wars.",
      "link": "https://www.onyx.app/7626006-13"
    },
    {
      "text": "Liliana Zamora: Makes sense. What would you need from us to get something useful out of it? I’m always wary of tools that take months to set up.",
      "link": "https://www.onyx.app/7626006-14"
    },
    {
      "text": "James Choi: Totally fair. For an initial pass, we typically start lightweight: export of a few CRM fields for segmentation, a basic retention/churn view by industry, and support ticket metadata plus a sample of ticket text. If product usage events are accessible, great, but you can get value even without perfect instrumentation. The goal for the first couple weeks is to answer one question: “Which industries should Jadecircuit target next quarter when you factor in retention and support burden?”",
      "link": "https://www.onyx.app/7626006-15"
    },
    {
      "text": "Liliana Zamora: If we could answer that credibly, that’s a big win. We’re planning next quarter’s campaigns now.",
      "link": "https://www.onyx.app/7626006-16"
    },
    {
      "text": "James Choi: Great timing then. Let me ask: who usually owns that decision—marketing, product, revenue leadership?",
      "link": "https://www.onyx.app/7626006-17"
    },
    {
      "text": "Liliana Zamora: It’s a mix. Marketing proposes, sales pushes back, and product cares because support load becomes their problem too.",
      "link": "https://www.onyx.app/7626006-18"
    },
    {
      "text": "James Choi: That’s the classic triangle. In the full walkthrough, I’d show you two things: first, how the fit score looks by industry with drivers like retention and support burden weighted in; second, how the positioning recommendations turn the “why this segment” into “how we talk to them.” The outcome is you can go into a planning meeting with a prioritized list and a messaging starter kit.",
      "link": "https://www.onyx.app/7626006-19"
    },
    {
      "text": "Liliana Zamora: I like the idea of having the objection-handling piece too. Sales always asks for that, and marketing never has time to produce it.",
      "link": "https://www.onyx.app/7626006-20"
    },
    {
      "text": "James Choi: Exactly—and the objection handling is tied to real patterns we see in your signals. For example, if one segment consistently pushes back on implementation time, the playbook will suggest framing and proof points to collect—like “time-to-value in X days” or “integration checklist”—so you can proactively address it.",
      "link": "https://www.onyx.app/7626006-21"
    },
    {
      "text": "Liliana Zamora: This is sounding relevant. What does the next step look like?",
      "link": "https://www.onyx.app/7626006-22"
    },
    {
      "text": "James Choi: The next step is a full 30–45 minute call where I can show a sample workflow end-to-end and we can map it to your data sources. If it’s helpful, we can also outline a quick pilot focused on your next-quarter industry prioritization—one question, one deliverable. Would you be open to looping in whoever owns support analytics or your support ops lead for that call?",
      "link": "https://www.onyx.app/7626006-23"
    },
    {
      "text": "Liliana Zamora: Yes, I can bring our support ops manager. And maybe someone from marketing ops.",
      "link": "https://www.onyx.app/7626006-24"
    },
    {
      "text": "James Choi: Perfect. How’s your calendar early next week—Tuesday or Wednesday afternoon?",
      "link": "https://www.onyx.app/7626006-25"
    },
    {
      "text": "Liliana Zamora: Wednesday afternoon could work. Around 2:00?",
      "link": "https://www.onyx.app/7626006-26"
    },
    {
      "text": "James Choi: Wednesday at 2:00 works on my end. I’ll send an invite for 45 minutes. To make it productive, I’ll include a short checklist of the fields and exports that help—CRM segmentation fields, retention by industry, and support ticket data. If you can’t pull everything by then, no worries—we can still walk through and identify gaps.",
      "link": "https://www.onyx.app/7626006-27"
    },
    {
      "text": "Liliana Zamora: Sounds good. Send the checklist and I’ll see what we can gather.",
      "link": "https://www.onyx.app/7626006-28"
    },
    {
      "text": "James Choi: Will do. Last quick question—when you think about “support burden,” is it mainly ticket volume, severity, or something like time-to-resolution?",
      "link": "https://www.onyx.app/7626006-29"
    },
    {
      "text": "Liliana Zamora: All three, but volume and time-to-resolution are the two we track most consistently.",
      "link": "https://www.onyx.app/7626006-30"
    },
    {
      "text": "James Choi: Great—that’s enough to start. Thanks, Liliana. I’ll send the calendar invite and prep materials today, and we’ll use the Wednesday call to see if Customer_Analyzer can give Jadecircuit a clear segment priority and messaging direction for next quarter.",
      "link": "https://www.onyx.app/7626006-31"
    },
    {
      "text": "Liliana Zamora: Appreciate it, James. Talk Wednesday.",
      "link": "https://www.onyx.app/7626006-32"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "james_choi@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "liliana_zamora@jadecircuit_electronics.onyx.app"
    }
  ]
}