{
  "id": "FIREFLIES_1069984",
  "semantic_identifier": "1069984 - Xylembright Water Tech - sales_pitch - Discussion with Drew Cox",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-07-31 00:00:00",
  "metadata": {
    "meeting_date": "2025-07-31 00:00:00",
    "duration_min": "18"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-07"
      ],
      "year_month": "2025-07",
      "meeting_title": "1069984 - Xylembright Water Tech - sales_pitch - Discussion with Drew Cox",
      "organizer_email": "megan_foster@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Megan Foster: Hi Drew, thanks for taking a few minutes today. I’ll keep it tight—wanted to share a quick idea that could help Xylembright Water Tech get more consistent messaging across segments, especially if you’re running different motions for SMB versus mid-market.",
      "link": "https://www.onyx.app/4815675-1"
    },
    {
      "text": "Drew Cox: Sure, Megan. We are definitely trying to tighten up our segmentation and messaging. What are you thinking?",
      "link": "https://www.onyx.app/4815675-2"
    },
    {
      "text": "Megan Foster: Great. The product is Customer_Analyzer. It pulls in the customer signals you already have—CRM fields, onboarding survey responses, product usage events, support tickets, even interview notes—and turns them into two things teams actually use: a fit score by segment, and positioning recommendations you can deploy in marketing and sales.",
      "link": "https://www.onyx.app/4815675-3"
    },
    {
      "text": "Drew Cox: Fit score and positioning… okay. We have a CRM and some survey data, but it’s messy. How does it become something actionable?",
      "link": "https://www.onyx.app/4815675-4"
    },
    {
      "text": "Megan Foster: That messiness is exactly the point. Customer_Analyzer doesn’t just summarize—it identifies the “fit drivers” that correlate with strong outcomes for you, and then generates segment-specific messaging based on what high-fit customers actually say and do. So instead of debating internally, you get evidence-backed positioning blocks you can edit and ship.",
      "link": "https://www.onyx.app/4815675-5"
    },
    {
      "text": "Drew Cox: When you say “positioning blocks,” what does that look like in practice?",
      "link": "https://www.onyx.app/4815675-6"
    },
    {
      "text": "Megan Foster: Concretely: for a prioritized segment—say SMB utilities versus mid-market industrial customers—it produces an editable package: a segment-specific value proposition, top use cases, differentiators, proof points to collect, pricing/value framing notes, and an objection-handling playbook. And it formats the output into usable pieces like website hero copy, sales deck bullets, and outbound email openers. Every line is linked back to the drivers and evidence it used.",
      "link": "https://www.onyx.app/4815675-7"
    },
    {
      "text": "Drew Cox: That’s interesting. We’ve been trying to build separate landing pages for two ICP tiers, but it turns into a lot of subjective opinions.",
      "link": "https://www.onyx.app/4815675-8"
    },
    {
      "text": "Megan Foster: Exactly the use case I had in mind. For example, you could spin up two landing pages—SMB and mid-market—where the hero, the problem framing, and the proof points actually reflect what those segments care about. Then your outbound team gets matching email openers and objection handling, so it’s consistent from first click to sales call.",
      "link": "https://www.onyx.app/4815675-9"
    },
    {
      "text": "Drew Cox: How does it handle objection handling? That’s one of our gaps—reps aren’t consistent.",
      "link": "https://www.onyx.app/4815675-10"
    },
    {
      "text": "Megan Foster: The system looks at what comes up in tickets, notes, and call summaries—things like “integration effort,” “time-to-value,” “budget cycle,” “security reviews”—and it maps those objections to the fit drivers. Then it recommends responses tied to evidence: which proof points to use, what differentiators to emphasize for that segment, and how to frame pricing/value. It’s not generic; it’s segmented.",
      "link": "https://www.onyx.app/4815675-11"
    },
    {
      "text": "Drew Cox: Okay. And what do you need from us to do that? I’m assuming there’s some setup.",
      "link": "https://www.onyx.app/4815675-12"
    },
    {
      "text": "Megan Foster: Minimal to start. Typically we begin with CRM fields plus one or two additional sources—like onboarding surveys and support tickets—just to get the first pass. You don’t need perfect data on day one. The goal is to quickly generate a “version one” positioning package for two tiers—SMB vs mid-market—so you can validate it with your team and in-market.",
      "link": "https://www.onyx.app/4815675-13"
    },
    {
      "text": "Drew Cox: We’ve got HubSpot for CRM, Zendesk for support, and Typeform for onboarding surveys. Would that work?",
      "link": "https://www.onyx.app/4815675-14"
    },
    {
      "text": "Megan Foster: Yes, that’s a very common combo. We’d ingest those signals, then you’d pick the segments you care about—like employee size, industry, or geography—and Customer_Analyzer would produce fit scores and positioning recommendations for each. Most teams start with two ICP tiers like you mentioned.",
      "link": "https://www.onyx.app/4815675-15"
    },
    {
      "text": "Drew Cox: How fast can you get to something we can use? We’re trying to refresh our site messaging this quarter.",
      "link": "https://www.onyx.app/4815675-16"
    },
    {
      "text": "Megan Foster: If we can get access to the basics, we usually have initial segment recommendations in about a week or two—enough to draft two landing page variants and a corresponding outbound sequence. Then you iterate: tweak the blocks, add proof points you want to collect, and keep tightening based on what’s resonating.",
      "link": "https://www.onyx.app/4815675-17"
    },
    {
      "text": "Drew Cox: And how do you make sure it’s not just “AI copywriting”? We’ve tried tools that produce nice-sounding text but it doesn’t match reality.",
      "link": "https://www.onyx.app/4815675-18"
    },
    {
      "text": "Megan Foster: Totally fair. The difference here is the linkage to evidence. The recommendations are generated from the drivers we observe in your data—what correlates with renewals, expansion, activation, fewer tickets, faster onboarding, whatever metrics you choose. And it uses real customer language from surveys and tickets, so the messaging reflects how your customers describe the problem and value. You can click into “why this was recommended” and see the underlying signals.",
      "link": "https://www.onyx.app/4815675-19"
    },
    {
      "text": "Drew Cox: That transparency matters. Our leadership will ask, “Why are we saying this?”",
      "link": "https://www.onyx.app/4815675-20"
    },
    {
      "text": "Megan Foster: Exactly. Customer_Analyzer is designed for alignment—marketing, product, and sales can all see the same drivers and the same segment story. Instead of five different narratives, you get one consistent positioning per segment that everyone can use.",
      "link": "https://www.onyx.app/4815675-21"
    },
    {
      "text": "Drew Cox: This does sound relevant. What would a “full call” look like?",
      "link": "https://www.onyx.app/4815675-22"
    },
    {
      "text": "Megan Foster: In a longer session, we’d do three things: first, map your two ICP tiers and the outcomes you care about; second, review what signals you have in HubSpot/Zendesk/Typeform and pick a starter set; third, walk through an example output—landing page blocks, outbound openers, and the objection playbook—so you can see how your team would actually use it. If it makes sense, we’d outline a short pilot focused on SMB vs mid-market messaging.",
      "link": "https://www.onyx.app/4815675-23"
    },
    {
      "text": "Drew Cox: I’m interested. I’d want our head of marketing involved, maybe someone from sales enablement too.",
      "link": "https://www.onyx.app/4815675-24"
    },
    {
      "text": "Megan Foster: Perfect. That’s usually the right group. How about we schedule 45 minutes next week—bring your head of marketing and sales enablement—and I’ll tailor the demo around your SMB vs mid-market landing pages and outbound messaging?",
      "link": "https://www.onyx.app/4815675-25"
    },
    {
      "text": "Drew Cox: Yeah, let’s do that. Next week Tuesday afternoon could work.",
      "link": "https://www.onyx.app/4815675-26"
    },
    {
      "text": "Megan Foster: Great—Tuesday afternoon. I’ll send a calendar invite with a couple time options and a short pre-read: the sources we typically connect and a few questions to confirm your two ICP tiers. Anything specific you want to make sure we cover?",
      "link": "https://www.onyx.app/4815675-27"
    },
    {
      "text": "Drew Cox: Make sure we cover how we’d use it for outbound, not just the website. Our SDR team needs help.",
      "link": "https://www.onyx.app/4815675-28"
    },
    {
      "text": "Megan Foster: Absolutely—website plus outbound, end-to-end. I’ll include examples of segment-specific email openers and the objection-handling playbook tied to those segments. Thanks, Drew—I’ll get that invite over shortly.",
      "link": "https://www.onyx.app/4815675-29"
    },
    {
      "text": "Drew Cox: Sounds good. Looking forward to it.",
      "link": "https://www.onyx.app/4815675-30"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "megan_foster@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "drew_cox@xylembright_water_tech.onyx.app"
    }
  ]
}