{
  "id": "FIREFLIES_2801084",
  "semantic_identifier": "2801084 - Horizoncrest Systems - sales_call - Discussion with Julian Morgan",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-07-19 00:00:00",
  "metadata": {
    "meeting_date": "2025-07-19 00:00:00",
    "duration_min": "44"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-07"
      ],
      "year_month": "2025-07",
      "meeting_title": "2801084 - Horizoncrest Systems - sales_call - Discussion with Julian Morgan",
      "organizer_email": "camila_vega@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Camila Vega: Hi Julian—good to see you again. Last time you mentioned you’ve got recurring customer complaints getting lost between Zendesk and Jira, and it’s hard for Sales to know what’s truly “known” versus one-off noise. Today I wanted to focus on Issue_Tracker, specifically how it clusters issues and then ties those clusters back to active pipeline so you can prevent deal slippage. Does that still match what you’re trying to solve at Horizoncrest?",
      "link": "https://www.onyx.app/3123967-1"
    },
    {
      "text": "Julian Morgan: Yeah, that’s still the problem. We’re feeling it more with enterprise accounts—same theme comes in through different channels and the story changes depending on who you ask internally.",
      "link": "https://www.onyx.app/3123967-2"
    },
    {
      "text": "Camila Vega: Exactly. So Issue_Tracker sits between Zendesk/Intercom, Jira/Linear, and your CRM context. The main thing I want to show conceptually is the “issue object”: instead of 40 tickets, you get one cluster with evidence, impacted customers, and links to the source conversations and downstream engineering work. The feature that drives that is issue_clustering—automatic dedupe and grouping using semantic similarity plus rules you can control, like product area, severity, platform, keywords.  \nFor your Sales use case: when a late-stage opportunity is tied to a known issue cluster, Sales_Accelerator flags the deal at risk and Issue_Tracker shows status, ETA notes, and approved language on what’s safe to communicate.",
      "link": "https://www.onyx.app/3123967-3"
    },
    {
      "text": "Julian Morgan: I get the idea. My concern is whether the clustering is trustworthy. We’ve tried “smart tagging” tools before and they either merge stuff that isn’t the same, or they split the same issue into ten variations because customers describe it differently.",
      "link": "https://www.onyx.app/3123967-4"
    },
    {
      "text": "Camila Vega: That’s a fair concern, and it’s one we designed around. On the merge side, we provide suggested cluster names and representative examples, plus top phrases so someone can sanity-check quickly. There’s also a merge/split workflow with guardrails—so you’re not stuck with whatever the model decides. On the split side, the configurable rules help: you can enforce separation by product area or platform, and you can weight keywords that matter to you. The goal is to reduce duplicate triage work while still keeping human control for the edge cases.",
      "link": "https://www.onyx.app/3123967-5"
    },
    {
      "text": "Julian Morgan: But “human control” is still work. Our support ops team is two people. If we have to babysit clusters, it defeats the point.",
      "link": "https://www.onyx.app/3123967-6"
    },
    {
      "text": "Camila Vega: Totally. The intent isn’t that you review everything. In practice, teams usually focus review only on the clusters that matter—high volume, high severity, or tied to revenue exposure. The rest can run on autopilot. For Horizoncrest, we’d start with just a couple of product areas where enterprise pain is concentrated, and only set review rules around those.",
      "link": "https://www.onyx.app/3123967-7"
    },
    {
      "text": "Julian Morgan: I’m also worried about the false merge problem specifically. If we tell Sales “this is a known issue with an ETA” and it turns out we merged two different root causes, Sales is the one who gets burned.",
      "link": "https://www.onyx.app/3123967-8"
    },
    {
      "text": "Camila Vega: Right—and that’s why the cluster stores suspected root cause category and the evidence trail back to the exact tickets and conversations. So if Sales asks “what’s the proof,” you can click into the cluster and see the representative examples, affected products, and the linked Zendesk/Intercom records. Also, your approved-language note can be conservative—something like “we’re investigating reports of X” instead of “fix is coming Friday,” until engineering confirms.",
      "link": "https://www.onyx.app/3123967-9"
    },
    {
      "text": "Julian Morgan: That sounds like process, not tooling. We already do conservative language because we don’t trust our internal signal.",
      "link": "https://www.onyx.app/3123967-10"
    },
    {
      "text": "Camila Vega: Fair. The tooling changes the signal quality and speed. Instead of someone manually assembling “what we’ve heard,” Issue_Tracker continuously ingests and updates the cluster as new tickets come in. So when Sales asks, you’re not scrambling to piece together 12 threads. And because it links to downstream Jira work, you can show real status—like “In progress,” “Blocked,” “Released”—not just a Slack rumor.",
      "link": "https://www.onyx.app/3123967-11"
    },
    {
      "text": "Julian Morgan: How does the linkage work in reality? Because our Jira hygiene is… not great. Epics get created late, or engineers rename things, or the issue is fixed in a hotfix with no proper ticket.",
      "link": "https://www.onyx.app/3123967-12"
    },
    {
      "text": "Camila Vega: In environments like that, we usually start by linking clusters to whatever exists—Jira issue, epic, even a placeholder “investigation” ticket. The value is having a stable customer-facing issue record regardless of how Jira evolves. If Jira is messy, the cluster can still carry the narrative and evidence, and you can update status directly there. Over time, teams tend to improve hygiene because they can see the downstream impact on revenue risk.",
      "link": "https://www.onyx.app/3123967-13"
    },
    {
      "text": "Julian Morgan: I’m not sure we want another system where people have to update status. We already have Zendesk statuses, Jira statuses, and a spreadsheet someone maintains for Sales.",
      "link": "https://www.onyx.app/3123967-14"
    },
    {
      "text": "Camila Vega: Understood. Issue_Tracker is meant to replace the spreadsheet and reduce the “ask three teams” workflow. The status can be derived from Jira when it’s linked; where Jira is missing, you can keep a lightweight status note in the cluster with an owner. It’s less about adding work and more about consolidating it into something searchable and defensible.",
      "link": "https://www.onyx.app/3123967-15"
    },
    {
      "text": "Julian Morgan: Let’s talk about the Sales angle you mentioned. Our Sales org uses Salesforce and they’re very sensitive to anything that flags deals as “at risk.” They don’t want automated warnings that create noise.",
      "link": "https://www.onyx.app/3123967-16"
    },
    {
      "text": "Camila Vega: That’s why we typically scope it. We only surface risk when a deal is tied to a cluster that meets thresholds you define—like severity “high,” or revenue exposure above a certain amount, or specific ICP segments. And the “flag” isn’t just a red badge; it’s paired with the current status, ETA notes, and approved language so Sales knows what to do next.",
      "link": "https://www.onyx.app/3123967-17"
    },
    {
      "text": "Julian Morgan: Okay, but the core dependency is still the clustering quality. If it’s noisy, then the risk flagging is noisy.",
      "link": "https://www.onyx.app/3123967-18"
    },
    {
      "text": "Camila Vega: Agreed—clustering quality is foundational. What I can suggest is a short evaluation: we ingest, say, 60–90 days of Zendesk tickets for one product area, generate clusters, and then your support ops person spends an hour reviewing top clusters: merge/split where needed. We measure: reduction in duplicate triage, how accurately clusters map to real issues, and how often Sales questions the output. If it doesn’t hit the bar, we stop.",
      "link": "https://www.onyx.app/3123967-19"
    },
    {
      "text": "Julian Morgan: We’ve done pilots like that. They usually look decent in a demo dataset but break on our data. We have customers who describe the same thing with totally different language depending on segment—healthcare vs manufacturing. That’s where we see fragmentation.",
      "link": "https://www.onyx.app/3123967-20"
    },
    {
      "text": "Camila Vega: That’s a good example. In that case we’d tune rules by segment or channel, and we can use CRM context to help. If you know the account segment, we can see whether the same cluster appears across segments with different phrasing. The cluster still unifies the theme while preserving the segment-specific evidence.",
      "link": "https://www.onyx.app/3123967-21"
    },
    {
      "text": "Julian Morgan: “Tune rules” sounds like ongoing ML ops. We don’t have bandwidth for that. Also, our legal team is strict about pulling call notes and emails into third-party tools. Last time you mentioned ingesting call summaries—how are you handling data boundaries?",
      "link": "https://www.onyx.app/3123967-22"
    },
    {
      "text": "Camila Vega: On ingestion, we can start with Zendesk only—no call notes, no emails—if that’s your constraint. For CRM context, we can ingest just the minimal fields needed for prioritization, like ARR and segment, not full notes. But yes, if your policy blocks sharing that, we’d need to work within it.",
      "link": "https://www.onyx.app/3123967-23"
    },
    {
      "text": "Julian Morgan: That’s the thing—I don’t think we can share ARR or deal stage into another system right now. Procurement and legal will push back hard. Without that context, your “prioritize by business impact” pitch loses a lot of juice.",
      "link": "https://www.onyx.app/3123967-24"
    },
    {
      "text": "Camila Vega: It does limit prioritization, though you’d still get volume trends and dedupe. And you can prioritize with proxies like ticket volume and severity tags.",
      "link": "https://www.onyx.app/3123967-25"
    },
    {
      "text": "Julian Morgan: We already have volume dashboards. They’re not perfect, but they’re ours. The incremental value has to be clear, and I’m not hearing something that offsets the risk of false merges plus the legal overhead.",
      "link": "https://www.onyx.app/3123967-26"
    },
    {
      "text": "Camila Vega: Understood. If we set aside CRM-based prioritization for now, would it still be valuable to have the searchable “issue object” that ties Zendesk to Jira, so teams stop re-triaging the same theme?",
      "link": "https://www.onyx.app/3123967-27"
    },
    {
      "text": "Julian Morgan: Maybe, but honestly, Jira linkage is also tricky. Our engineering teams won’t commit to maintaining links, and if they don’t, Sales will still ask us for updates and we’ll still be doing manual work.",
      "link": "https://www.onyx.app/3123967-28"
    },
    {
      "text": "Camila Vega: If engineering won’t link, then you’d be relying on your team to link the top few clusters to the right Jira work, which I realize is not ideal. Given what you’re saying—legal constraints plus low willingness to change workflows—it may not be the right time to push this.",
      "link": "https://www.onyx.app/3123967-29"
    },
    {
      "text": "Julian Morgan: That’s where I’m landing. I like the concept, but we’re not set up culturally or legally to feed the system what it needs, and I can’t sponsor a tool that could mislead Sales if clusters are off.",
      "link": "https://www.onyx.app/3123967-30"
    },
    {
      "text": "Camila Vega: That’s fair, Julian. Rather than forcing a fit, how about this: I’ll send a one-pager outlining a “Zendesk-only, no-CRM” configuration and the specific questions it can and can’t answer. If down the road legal loosens, or engineering is ready to standardize Jira linking, we can revisit. Does that work?",
      "link": "https://www.onyx.app/3123967-31"
    },
    {
      "text": "Julian Morgan: Yeah, send it over. But I want to be transparent: we’re not moving forward this quarter.",
      "link": "https://www.onyx.app/3123967-32"
    },
    {
      "text": "Camila Vega: I appreciate the clarity. I’ll send that summary today, and I’ll check back in a couple months unless you reach out sooner. Thanks for your time, Julian.",
      "link": "https://www.onyx.app/3123967-33"
    },
    {
      "text": "Julian Morgan: Thanks, Camila.",
      "link": "https://www.onyx.app/3123967-34"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "camila_vega@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "julian_morgan@horizoncrest_systems.onyx.app"
    }
  ]
}