{
  "id": "FIREFLIES_6945835",
  "semantic_identifier": "6945835 - Wavelink Marine Systems - sales_pitch - Discussion with Joaquin Bennett",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-07-06 00:00:00",
  "metadata": {
    "meeting_date": "2025-07-06 00:00:00",
    "duration_min": "34"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-07"
      ],
      "year_month": "2025-07",
      "meeting_title": "6945835 - Wavelink Marine Systems - sales_pitch - Discussion with Joaquin Bennett",
      "organizer_email": "mina_park@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Mina Park: Hi Joaquin—Mina Park here. Thanks for taking a few minutes. I’ll be brief: I work with teams that are trying to tighten up who they’re selling to and how they talk about the product, so sales and marketing aren’t improvising segment by segment. Does that sound relevant at Wavelink Marine Systems right now?",
      "link": "https://www.onyx.app/5004632-1"
    },
    {
      "text": "Joaquin Bennett: Hey Mina, yeah, we’re definitely feeling some of that. We have a few different buyer types and the messaging gets inconsistent. What are you thinking?",
      "link": "https://www.onyx.app/5004632-2"
    },
    {
      "text": "Mina Park: Perfect. The product is called Customer_Analyzer. It pulls together the customer signals you already have—CRM fields, onboarding surveys, product usage, support tickets, even interview notes—and turns them into practical outputs your team can actually use. The one I wanted to focus on is our positioning recommendations: it generates segment-specific messaging and an objection-handling playbook tied to the strongest value drivers for your best-fit accounts.",
      "link": "https://www.onyx.app/5004632-3"
    },
    {
      "text": "Joaquin Bennett: When you say “positioning recommendations,” is this like generic templates, or is it actually based on our data?",
      "link": "https://www.onyx.app/5004632-4"
    },
    {
      "text": "Mina Park: It’s grounded in your data and customer language. We identify the fit drivers—what patterns correlate with successful, retained customers—and then the system produces editable messaging blocks that map back to the evidence. So you’re not just getting “here’s a value prop,” you’re getting “here’s why this value prop is the right one for this segment,” plus proof points to collect and the top objections you’ll hit with suggested responses.",
      "link": "https://www.onyx.app/5004632-5"
    },
    {
      "text": "Joaquin Bennett: Interesting. We’ve got a constant problem where reps are handling objections differently. Some of them over-discount, some over-promise. How does your objection guide actually help with that?",
      "link": "https://www.onyx.app/5004632-6"
    },
    {
      "text": "Mina Park: That’s exactly the sales enablement use case we see most often. Customer_Analyzer outputs an objection-handling playbook per prioritized segment—so, for example, if one buyer segment is highly price-sensitive and another is more risk-focused, you’ll get different framing. It also includes pricing/value framing notes so your team can defend value consistently—without making every deal a one-off negotiation.",
      "link": "https://www.onyx.app/5004632-7"
    },
    {
      "text": "Joaquin Bennett: Okay. What kind of setup are we talking about? I don’t want something that takes months and requires engineering.",
      "link": "https://www.onyx.app/5004632-8"
    },
    {
      "text": "Mina Park: Totally fair. Typically we start by connecting what you already have: a CRM export or integration, and then one or two other sources like support tickets or onboarding surveys. You can also upload notes from interviews or call summaries. The goal is to get enough signal to generate an initial set of segments and messaging blocks quickly—then your team edits and approves them. It’s designed to be lightweight to start and more robust as you add data.",
      "link": "https://www.onyx.app/5004632-9"
    },
    {
      "text": "Joaquin Bennett: And the output—where does it live? Is it in your tool only, or can we share it with sales easily?",
      "link": "https://www.onyx.app/5004632-10"
    },
    {
      "text": "Mina Park: You can share it easily. The recommendations come as editable blocks—think website hero copy, sales deck bullets, email openers, and the objection responses—so enablement can drop them into whatever you use today. The important part is they’re linked back to the drivers and evidence, so when a rep asks “why are we saying this?” you’re not hand-waving.",
      "link": "https://www.onyx.app/5004632-11"
    },
    {
      "text": "Joaquin Bennett: That linkage sounds useful. We’ve had internal debates where marketing says one thing and sales says another, and nobody can point to real customer language.",
      "link": "https://www.onyx.app/5004632-12"
    },
    {
      "text": "Mina Park: Exactly. It gives you a common source of truth based on observed language and outcomes. One quick example: if support tickets show a segment repeatedly mentioning downtime or compliance, that becomes a driver, and the positioning leans into reliability and risk reduction—with suggested proof points to go collect. It helps align marketing, sales, and product around what’s actually winning.",
      "link": "https://www.onyx.app/5004632-13"
    },
    {
      "text": "Joaquin Bennett: Makes sense. How do you decide “best-fit” segments? We have customers we like, but sometimes they’re not the biggest revenue.",
      "link": "https://www.onyx.app/5004632-14"
    },
    {
      "text": "Mina Park: Great question. We look at whatever “success” means for you—renewal, expansion, product adoption, sales cycle length, support burden—and we can weight those. The fit score helps you see which segments match the product’s current strengths, not just which ones are large. Then the positioning recommendations focus on the segments you choose to prioritize.",
      "link": "https://www.onyx.app/5004632-15"
    },
    {
      "text": "Joaquin Bennett: If we did this, I’d want enablement involved and probably someone from marketing. Do you normally do a working session?",
      "link": "https://www.onyx.app/5004632-16"
    },
    {
      "text": "Mina Park: Yes. The best next step is a 30–45 minute working call where we learn your current segments, top objections you hear, and what data sources you have. Then we can show what the segment-specific messaging blocks and objection guide would look like for Wavelink—using a small sample or a sanitized export if needed.",
      "link": "https://www.onyx.app/5004632-17"
    },
    {
      "text": "Joaquin Bennett: That sounds reasonable. What would you need from me before that call?",
      "link": "https://www.onyx.app/5004632-18"
    },
    {
      "text": "Mina Park: Minimal. If you can come with: (1) the top 5 objections your reps hear, (2) a quick list of the customer segments you think exist today, and (3) where your customer signals live—CRM, support system, onboarding survey tool—that’s enough. If you’re comfortable sharing a simple export later, we can use it to generate a more tailored first pass.",
      "link": "https://www.onyx.app/5004632-19"
    },
    {
      "text": "Joaquin Bennett: Okay. I can pull the objections and segments, and I can loop in our sales enablement lead and someone from marketing ops. When are you thinking?",
      "link": "https://www.onyx.app/5004632-20"
    },
    {
      "text": "Mina Park: I’ve got openings Wednesday at 11:00am or Thursday at 2:30pm your time. We’ll keep it focused: align on segments, review a sample positioning recommendation structure, and map out an objection-handling guide tied to your strongest value drivers.",
      "link": "https://www.onyx.app/5004632-21"
    },
    {
      "text": "Joaquin Bennett: Thursday at 2:30 works. Send the invite and include a brief agenda so I can forward it.",
      "link": "https://www.onyx.app/5004632-22"
    },
    {
      "text": "Mina Park: Perfect—I’ll send a calendar invite for Thursday 2:30 with the agenda and the three prep items. Appreciate it, Joaquin. Looking forward to showing you what Customer_Analyzer can do for your team.",
      "link": "https://www.onyx.app/5004632-23"
    },
    {
      "text": "Joaquin Bennett: Sounds good. Thanks, Mina.",
      "link": "https://www.onyx.app/5004632-24"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mina_park@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "joaquin_bennett@wavelink_marine_systems.onyx.app"
    }
  ]
}