{
  "id": "FIREFLIES_7623050",
  "semantic_identifier": "7623050 - Echostone Industries - sales_pitch - Discussion with Terry Bennett",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-07-04 00:00:00",
  "metadata": {
    "meeting_date": "2025-07-04 00:00:00",
    "duration_min": "42"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-07"
      ],
      "year_month": "2025-07",
      "meeting_title": "7623050 - Echostone Industries - sales_pitch - Discussion with Terry Bennett",
      "organizer_email": "sneha_reddy@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Sneha Reddy: Hi Terry—thanks for taking a few minutes. I’ll keep this tight. I’m Sneha at Issue_Tracker, and we help product and support teams turn messy, repetitive customer-reported problems into clear, deduped “issue themes” that can be prioritized with business context—without replacing Zendesk, Salesforce, or Jira.",
      "link": "https://www.onyx.app/7650014-1"
    },
    {
      "text": "Terry Bennett: Hi Sneha. Okay—what do you mean by “issue themes”? We already tag tickets in Zendesk and then log the big stuff in Jira.",
      "link": "https://www.onyx.app/7650014-2"
    },
    {
      "text": "Sneha Reddy: Totally—most teams do. The gap we see is that tags and tickets don’t reliably roll up into a defensible, shared “issue object” across teams. Issue_Tracker sits between your support channels and delivery tools: it continuously ingests tickets from Zendesk/Intercom, deduplicates and clusters similar reports into a single theme, and keeps the evidence trail—links back to every source conversation—while also syncing downstream to Jira or Linear for execution.",
      "link": "https://www.onyx.app/7650014-3"
    },
    {
      "text": "Terry Bennett: So it’s like deduping and grouping at scale. But we’ve tried some automation before; it either over-clusters or creates noise. How does it avoid that?",
      "link": "https://www.onyx.app/7650014-4"
    },
    {
      "text": "Sneha Reddy: Great question. Two key pieces: first, you can configure dedupe rules and field mapping per connector—so you control what metadata matters (product area, environment, severity signals, customer tier, etc.). Second, because we keep back-links to the original tickets and the engineering work items, it’s easy to audit: product and support can quickly confirm “yes, these are the same root cause” or split clusters when needed. The goal is not a black box—it’s a searchable, explainable history of “why we decided this is the issue.”",
      "link": "https://www.onyx.app/7650014-5"
    },
    {
      "text": "Terry Bennett: Okay. But prioritization is the real pain. We get a lot of volume from smaller customers, and the enterprise complaints are fewer but louder. How do you handle that?",
      "link": "https://www.onyx.app/7650014-6"
    },
    {
      "text": "Sneha Reddy: That’s exactly where Issue_Tracker tends to land value fast. We integrate with Salesforce or HubSpot to pull account value and opportunity context, and we can also pull fit tier/segment from Customer_Analyzer. Then when an issue theme forms, it’s automatically weighted by who’s impacted—so a cluster hitting your ICP Tier-1 accounts outranks a similar-volume issue from low-fit segments. Product leadership gets a ranked list that’s grounded in revenue exposure and ICP importance, not just ticket count.",
      "link": "https://www.onyx.app/7650014-7"
    },
    {
      "text": "Terry Bennett: We do have a fit model, but it lives in a couple different places. So you’d actually connect to Salesforce and ingest that context?",
      "link": "https://www.onyx.app/7650014-8"
    },
    {
      "text": "Sneha Reddy: Yes—via connectors. Typically we connect Zendesk as the source of reported issues, Salesforce as the customer/value context, and Jira as the delivery system of record. We map the fields once—like Account ID, ARR band, segment tier—and then every cluster carries that context. When someone clicks into a theme, they can see “impacted customers,” “linked opportunities,” and then jump straight back to the original Zendesk tickets or the linked Jira epics.",
      "link": "https://www.onyx.app/7650014-9"
    },
    {
      "text": "Terry Bennett: That linking sounds useful. Today, the handoff is messy—support says “it’s big,” product says “show me data,” engineering says “where’s the repro,” and we lose time.",
      "link": "https://www.onyx.app/7650014-10"
    },
    {
      "text": "Sneha Reddy: Exactly. Issue_Tracker standardizes the issue object so it’s not just “a ticket” or “a Jira story.” It’s: theme/root cause, evidence, impacted customers, and delivery status—kept in sync across tools. That reduces the back-and-forth because everyone is looking at the same artifact, and you can trace it from customer conversation → cluster → engineering work item.",
      "link": "https://www.onyx.app/7650014-11"
    },
    {
      "text": "Terry Bennett: What does “in sync” mean here? Are you creating Jira tickets automatically?",
      "link": "https://www.onyx.app/7650014-12"
    },
    {
      "text": "Sneha Reddy: We can, but we don’t have to. Most teams start with linking: once a cluster is confirmed, you associate it with an existing Jira epic or create a new one from the cluster. Either way, Issue_Tracker keeps the back-linking so you can navigate both directions. And if statuses change in Jira, we reflect that on the issue theme so support and product can see what’s actively being worked, what’s blocked, and what’s shipped.",
      "link": "https://www.onyx.app/7650014-13"
    },
    {
      "text": "Terry Bennett: That would help with “what’s the status?” questions. Our CSMs ask weekly and we scramble.",
      "link": "https://www.onyx.app/7650014-14"
    },
    {
      "text": "Sneha Reddy: Exactly—plus the prioritization piece helps you decide what to fix next with more confidence. One use case we see with product leadership is roadmap triage: they look at ranked issue clusters weighted by Customer_Analyzer fit tiers, and it becomes much clearer why a Tier-1 problem should jump the line even if it’s only, say, 12 tickets compared to 80 from long-tail segments.",
      "link": "https://www.onyx.app/7650014-15"
    },
    {
      "text": "Terry Bennett: Makes sense. Implementation-wise, how heavy is it? We don’t have appetite for a multi-month rollout.",
      "link": "https://www.onyx.app/7650014-16"
    },
    {
      "text": "Sneha Reddy: Usually it’s light to start. A common first phase is: connect Zendesk + Salesforce + Jira, map a handful of key fields, and set initial dedupe rules. Then we pilot on one product area or one support queue for a couple weeks—enough to see whether the clustering and ranking reflects reality. If it does, we expand coverage.",
      "link": "https://www.onyx.app/7650014-17"
    },
    {
      "text": "Terry Bennett: What would you need from us to do that pilot?",
      "link": "https://www.onyx.app/7650014-18"
    },
    {
      "text": "Sneha Reddy: For a pilot scoping call, I’d want to understand: which Zendesk views or tags represent your highest-volume or highest-risk areas, what fields in Salesforce define value/segment for you, and how you currently represent customer issues in Jira (epics vs. projects, naming conventions). Then we can propose a minimal mapping and a success metric—like “reduce duplicate Jira logging,” “time-to-triage,” and “better prioritization by Tier-1 impact.”",
      "link": "https://www.onyx.app/7650014-19"
    },
    {
      "text": "Terry Bennett: I like the idea of a constrained pilot. One concern: our data hygiene in Zendesk isn’t perfect. Will that break the clustering?",
      "link": "https://www.onyx.app/7650014-20"
    },
    {
      "text": "Sneha Reddy: It won’t break it, but it can influence quality—so we usually start with what’s reliable: ticket text, product area if you have it, customer/account link, and any consistent categories. Since we pull account context from Salesforce, even if Zendesk fields are messy, you still get strong prioritization by who’s impacted. And because clusters are auditable, your team can correct the few that are off without babysitting everything.",
      "link": "https://www.onyx.app/7650014-21"
    },
    {
      "text": "Terry Bennett: Got it. This sounds relevant. I’d want my head of support ops and someone from product ops on the next call.",
      "link": "https://www.onyx.app/7650014-22"
    },
    {
      "text": "Sneha Reddy: Perfect. How about we schedule a 30-minute working session this week—just to map your Zendesk → Salesforce → Jira flow and pick one queue to pilot? If it’s helpful, I can bring a quick example of what the ranked issue themes dashboard looks like and how the back-links work end-to-end.",
      "link": "https://www.onyx.app/7650014-23"
    },
    {
      "text": "Terry Bennett: Yes—let’s do that. Thursday afternoon is best for me. Can you send an invite for, say, 2:00 PM?",
      "link": "https://www.onyx.app/7650014-24"
    },
    {
      "text": "Sneha Reddy: Thursday at 2:00 PM works. I’ll send a calendar invite with a short agenda and a couple questions to prep—mainly which Salesforce fields define Tier-1 for you and which Zendesk view we should start with.",
      "link": "https://www.onyx.app/7650014-25"
    },
    {
      "text": "Terry Bennett: Great. Send it over and I’ll loop in the right folks.",
      "link": "https://www.onyx.app/7650014-26"
    },
    {
      "text": "Sneha Reddy: Will do. Thanks, Terry—talk Thursday.",
      "link": "https://www.onyx.app/7650014-27"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "sneha_reddy@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "terry_bennett@echostone_industries.onyx.app"
    }
  ]
}