{
  "id": "FIREFLIES_8878747",
  "semantic_identifier": "8878747 - Dunecrown Mining - sales_call - Discussion with Bianca Ramirez",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-07-24 00:00:00",
  "metadata": {
    "meeting_date": "2025-07-24 00:00:00",
    "duration_min": "18"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-07"
      ],
      "year_month": "2025-07",
      "meeting_title": "8878747 - Dunecrown Mining - sales_call - Discussion with Bianca Ramirez",
      "organizer_email": "james_choi@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "James Choi: Hi Bianca, good to see you again. Last time you mentioned you’re drowning in repeat tickets and it’s hard to tell what’s truly widespread versus just noisy. I wanted to focus today on how Issue_Tracker would handle your monthly volume and what it would look like operationally for Support Ops at Dunecrown.",
      "link": "https://www.onyx.app/9088560-1"
    },
    {
      "text": "Bianca Ramirez: Hi James. Yeah, that’s still the biggest pain. We’re at roughly 5,000 tickets a month, and our team spends a ton of time arguing about what’s “real” versus one-off. I’m open to hearing more, but I’m also wary of another system we have to babysit.",
      "link": "https://www.onyx.app/9088560-2"
    },
    {
      "text": "James Choi: Totally fair. The core thing we’re pitching is Issue_Tracker as an intelligence and triage layer that sits between Zendesk and Jira—so it’s not replacing either. The feature I think maps most directly to what you said is issue_clustering: it automatically groups tickets, chats, and even call-note summaries into deduped clusters using semantic similarity plus rules you can set—like product area, severity, or keywords. The output is typically something like “80 active themes” instead of 5,000 separate items.",
      "link": "https://www.onyx.app/9088560-3"
    },
    {
      "text": "Bianca Ramirez: Okay, clustering sounds good in theory. But we’ve tried tagging and macros and all that. It becomes a mess quickly. How is this different from just a fancy labeler?",
      "link": "https://www.onyx.app/9088560-4"
    },
    {
      "text": "James Choi: Two differences. First, it’s deduping across channels and wording differences—so “app crash on login” and “can’t sign in, spins forever” get grouped even if agents tag them differently. Second, the cluster itself becomes the object you manage: it has representative examples, top phrases, suggested names, suspected root cause category (bug vs UX vs integration vs missing feature), and—importantly—links back to the source Zendesk tickets so you can prove it’s real. Then you can merge or split clusters with guardrails when the model is too broad or too narrow.",
      "link": "https://www.onyx.app/9088560-5"
    },
    {
      "text": "Bianca Ramirez: I like the “prove it’s real” part. But my concern is accuracy. We have multiple subsidiaries and a lot of duplicate contacts in CRM. If you’re linking tickets back to accounts and revenue impact, that’s where things go sideways for us.",
      "link": "https://www.onyx.app/9088560-6"
    },
    {
      "text": "James Choi: That’s a great callout and it’s one of the known challenges: integration mapping complexity, especially identity resolution and ticket-to-account matching. In practice, we start by mapping the identifiers you trust most—like domain + CRM account ID—and then we set rules for edge cases: duplicate contacts, shared inboxes, custom CRM fields. We also flag “unresolved identity” items so they don’t skew impact calculations.",
      "link": "https://www.onyx.app/9088560-7"
    },
    {
      "text": "Bianca Ramirez: But our Zendesk org doesn’t always have clean account IDs. Sometimes it’s just an email, and the email might be a contractor. And we’ve got custom fields that aren’t consistent. If the impact calculation is wrong, we’ll prioritize the wrong things and lose credibility with Product and Engineering.",
      "link": "https://www.onyx.app/9088560-8"
    },
    {
      "text": "James Choi: Understood. One way teams handle that is to initially use clustering purely for volume and trend visibility—no revenue weighting—until identity is stable. So week one is: cluster 5,000 tickets into themes, and route the top 10 clusters to your weekly product/engineering review with examples and affected customer lists where available. Then phase two is layering on CRM impact once mapping is validated.",
      "link": "https://www.onyx.app/9088560-9"
    },
    {
      "text": "Bianca Ramirez: That phased approach is better. But even just “affected customer lists where available” worries me because “where available” is doing a lot of work there. We’ve been burned by tools that promise enrichment and then it’s a lot of manual cleanup.",
      "link": "https://www.onyx.app/9088560-10"
    },
    {
      "text": "James Choi: Fair. Let me make it concrete. For Dunecrown, we’d define the workflow as: Support Ops reviews the top clusters weekly, uses the merge/split controls when something looks off, and exports or syncs the top clusters to Jira as a linked issue theme. Your agents don’t have to change their day-to-day. The only “new” behavior is someone owning the cluster review—say 30–45 minutes a week once it’s tuned.",
      "link": "https://www.onyx.app/9088560-11"
    },
    {
      "text": "Bianca Ramirez: Who typically owns that? Because I don’t have spare people. And we already do a weekly triage meeting that runs long.",
      "link": "https://www.onyx.app/9088560-12"
    },
    {
      "text": "James Choi: Usually Support Ops or a Support PM. The goal is to shorten the meeting because you walk in with “here are the top 10 clusters by volume and severity, with examples,” rather than debating from anecdotes. In other accounts at your scale, it’s been the difference between a two-hour meeting and a 45-minute one.",
      "link": "https://www.onyx.app/9088560-13"
    },
    {
      "text": "Bianca Ramirez: I’m not sure our org behaves that way. Engineering will immediately ask, “Is this actually the same bug?” And if the cluster has mixed root causes, they’ll reject it. We have a lot of issues that look similar but come from different site configurations.",
      "link": "https://www.onyx.app/9088560-14"
    },
    {
      "text": "James Choi: That’s exactly why the merge/split workflow exists. When Engineering says “these are two different root causes,” you split the cluster and keep the history of why. Over time, you end up with a defensible taxonomy of issues and decisions instead of starting from scratch every week.",
      "link": "https://www.onyx.app/9088560-15"
    },
    {
      "text": "Bianca Ramirez: That sounds nice, but it also sounds like ongoing curation. We don’t want a system that needs constant training. Does it drift? Like if our product changes or we have a new module?",
      "link": "https://www.onyx.app/9088560-16"
    },
    {
      "text": "James Choi: There’s always some drift as language changes, but the configurable rules help—product area, platform, severity. And the system learns from merge/split actions to improve clustering quality. That said, you’d want someone to review the top clusters regularly.",
      "link": "https://www.onyx.app/9088560-17"
    },
    {
      "text": "Bianca Ramirez: So it’s not “set it and forget it.”",
      "link": "https://www.onyx.app/9088560-18"
    },
    {
      "text": "James Choi: It’s not fully hands-off, no. It’s more like “reduce 80% of the noise automatically, and apply human judgment to the top 20% that matters.” The key is you’re spending time on the themes that actually impact customers rather than combing through individual tickets.",
      "link": "https://www.onyx.app/9088560-19"
    },
    {
      "text": "Bianca Ramirez: Let’s talk integration. We use Zendesk and Jira, yes, but our CRM is… complicated. We have multiple instances and a bunch of custom fields. How painful is setup realistically?",
      "link": "https://www.onyx.app/9088560-20"
    },
    {
      "text": "James Choi: For a straightforward CRM it can be quick, but with multiple instances and custom fields, it will take effort. We’d need to align on your source of truth for account identity, decide which fields drive segmentation, and handle duplicates. If you want revenue exposure and deal-risk prioritization, we’d need solid mapping.",
      "link": "https://www.onyx.app/9088560-21"
    },
    {
      "text": "Bianca Ramirez: That’s what I was afraid of. Our RevOps team is already slammed, and I can’t get them to commit to another integration project this quarter. If we can’t do the impact weighting reliably, then the prioritization benefit is diminished.",
      "link": "https://www.onyx.app/9088560-22"
    },
    {
      "text": "James Choi: We can still deliver value on clustering and trend visibility without CRM weighting, like we discussed. You’d still get the “80 themes” view and the ability to route the top 10 to Engineering weekly with examples.",
      "link": "https://www.onyx.app/9088560-23"
    },
    {
      "text": "Bianca Ramirez: But we already have an internal report that buckets tickets by category and product. It’s messy, but it’s “good enough,” and it doesn’t require a new vendor. I’d need a very clear ROI to justify switching, especially if there’s setup risk.",
      "link": "https://www.onyx.app/9088560-24"
    },
    {
      "text": "James Choi: Understood. Would it help if we scoped a small pilot—say, one product area—where we ingest Zendesk only, generate clusters, and compare how many duplicates you’re currently triaging manually?",
      "link": "https://www.onyx.app/9088560-25"
    },
    {
      "text": "Bianca Ramirez: Maybe, but even pilots take time. We’re in the middle of a backlog push, and my priority is stabilizing response times. Also, if the clustering is wrong early on, stakeholders will write it off quickly.",
      "link": "https://www.onyx.app/9088560-26"
    },
    {
      "text": "James Choi: If we did the pilot, we’d start with a calibration week where we tune rules—product area, severity keywords, platform. Then you’d review the top clusters, merge/split, and we’d measure: how many tickets get captured in the top themes, and how much meeting time is reduced.",
      "link": "https://www.onyx.app/9088560-27"
    },
    {
      "text": "Bianca Ramirez: I hear you, but I’m not confident we can give it the attention it needs. And I’m especially concerned about the account matching. If the tool can’t reliably tell me which customers are impacted, it’s going to create more debates, not fewer.",
      "link": "https://www.onyx.app/9088560-28"
    },
    {
      "text": "James Choi: That’s fair, Bianca. If identity resolution is the blocker, we can either keep it out of scope at first or we can do a discovery with your RevOps to see if there’s a simpler mapping path.",
      "link": "https://www.onyx.app/9088560-29"
    },
    {
      "text": "Bianca Ramirez: I don’t think I can pull RevOps in right now. And honestly, without that linkage, I’m not sure I can get buy-in for another platform—even if clustering is better than what we have.",
      "link": "https://www.onyx.app/9088560-30"
    },
    {
      "text": "James Choi: Got it. What would need to be true for this to be worth revisiting? Timing, resourcing, or a specific trigger like a support volume spike?",
      "link": "https://www.onyx.app/9088560-31"
    },
    {
      "text": "Bianca Ramirez: Timing and resourcing. Maybe after this quarter when our CRM cleanup project is done. If we can standardize account IDs between Zendesk and CRM, then I could see re-evaluating. Right now, it feels like we’d spend a lot of time fighting data quality.",
      "link": "https://www.onyx.app/9088560-32"
    },
    {
      "text": "James Choi: That makes sense. Why don’t we do this: I’ll send a short summary of the phased approach—clustering first, impact weighting later—along with an integration checklist that highlights what would need to be in place for clean account matching. Then we can circle back when your CRM cleanup is further along.",
      "link": "https://www.onyx.app/9088560-33"
    },
    {
      "text": "Bianca Ramirez: That works. Send the checklist, and we’ll keep it on the radar. I just can’t commit to a pilot or purchase right now.",
      "link": "https://www.onyx.app/9088560-34"
    },
    {
      "text": "James Choi: Understood. I’ll follow up with that summary and we can tentatively plan a check-in next quarter. Thanks for being candid today.",
      "link": "https://www.onyx.app/9088560-35"
    },
    {
      "text": "Bianca Ramirez: Thanks, James. Talk soon.",
      "link": "https://www.onyx.app/9088560-36"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "james_choi@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "bianca_ramirez@dunecrown_mining.onyx.app"
    }
  ]
}