{
  "id": "FIREFLIES_2189142",
  "semantic_identifier": "2189142 - Yarrowgate Investment - sales_call - Discussion with Leah Wheeler",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2026-01-21 00:00:00",
  "metadata": {
    "meeting_date": "2026-01-21 00:00:00",
    "duration_min": "40"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2026-01"
      ],
      "year_month": "2026-01",
      "meeting_title": "2189142 - Yarrowgate Investment - sales_call - Discussion with Leah Wheeler",
      "organizer_email": "irene_shen@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Irene Shen: Hi Leah—good to see you again. Thanks for making time. Last time you mentioned the “what do we fix next” debate between Support and Product, and you had interest in Issue_Tracker as a way to standardize that. Today I was hoping we could pressure-test the prioritization feature and what it would look like to roll it out at Yarrowgate Investment. Does that work?",
      "link": "https://www.onyx.app/9747792-1"
    },
    {
      "text": "Leah Wheeler: Yeah, that’s fine. We’re still interested, but we’re also wary. We’ve been burned by tooling that promises alignment and then just creates another dashboard no one trusts.",
      "link": "https://www.onyx.app/9747792-2"
    },
    {
      "text": "Irene Shen: Totally fair. Let me anchor on one thing so this doesn’t become “another dashboard.” Issue_Tracker isn’t trying to replace Zendesk or Jira. It sits between them and creates a consistent “issue object”—a clustered theme with evidence, impacted accounts, and links back to the original tickets and forward to Jira work. The feature you asked most about was issue prioritization—an explainable score based on things you already care about: frequency/velocity, severity tags, customer tier/ARR, churn risk flags, and segment importance. You can view that score differently depending on the team—Support, Product, Sales, Exec.",
      "link": "https://www.onyx.app/9747792-3"
    },
    {
      "text": "Leah Wheeler: The “explainable” part is where I’m skeptical. Everyone says explainable. In practice, it becomes a black box. And then Product says Support is gaming severity tags, Support says Product is ignoring customers, and we’re back in spreadsheets.",
      "link": "https://www.onyx.app/9747792-4"
    },
    {
      "text": "Irene Shen: That’s exactly the failure mode we designed around. The score breaks down into components you can show in the UI—like 35% frequency, 25% ARR exposure, 20% severity, 20% segment importance—whatever you choose. And you can click into the cluster to see the underlying evidence: which tickets, which customers, which segments. The point is not “trust us,” it’s “here’s why this cluster is high priority.”",
      "link": "https://www.onyx.app/9747792-5"
    },
    {
      "text": "Leah Wheeler: But who sets those weights? Because if I set ARR exposure high, my team gets accused of only caring about big clients. If I set frequency high, we end up chasing noisy small accounts. There isn’t a “right” answer, and it becomes political.",
      "link": "https://www.onyx.app/9747792-6"
    },
    {
      "text": "Irene Shen: That’s real. What we usually do is start with a default model and then run a calibration period—two weeks of comparing the score to your current triage decisions. When there’s a dispute, you can see exactly what drove the ranking and adjust the weights with agreement from the stakeholders. It’s more explicit than the current situation where the weighting is happening informally in meetings.",
      "link": "https://www.onyx.app/9747792-7"
    },
    {
      "text": "Leah Wheeler: I get the theory. But the politics still exist. Explicit weights can actually make it worse—because now people can argue about the math instead of the outcome. Also, we don’t have clean severity tagging today. Our Zendesk tags are inconsistent.",
      "link": "https://www.onyx.app/9747792-8"
    },
    {
      "text": "Irene Shen: If severity is inconsistent, we can down-weight it initially and lean more on frequency and customer tier/ARR from your CRM. Over time, Issue_Tracker can nudge tagging hygiene because people see the downstream impact. But you don’t have to boil the ocean. For Yarrowgate, we could start with just: frequency/velocity + ARR tier + segment importance, and keep severity as informational.",
      "link": "https://www.onyx.app/9747792-9"
    },
    {
      "text": "Leah Wheeler: Okay, but “segment importance” is another loaded term. We don’t even agree internally on what the ICP is. Sales has one view, Product has another, and my CSM team sits in the middle trying to keep everyone calm.",
      "link": "https://www.onyx.app/9747792-10"
    },
    {
      "text": "Irene Shen: Understood. Segment importance can come from Customer_Analyzer if you’re using it, or from a simple mapping you define—like “wealth management firms over X AUM” or “enterprise procurement-led accounts.” If you don’t have that locked, we can treat segment as neutral and still get value from clustering and deduping, then revisit segment weighting later.",
      "link": "https://www.onyx.app/9747792-11"
    },
    {
      "text": "Leah Wheeler: Let’s talk about the use case we discussed last time—CSMs subscribing accounts to clusters and then doing consistent follow-up. That’s interesting to me. But again, it depends on trust in the cluster status. If Jira doesn’t match reality, my team will be the one sending awkward updates.",
      "link": "https://www.onyx.app/9747792-12"
    },
    {
      "text": "Irene Shen: That’s a great point. The way it works is: a cluster is linked to one or more Jira tickets. When a Jira ticket ships, Issue_Tracker records the release milestone and updates the cluster status. Then CSMs who have subscribed accounts to that cluster get a prompt to notify impacted customers, and the system keeps a history trail of who was notified and when. It reduces the manual “who do we owe an update to?” scramble.",
      "link": "https://www.onyx.app/9747792-13"
    },
    {
      "text": "Leah Wheeler: We already try to do that, but it’s messy. The issue is that engineering doesn’t always use Jira consistently either. Tickets get closed, reopened, or the fix is partial. If Issue_Tracker is pulling status from Jira, it’ll inherit that mess.",
      "link": "https://www.onyx.app/9747792-14"
    },
    {
      "text": "Irene Shen: It will reflect what Jira says, yes—but it also keeps the evidence chain so you can see what was promised and what shipped. Some teams set rules like “only mark cluster as ‘Resolved’ when the linked Jira is ‘Done’ and a Support verification checkbox is true,” or they add a lightweight verification step. The goal is to reduce false “fixed” messages.",
      "link": "https://www.onyx.app/9747792-15"
    },
    {
      "text": "Leah Wheeler: That’s adding process though. My org is already overwhelmed. If adopting this means we need new governance meetings, it’s not going to fly.",
      "link": "https://www.onyx.app/9747792-16"
    },
    {
      "text": "Irene Shen: We can keep it light. In most deployments, we recommend one owner for the prioritization model—often Support Ops or Product Ops—who meets with stakeholders monthly, not weekly. And for the notification workflow, it can be optional: CSMs can still manually choose when to notify, but Issue_Tracker gives them the list and the trail.",
      "link": "https://www.onyx.app/9747792-17"
    },
    {
      "text": "Leah Wheeler: Irene, candidly, it sounds like we’re buying a system that formalizes our disagreements. I’m not sure we’re mature enough operationally. And I don’t want to roll out something that becomes another “source of truth” argument.",
      "link": "https://www.onyx.app/9747792-18"
    },
    {
      "text": "Irene Shen: I appreciate the candor. Let me ask: what would you need to see to feel confident this wouldn’t become another argument generator? Is it a pilot with a single team, or a proof that the scoring isn’t a black box?",
      "link": "https://www.onyx.app/9747792-19"
    },
    {
      "text": "Leah Wheeler: Both. But we also have tool fatigue right now. We’re mid-migration on our CRM fields and Sales is changing stages. Integrations are fragile. If your prioritization depends on CRM hygiene, we’re not in a great place.",
      "link": "https://www.onyx.app/9747792-20"
    },
    {
      "text": "Irene Shen: That makes sense. Issue_Tracker can run with partial CRM data, but the “business impact” weighting is strongest when the CRM is clean. If the CRM is in flux, we could frame an initial pilot around support efficiency—dedupe, clustering, and a simple frequency-based ranking—without the heavy CRM weighting. Would that be more realistic?",
      "link": "https://www.onyx.app/9747792-21"
    },
    {
      "text": "Leah Wheeler: Maybe, but then we’re not really testing the thing you’re pitching. We already have a rough sense of frequency. Our bigger pain is cross-team decision making, and I’m not convinced a score solves that.",
      "link": "https://www.onyx.app/9747792-22"
    },
    {
      "text": "Irene Shen: The score doesn’t replace decision making—it makes the inputs explicit and ties them to evidence. But if the organization isn’t ready to agree on the inputs, it can feel like friction. We’ve seen success when there’s an executive sponsor who wants a consistent prioritization method. Do you have that kind of sponsorship right now?",
      "link": "https://www.onyx.app/9747792-23"
    },
    {
      "text": "Leah Wheeler: Not really. Leadership wants “better visibility,” but they don’t want to arbitrate weighting debates. And I can’t be the referee for Product versus Support versus Sales.",
      "link": "https://www.onyx.app/9747792-24"
    },
    {
      "text": "Irene Shen: Understood. Given that, it may be premature to push for a buying decision today. If it helps, I can send a lightweight pilot plan that doesn’t require executive sponsorship—something like: pick 20 high-volume issue themes, cluster from Zendesk, link to Jira, and run the CSM subscription + notification history for just your top 10 accounts. But I don’t want to force it if the org context isn’t right.",
      "link": "https://www.onyx.app/9747792-25"
    },
    {
      "text": "Leah Wheeler: I appreciate that. I think we’re going to pause for now. The prioritization disputes you described—that’s basically our daily reality, and I don’t see us agreeing on a model in the next quarter. If you can send the pilot plan, I’ll keep it on file, but I can’t commit to moving forward.",
      "link": "https://www.onyx.app/9747792-26"
    },
    {
      "text": "Irene Shen: That’s fair, Leah. I’ll send a concise pilot outline and a sample of what “explainable” scoring looks like, so you can evaluate it when timing is better. Before we wrap, is there any specific blocker—security, integration workload, pricing—that would change the equation, or is it mainly the internal readiness?",
      "link": "https://www.onyx.app/9747792-27"
    },
    {
      "text": "Leah Wheeler: Mainly readiness and bandwidth. Integration workload is a concern too, but even if it were turnkey, we’re still not aligned enough to benefit.",
      "link": "https://www.onyx.app/9747792-28"
    },
    {
      "text": "Irene Shen: Got it. I’ll follow up with the plan and we can revisit in a couple months if things stabilize. Thanks again for being direct—this was helpful.",
      "link": "https://www.onyx.app/9747792-29"
    },
    {
      "text": "Leah Wheeler: Thanks, Irene. Talk soon.",
      "link": "https://www.onyx.app/9747792-30"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "irene_shen@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "leah_wheeler@yarrowgate_investment.onyx.app"
    }
  ]
}