{
  "id": "FIREFLIES_7167049",
  "semantic_identifier": "7167049 - Highridge Data Services - sales_call - Discussion with Tatum Green",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2026-01-04 00:00:00",
  "metadata": {
    "meeting_date": "2026-01-04 00:00:00",
    "duration_min": "39"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2026-01"
      ],
      "year_month": "2026-01",
      "meeting_title": "7167049 - Highridge Data Services - sales_call - Discussion with Tatum Green",
      "organizer_email": "irene_shen@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Irene Shen: Hi Tatum—good to see you again. Last time you mentioned you were trying to get sharper on which customer segments are truly “best fit” for Highridge, especially for product planning. Does that still feel like the priority for today?",
      "link": "https://www.onyx.app/6468361-1"
    },
    {
      "text": "Tatum Green: Hi Irene, yes. We’ve got a roadmap planning cycle coming up, and we keep debating which segment’s needs to optimize for. We have opinions, but not a lot of evidence.",
      "link": "https://www.onyx.app/6468361-2"
    },
    {
      "text": "Irene Shen: Perfect. Then I’d focus us on Customer_Analyzer’s fit_estimation—because it directly answers “who’s most likely to succeed with us and why,” and it’s very actionable for roadmap bets. Before I walk through it, what data sources do you have that could signal success today—CRM fields, product usage, support tickets, surveys?",
      "link": "https://www.onyx.app/6468361-3"
    },
    {
      "text": "Tatum Green: CRM and product usage are solid. Support tickets are there but messy. We also have onboarding survey answers, but they’re inconsistent.",
      "link": "https://www.onyx.app/6468361-4"
    },
    {
      "text": "Irene Shen: That’s a common mix. The way fit_estimation works is: you define a small set of fit drivers—say industry, size, time-to-value, adoption patterns, support burden, and churn risk signals—and we compute a fit score from 0–100 at the account level, then roll it up to segment-level views. The key output for product planning is the driver breakdown. It shows why a segment scores high or low—so you can connect “this segment retains and expands” to “these needs are actually being met.”",
      "link": "https://www.onyx.app/6468361-5"
    },
    {
      "text": "Tatum Green: When you say “segment,” how flexible is that? Because one issue we run into is overlapping segment definitions. Like, industries overlap with personas, and then size buckets overlap with use cases.",
      "link": "https://www.onyx.app/6468361-6"
    },
    {
      "text": "Irene Shen: Great callout—and it’s one of the places teams can get tripped up if they don’t set guardrails. In Customer_Analyzer, segments can be built on multiple attributes, but we recommend starting with a simple segmentation model: one primary dimension at a time, like “industry + size,” then layer persona as a secondary cut only after you’ve validated the baseline. The product helps by showing segment comparisons side-by-side—SMB vs mid-market, or healthcare vs financial services—and it flags when segments are too small or too overlapping to draw strong conclusions.",
      "link": "https://www.onyx.app/6468361-7"
    },
    {
      "text": "Tatum Green: Okay. My worry is we’ll end up with confusing recommendations if the segments aren’t clean. We’ve had analytics tools do that—lots of charts, not a lot of clarity.",
      "link": "https://www.onyx.app/6468361-8"
    },
    {
      "text": "Irene Shen: Totally fair. The way we avoid “chart overload” is by forcing the output into two decisions: (1) what’s your recommended ICP profile based on observed outcomes, and (2) what are the top fit drivers that explain it. So instead of giving you 30 slices, it highlights “these 2–3 segments are outperforming, and here’s the evidence.” Then for product planning, you can ask: “What unmet needs exist in the high-fit segments?” and prioritize roadmap items that increase adoption or reduce support burden for those segments.",
      "link": "https://www.onyx.app/6468361-9"
    },
    {
      "text": "Tatum Green: That’s useful. How quickly can we get to a fit score that’s credible? Because we don’t want to wait months.",
      "link": "https://www.onyx.app/6468361-10"
    },
    {
      "text": "Irene Shen: Typical time-to-value is a couple weeks for a strong first pass. If you can connect CRM plus product usage, we can produce an initial fit model quickly—then refine it. We usually start with a workshop where you pick 5–7 fit drivers. For example: firmographics (industry, size), time-to-value (how quickly do they reach activation), adoption depth (feature usage frequency), support burden (ticket volume/severity), and churn risk indicators. Then you get a fit score with a driver breakdown per segment.",
      "link": "https://www.onyx.app/6468361-11"
    },
    {
      "text": "Tatum Green: What about the messy support tickets? If that’s inconsistent, doesn’t it distort the model?",
      "link": "https://www.onyx.app/6468361-12"
    },
    {
      "text": "Irene Shen: If support data is noisy, we can downweight it initially or use simpler proxies—like “tickets per active user” or tagged categories you trust. The fit model isn’t “all or nothing.” You can start with higher-confidence drivers—usage and retention signals—and then add support signals once you’ve cleaned up tags or standardized categories. The output will show you which drivers are contributing most, so you can sanity-check whether something weird is dominating the score.",
      "link": "https://www.onyx.app/6468361-13"
    },
    {
      "text": "Tatum Green: Got it. And how does this translate into product planning? I’m trying to picture using this in our roadmap meeting.",
      "link": "https://www.onyx.app/6468361-14"
    },
    {
      "text": "Irene Shen: Think of it as a structured argument. In your roadmap meeting, you’d pull up: “Segment A has a fit score of 82 with strong retention and expansion; Segment B has 61 with longer time-to-value and higher support burden.” Then you can dig into why—maybe Segment B struggles with onboarding steps or a specific workflow. That tells product: “If we want Segment B, we need these improvements,” or “If we want to win faster, double down on Segment A’s unmet needs.” It turns the roadmap debate from opinion into evidence tied to outcomes.",
      "link": "https://www.onyx.app/6468361-15"
    },
    {
      "text": "Tatum Green: That would help. We’re currently arguing based on who shouts the loudest—sales, product, or CS.",
      "link": "https://www.onyx.app/6468361-16"
    },
    {
      "text": "Irene Shen: Exactly. And because the fit score is tied to outcomes like retention or expansion, it gives you a common scoreboard. Quick question: for Highridge, is the planning goal more about improving retention in your current base, or expanding into a new segment?",
      "link": "https://www.onyx.app/6468361-17"
    },
    {
      "text": "Tatum Green: Mostly improving retention and expansion in the current base, but we’re also testing a mid-market push.",
      "link": "https://www.onyx.app/6468361-18"
    },
    {
      "text": "Irene Shen: Perfect. Then we can set up two segment comparisons: current base vs the mid-market cohort, and within the current base, identify the highest-fit sub-segments. You’d see whether mid-market is actually higher fit—or whether it just “feels” bigger. If mid-market’s time-to-value is worse and support burden is higher, you’ll see that early, before you over-invest.",
      "link": "https://www.onyx.app/6468361-19"
    },
    {
      "text": "Tatum Green: That’s actually a big question for us. Some of the team thinks mid-market is the answer, but onboarding has been rough there.",
      "link": "https://www.onyx.app/6468361-20"
    },
    {
      "text": "Irene Shen: Then fit_estimation will surface that as driver-level evidence. And we can convert it into a straightforward recommendation: either “mid-market is promising but needs onboarding investment,” or “mid-market is a distraction right now—focus on X.” It’s not just a score; it’s the “why.”",
      "link": "https://www.onyx.app/6468361-21"
    },
    {
      "text": "Tatum Green: Okay. What do you need from us to get a first model? And what does the process look like?",
      "link": "https://www.onyx.app/6468361-22"
    },
    {
      "text": "Irene Shen: For a first model: a CRM export or connection (accounts, industry, size, stage, win/loss if you have it), your product usage events (activation and key feature usage), and whatever retention/churn markers you track. Then we do a 60–90 minute fit driver workshop with you and one stakeholder from product or CS—though if you prefer, we can start with just you and keep it simple. After that, you’ll get an initial dashboard: fit scores by segment, driver breakdown, and an initial recommended ICP profile based on your historical outcomes.",
      "link": "https://www.onyx.app/6468361-23"
    },
    {
      "text": "Tatum Green: I can do CRM and product usage. Win/loss is decent. Churn markers are okay. I’d like to keep the workshop small at first.",
      "link": "https://www.onyx.app/6468361-24"
    },
    {
      "text": "Irene Shen: That’s fine. We can keep it to you and maybe one product lead later. One more thing on the segmentation ambiguity: we’ll propose a “segment dictionary” upfront—basically, clear definitions for each segment so the results don’t get debated endlessly. If you already have segment definitions, we’ll align to them and make sure they don’t overlap in a way that breaks comparisons.",
      "link": "https://www.onyx.app/6468361-25"
    },
    {
      "text": "Tatum Green: I like that. If we do this, I want the output to be something we can actually take into planning, not just “data science says so.”",
      "link": "https://www.onyx.app/6468361-26"
    },
    {
      "text": "Irene Shen: Absolutely. Our goal is to produce a one-page ICP recommendation and a short list of “roadmap implications”—for example, “Invest in onboarding automation for mid-market because time-to-value is the biggest negative driver,” or “Build feature X because it correlates with expansion in the highest-fit segment.” It stays grounded in drivers and outcomes.",
      "link": "https://www.onyx.app/6468361-27"
    },
    {
      "text": "Tatum Green: This sounds like what we need. What are the next steps to get moving?",
      "link": "https://www.onyx.app/6468361-28"
    },
    {
      "text": "Irene Shen: Two options. Option A: we start with a lightweight pilot—two segments, five fit drivers, CRM + usage—and deliver an initial fit readout in two weeks. Option B: we go straight to a full rollout with more drivers and additional sources like support tickets once you’re comfortable. Given where you are, I’d recommend Option A.",
      "link": "https://www.onyx.app/6468361-29"
    },
    {
      "text": "Tatum Green: Let’s do Option A. Two weeks works. If the initial readout is solid, we can expand.",
      "link": "https://www.onyx.app/6468361-30"
    },
    {
      "text": "Irene Shen: Great. I’ll send a short checklist for the data connections and propose times for the fit driver workshop early next week. Also, if you can share your current segment definitions—even if they’re messy—I’ll come back with a cleaner, non-overlapping draft for us to confirm.",
      "link": "https://www.onyx.app/6468361-31"
    },
    {
      "text": "Tatum Green: Sounds good. I can send our current definitions today. And I’ll loop in our analytics person to help with the usage events connection.",
      "link": "https://www.onyx.app/6468361-32"
    },
    {
      "text": "Irene Shen: Perfect. Once we have that, we’ll build the initial fit model and bring you a readout focused on product planning: which segment is highest fit, what unmet needs show up, and what that implies for the next roadmap cycle.",
      "link": "https://www.onyx.app/6468361-33"
    },
    {
      "text": "Tatum Green: Great. I’m in—send the checklist and the proposed times, and we’ll get it scheduled.",
      "link": "https://www.onyx.app/6468361-34"
    },
    {
      "text": "Irene Shen: Will do. Thanks, Tatum—excited to get you something concrete before the roadmap meeting.",
      "link": "https://www.onyx.app/6468361-35"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "irene_shen@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "tatum_green@highridge_data_services.onyx.app"
    }
  ]
}