{
  "id": "FIREFLIES_2113305",
  "semantic_identifier": "2113305 - Horizoncrest Systems - sales_pitch - Discussion with Julian Morgan",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-05-12 00:00:00",
  "metadata": {
    "meeting_date": "2025-05-12 00:00:00",
    "duration_min": "37"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-05"
      ],
      "year_month": "2025-05",
      "meeting_title": "2113305 - Horizoncrest Systems - sales_pitch - Discussion with Julian Morgan",
      "organizer_email": "camila_vega@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Camila Vega: Hi Julian—Camila Vega here. Thanks for taking a few minutes. I work with teams that are getting buried in customer issues across Zendesk, Intercom, call notes, and then trying to translate that into Jira without losing context. I wanted to quickly share what Issue_Tracker does and see if it’s worth a longer working session.",
      "link": "https://www.onyx.app/8135367-1"
    },
    {
      "text": "Julian Morgan: Hey Camila, sure. We definitely feel that pain—things get scattered fast. What are you seeing with companies like us?",
      "link": "https://www.onyx.app/8135367-2"
    },
    {
      "text": "Camila Vega: Most teams have two problems at once: first, the same issue shows up in dozens of slightly different tickets and chats, so triage is repetitive and the true volume is hidden. Second, Sales and Support don’t have a reliable “source of truth” for what’s actually happening with an issue—status, who it impacts, what we can safely tell customers—so deals and renewals get risky at the worst time.",
      "link": "https://www.onyx.app/8135367-3"
    },
    {
      "text": "Julian Morgan: That sounds familiar. We’re on Zendesk and Jira, and it’s a lot of manual tagging and Slack threads. How would Issue_Tracker fit in without replacing those?",
      "link": "https://www.onyx.app/8135367-4"
    },
    {
      "text": "Camila Vega: Great question. Issue_Tracker sits between your support channels and Jira. It doesn’t replace Zendesk or Jira—it standardizes an “issue object” that links back to the original conversations and forward to the engineering work. The core capability is issue clustering: it ingests raw customer inputs—tickets, chats, emails, even call-note summaries—then automatically deduplicates and clusters them into themes using semantic similarity plus configurable rules like product area, platform, severity, or keywords.",
      "link": "https://www.onyx.app/8135367-5"
    },
    {
      "text": "Julian Morgan: Clustering sounds nice in theory, but we’ve tried auto-tagging before and it got noisy. How do you keep it from being a mess?",
      "link": "https://www.onyx.app/8135367-6"
    },
    {
      "text": "Camila Vega: Totally—if it’s a black box, it fails. Two things make it workable. First, the clusters come with transparent evidence: representative examples, top phrases, and links back to the source Zendesk tickets or Intercom threads, so your team can validate quickly. Second, there’s a merge/split workflow with guardrails—so you can correct clusters without starting from scratch, and the system learns the boundaries you care about, like separating “mobile login” from “SSO login” even if users describe them similarly.",
      "link": "https://www.onyx.app/8135367-7"
    },
    {
      "text": "Julian Morgan: Okay, that would help. But our bigger issue lately is prioritization—everything feels urgent, and we’re not always sure what’s actually impacting revenue.",
      "link": "https://www.onyx.app/8135367-8"
    },
    {
      "text": "Camila Vega: That’s exactly where Issue_Tracker becomes a revenue-protection layer, not just a support analytics tool. Each cluster maintains impacted customers and context—suspected root cause category like bug vs UX vs missing feature—and then you can prioritize based on business impact: revenue exposure, segment or ICP importance, and deal risk. The use case we see a lot is Sales preventing deal slippage: a late-stage opportunity gets tied to a known issue cluster, and you have current status, ETA notes, and approved language on what’s safe to communicate.",
      "link": "https://www.onyx.app/8135367-9"
    },
    {
      "text": "Julian Morgan: That would be useful. Right now Sales pings Support, Support pings Product, Product pings Engineering, and nobody wants to put anything in writing.",
      "link": "https://www.onyx.app/8135367-10"
    },
    {
      "text": "Camila Vega: Exactly. Instead of a dozen one-off escalations, you have one defensible record: the cluster has the history of decisions and status across teams—plus the evidence trail back to customer conversations. So when a rep asks, “Is this the same issue that’s blocking Horizoncrest Systems’ prospect in healthcare?” you can answer with the cluster status, what teams have committed to, and consistent messaging.",
      "link": "https://www.onyx.app/8135367-11"
    },
    {
      "text": "Julian Morgan: How would Sales actually see this? They don’t live in Zendesk or Jira.",
      "link": "https://www.onyx.app/8135367-12"
    },
    {
      "text": "Camila Vega: They shouldn’t have to. Issue_Tracker can integrate with your CRM context and surface the relevant issue clusters back to revenue teams—especially for active pipeline. Practically, that means Sales can search an account or opportunity and see: known issue clusters affecting similar customers, current engineering status, and a short “safe to say” blurb your team approves. The goal is fewer surprise escalations and fewer deals slipping because someone discovered an issue too late.",
      "link": "https://www.onyx.app/8135367-13"
    },
    {
      "text": "Julian Morgan: We’ve had that happen—an enterprise deal got stuck because we didn’t realize the “export timeout” problem was widespread until the prospect hit it. If we’d known earlier, we could’ve managed expectations.",
      "link": "https://www.onyx.app/8135367-14"
    },
    {
      "text": "Camila Vega: That’s a perfect example. With clustering, “export timeout” tickets across different wording—“download hangs,” “CSV export stalls,” “report export spinning”—get grouped into one theme. Then you can see trend volume rising, which segments are affected, and whether it’s touching strategic accounts or late-stage deals. Even if Engineering is still investigating, Sales has a consistent status and can avoid overpromising.",
      "link": "https://www.onyx.app/8135367-15"
    },
    {
      "text": "Julian Morgan: What does implementation look like? We don’t have appetite for a huge integration project right now.",
      "link": "https://www.onyx.app/8135367-16"
    },
    {
      "text": "Camila Vega: Understood. Typically the first step is lightweight: connect Zendesk and Jira, pull in recent history, and let Issue_Tracker generate initial clusters. Then you do a quick calibration session—usually 60–90 minutes—where you review top clusters, merge/split a few, and define a couple rules like “treat iOS and Android separately” or “keep SSO issues distinct.” After that, it runs continuously and your team just maintains the clusters that matter.",
      "link": "https://www.onyx.app/8135367-17"
    },
    {
      "text": "Julian Morgan: And who owns it? Support? Product Ops?",
      "link": "https://www.onyx.app/8135367-18"
    },
    {
      "text": "Camila Vega: It can vary, but the most successful setup is a shared workflow: Support Ops or Product Ops typically owns the system, but Sales benefits directly. The key is that everyone is looking at the same “issue objects” rather than each team maintaining separate tags and spreadsheets. If you have someone doing weekly triage or customer issue reviews, Issue_Tracker becomes the backbone for that.",
      "link": "https://www.onyx.app/8135367-19"
    },
    {
      "text": "Julian Morgan: This is resonating. I’m curious how it would handle our product areas—we have a platform layer plus a few modules, and tickets get misrouted a lot.",
      "link": "https://www.onyx.app/8135367-20"
    },
    {
      "text": "Camila Vega: That’s a great fit for the configurable rules piece. You can cluster by product area and platform, and the system will still use semantic similarity within those boundaries. So you don’t end up with a mega-cluster that mixes “platform auth” with “module reporting,” even if customers describe them similarly. It reduces misrouting and makes the trends clearer for each owning team.",
      "link": "https://www.onyx.app/8135367-21"
    },
    {
      "text": "Julian Morgan: Makes sense. What would you need from us to see if this works with our data?",
      "link": "https://www.onyx.app/8135367-22"
    },
    {
      "text": "Camila Vega: For the next step, I’d propose a full call where we do two things: (1) map your current flow—Zendesk to Jira to internal comms—and (2) look at a sample of your last 60–90 days of issues to see what clustering would produce. If you can bring someone from Support Ops and maybe a Product Ops counterpart, we can validate whether the top clusters match reality and identify quick wins—like the top 10 themes impacting strategic accounts.",
      "link": "https://www.onyx.app/8135367-23"
    },
    {
      "text": "Julian Morgan: I can loop in our Support Ops lead. I’d also like someone from RevOps, because deal risk is a big theme for us this quarter.",
      "link": "https://www.onyx.app/8135367-24"
    },
    {
      "text": "Camila Vega: Perfect—RevOps is ideal, especially for tying issue clusters to pipeline risk and standardizing the messaging Sales uses. How’s your schedule early next week? I have Tuesday at 11am or Wednesday at 2pm open for a 45-minute deeper dive.",
      "link": "https://www.onyx.app/8135367-25"
    },
    {
      "text": "Julian Morgan: Wednesday at 2pm works. Send an invite and I’ll add Support Ops and RevOps.",
      "link": "https://www.onyx.app/8135367-26"
    },
    {
      "text": "Camila Vega: Great—I’ll send the calendar hold for Wednesday at 2pm with a short agenda and a couple prep questions—mainly which support channel is primary and which Jira projects handle customer-facing work. Appreciate the time today, Julian.",
      "link": "https://www.onyx.app/8135367-27"
    },
    {
      "text": "Julian Morgan: Sounds good. Thanks, Camila—looking forward to seeing it in action.",
      "link": "https://www.onyx.app/8135367-28"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "camila_vega@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "julian_morgan@horizoncrest_systems.onyx.app"
    }
  ]
}