{
  "id": "FIREFLIES_2683323",
  "semantic_identifier": "2683323 - Blueharbor Dynamics - sales_call - Discussion with Nikhil Verma",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-05-01 00:00:00",
  "metadata": {
    "meeting_date": "2025-05-01 00:00:00",
    "duration_min": "27"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-05"
      ],
      "year_month": "2025-05",
      "meeting_title": "2683323 - Blueharbor Dynamics - sales_call - Discussion with Nikhil Verma",
      "organizer_email": "camila_vega@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Camila Vega: Hi Nikhil—good to see you again. Last time you mentioned Blueharbor Dynamics is trying to get sharper on which customer segments are actually worth building for, not just selling to. Does that still capture the priority for product planning?",
      "link": "https://www.onyx.app/1712394-1"
    },
    {
      "text": "Nikhil Verma: Yeah, that’s right. We’re getting pulled in a lot of directions. Sales has opinions, Product has opinions, and we don’t have a clean way to decide which segment is truly high-fit versus just loud.",
      "link": "https://www.onyx.app/1712394-2"
    },
    {
      "text": "Camila Vega: Perfect. Today I want to keep this tight and focus on one piece of Customer_Analyzer that maps directly to that: the fit estimation. The idea is we ingest the signals you already have—CRM fields, onboarding surveys, product usage events, support tickets, even interview notes—and we turn that into a fit score from 0 to 100 at both the account and segment level. Then we show the driver breakdown so it’s not a mystery.",
      "link": "https://www.onyx.app/1712394-3"
    },
    {
      "text": "Nikhil Verma: The “not a mystery” part matters. My biggest concern is anything that feels like a black box. If it spits out a score but my team can’t understand it, they won’t use it.",
      "link": "https://www.onyx.app/1712394-4"
    },
    {
      "text": "Camila Vega: Totally fair, and honestly it’s the most common concern on call two. What we do to avoid the black box perception is two things. First, you choose—or we start from templates for—your fit drivers. For example: industry and size, problem severity, time-to-value, adoption patterns, support burden, churn risk signals, willingness to pay. Second, every score comes with a driver breakdown: “Here’s why this account is an 82, and here’s why this segment is a 61.” It’s basically a transparent model card for each output.",
      "link": "https://www.onyx.app/1712394-5"
    },
    {
      "text": "Nikhil Verma: Okay. But how do you connect it to outcomes? Like, I don’t want a score that’s just “seems good.” I want to see it tied to retention or expansion, otherwise it’s just another dashboard.",
      "link": "https://www.onyx.app/1712394-6"
    },
    {
      "text": "Camila Vega: Exactly. The recommended ICP profile is based on observed outcomes you care about—retention, conversion, expansion, support load. So if we find, for instance, that mid-market customers in a certain industry hit value in two weeks, adopt three key features, submit fewer tickets, and expand within 90 days, those drivers get weighted as “what good looks like” for your product today. And you can sanity-check it because you can click into the cohort and see examples of the accounts that make up that pattern.",
      "link": "https://www.onyx.app/1712394-7"
    },
    {
      "text": "Nikhil Verma: That would help. For product planning, we’re trying to decide between building deeper workflow for Segment A versus adding integrations that would appeal to Segment B. We’ve got anecdotes, but not proof.",
      "link": "https://www.onyx.app/1712394-8"
    },
    {
      "text": "Camila Vega: Great use case. Here’s how teams typically use fit estimation for that exact decision: we compare segments side-by-side—Segment A vs Segment B—and Customer_Analyzer shows (1) the average fit score by segment, (2) the driver deltas, and (3) which unmet needs show up in your qualitative signals like interview notes or support themes. So you can say, “Segment A is higher fit, but Segment B has an unmet need that—if we solve it—could raise fit and expansion.” That’s a roadmap bet grounded in data instead of opinions.",
      "link": "https://www.onyx.app/1712394-9"
    },
    {
      "text": "Nikhil Verma: Makes sense. Another concern: our data is messy. CRM fields aren’t consistently filled out, and usage events are good but not perfect. How sensitive is the model to gaps?",
      "link": "https://www.onyx.app/1712394-10"
    },
    {
      "text": "Camila Vega: Also a fair callout. We handle it in a few ways: we can start with the signals that are strongest for you—usually usage events and a few high-quality CRM fields—and then layer in other sources as they’re cleaned up. The fit score includes confidence indicators, so if an account has thin data, you’ll see that. And the driver breakdown will show what it relied on. Practically, most customers start with “good enough” data for an initial ICP direction, then refine.",
      "link": "https://www.onyx.app/1712394-11"
    },
    {
      "text": "Nikhil Verma: If it shows confidence, that helps. I just don’t want Product making roadmap choices off shaky inputs without knowing it.",
      "link": "https://www.onyx.app/1712394-12"
    },
    {
      "text": "Camila Vega: Completely agree. Let me anchor this back to Blueharbor: based on what you shared last time, you have solid product usage telemetry and a decent ticketing system history. If we start with adoption patterns, time-to-value signals, and support burden as drivers, you’ll quickly get a view of which segments succeed without needing perfect CRM hygiene on day one.",
      "link": "https://www.onyx.app/1712394-13"
    },
    {
      "text": "Nikhil Verma: Okay, that feels realistic. What would the first 30 days look like if we said yes?",
      "link": "https://www.onyx.app/1712394-14"
    },
    {
      "text": "Camila Vega: In the first week, we’d connect your core sources—typically CRM plus product events and support tickets. In week two, we’d workshop fit drivers with you and one stakeholder—still just a short session—to define “good outcomes” for the model to optimize against. Weeks three and four, you’d get your initial segment comparison and recommended ICP profile, and we’d validate it with a handful of known accounts: “Do these high-fit accounts look like your best customers?” Then you’d use that output to guide the roadmap discussion you mentioned.",
      "link": "https://www.onyx.app/1712394-15"
    },
    {
      "text": "Nikhil Verma: I like the validation step. If we can pull up a few accounts and it matches what we know, I can get my team on board.",
      "link": "https://www.onyx.app/1712394-16"
    },
    {
      "text": "Camila Vega: Exactly. And if it doesn’t match, we don’t hand-wave it—we adjust the drivers or the outcome target. That’s how we keep trust high. Quick question: for product planning, which outcome matters more for you right now—retention, expansion, or reducing support burden?",
      "link": "https://www.onyx.app/1712394-17"
    },
    {
      "text": "Nikhil Verma: Expansion and retention. Support burden matters, but we’d rather grow with the right customers than optimize for fewer tickets.",
      "link": "https://www.onyx.app/1712394-18"
    },
    {
      "text": "Camila Vega: Great. Then we’ll weight expansion and retention outcomes more heavily in the first model. That means the fit score will reflect “customers like this convert, renew, and expand,” not just “customers like this are easy.”",
      "link": "https://www.onyx.app/1712394-19"
    },
    {
      "text": "Nikhil Verma: Good. Pricing-wise—are we talking something that’s going to require a big procurement cycle, or can we start smaller?",
      "link": "https://www.onyx.app/1712394-20"
    },
    {
      "text": "Camila Vega: We can start smaller. Most teams begin with a single workspace focused on fit estimation for product planning—segment scoring, driver breakdown, and ICP recommendation—then expand to additional teams once it’s proving value. For Blueharbor, I’d propose a pilot sized to your top two segments plus your active customer base, so we can get statistically meaningful comparisons without boiling the ocean.",
      "link": "https://www.onyx.app/1712394-21"
    },
    {
      "text": "Nikhil Verma: And what do you need from me to make that pilot successful?",
      "link": "https://www.onyx.app/1712394-22"
    },
    {
      "text": "Camila Vega: Two things: (1) access to the core data sources—read-only is fine—and (2) agreement on the initial drivers and outcomes. Also, I’d ask you to nominate 10 accounts you consider “best fit” and 10 that churned or stalled. That gives us a fast reality check when we review results.",
      "link": "https://www.onyx.app/1712394-23"
    },
    {
      "text": "Nikhil Verma: That’s doable. I can get you that list. I want to be sure the output is something we can actually take into a roadmap meeting. Is it like slides, or a dashboard, or…?",
      "link": "https://www.onyx.app/1712394-24"
    },
    {
      "text": "Camila Vega: It’s a dashboard you can export from. But more importantly, it translates into a decision artifact: “Here are our top segments by fit. Here’s why. Here’s what high-fit customers do differently. Here are the drivers holding a segment back.” Product teams typically paste the segment comparison and driver breakdown into their planning doc. If you want, we can also generate a one-page ICP summary.",
      "link": "https://www.onyx.app/1712394-25"
    },
    {
      "text": "Nikhil Verma: That’s helpful. If we do this and it tells us Segment A is highest-fit, it also helps me push back on internal pressure to chase shiny segments.",
      "link": "https://www.onyx.app/1712394-26"
    },
    {
      "text": "Camila Vega: Exactly—that alignment is one of the main outcomes. Let’s get practical: would you be open to moving forward with a pilot that ends with a readout in four weeks, where success is “we can confidently pick a primary segment for the next roadmap cycle and explain why”?",
      "link": "https://www.onyx.app/1712394-27"
    },
    {
      "text": "Nikhil Verma: Yes, that’s the right bar. I’d want a clear deliverable and not just “here’s a tool, good luck.”",
      "link": "https://www.onyx.app/1712394-28"
    },
    {
      "text": "Camila Vega: Great. Next step: I’ll send over a short pilot plan and a data connection checklist today. Can we pencil in a 45-minute kickoff early next week to define drivers and outcomes, and then a readout meeting four weeks after?",
      "link": "https://www.onyx.app/1712394-29"
    },
    {
      "text": "Nikhil Verma: Yes. Tuesday morning works for kickoff. Send the plan and I’ll loop in our data lead for the access piece, but I’ll stay the main owner.",
      "link": "https://www.onyx.app/1712394-30"
    },
    {
      "text": "Camila Vega: Perfect—Tuesday morning it is. I’ll send a calendar invite and the pilot outline within the hour. Anything else you want me to address before we lock it in?",
      "link": "https://www.onyx.app/1712394-31"
    },
    {
      "text": "Nikhil Verma: Just include something in the plan about transparency—like how we’ll review the driver breakdown and confidence so it doesn’t feel like a black box.",
      "link": "https://www.onyx.app/1712394-32"
    },
    {
      "text": "Camila Vega: Absolutely. I’ll make that a specific agenda item for the week-three check-in: “score rationale review + cohort spot-checking.” Thanks, Nikhil—excited to get Blueharbor to a clear ICP and a roadmap decision you can defend.",
      "link": "https://www.onyx.app/1712394-33"
    },
    {
      "text": "Nikhil Verma: Sounds good. Looking forward to it.",
      "link": "https://www.onyx.app/1712394-34"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "camila_vega@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "nikhil_verma@blueharbor_dynamics.onyx.app"
    }
  ]
}