{
  "id": "FIREFLIES_2921144",
  "semantic_identifier": "2921144 - Ridgeway Lumen Telecom - sales_pitch - Discussion with Carl Burke",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-05-05 00:00:00",
  "metadata": {
    "meeting_date": "2025-05-05 00:00:00",
    "duration_min": "32"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-05"
      ],
      "year_month": "2025-05",
      "meeting_title": "2921144 - Ridgeway Lumen Telecom - sales_pitch - Discussion with Carl Burke",
      "organizer_email": "irene_shen@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Irene Shen: Hi Carl—this is Irene Shen. Thanks for taking a few minutes. I’ll keep it tight. I’m calling because we work with product and revenue teams to get crystal-clear on which customer segments are actually your best fit, and then turn that into messaging your team can use immediately in outbound and on landing pages.",
      "link": "https://www.onyx.app/3097890-1"
    },
    {
      "text": "Carl Burke: Hi Irene. Okay—what are you seeing as the main gap you help with?",
      "link": "https://www.onyx.app/3097890-2"
    },
    {
      "text": "Irene Shen: Most teams have the data—CRM fields, onboarding notes, support tickets, even sales call notes—but it’s scattered. Customer_Analyzer pulls those signals together and outputs two things: a fit score by segment so you can prioritize, and then positioning recommendations—editable messaging blocks—so marketing and sales aren’t reinventing copy every week.",
      "link": "https://www.onyx.app/3097890-3"
    },
    {
      "text": "Carl Burke: “Positioning recommendations” can mean a lot. What does that actually look like?",
      "link": "https://www.onyx.app/3097890-4"
    },
    {
      "text": "Irene Shen: Totally fair. For a prioritized segment—say SMB IT admins versus mid-market network ops—Customer_Analyzer generates a segment-specific value proposition, top use cases, differentiators, proof points to collect, pricing/value framing notes, and an objection-handling playbook. Then it formats that into practical blocks: website hero copy, sales deck bullets, and email openers. And it links each line back to the drivers and evidence it used—so it’s not random AI copy.",
      "link": "https://www.onyx.app/3097890-5"
    },
    {
      "text": "Carl Burke: Interesting. We’ve been trying to split messaging between SMB and mid-market, but it’s messy. We keep arguing about what matters to each.",
      "link": "https://www.onyx.app/3097890-6"
    },
    {
      "text": "Irene Shen: That’s exactly the use case I was going to ask about. For Ridgeway Lumen Telecom, do you already have two ICP tiers defined—SMB vs mid-market—or is that still in progress?",
      "link": "https://www.onyx.app/3097890-7"
    },
    {
      "text": "Carl Burke: We have a rough split, but it’s not consistent. Sales calls anything “mid-market” if the deal is bigger, and marketing has one set of pages that tries to cover everyone.",
      "link": "https://www.onyx.app/3097890-8"
    },
    {
      "text": "Irene Shen: Makes sense. What Customer_Analyzer typically does is: first, we ingest the signals you already have—your CRM fields, a few months of product usage events if you have them, support ticket tags, onboarding surveys, and any interview notes or call snippets you’re willing to share. Then we score which segments are most likely to succeed with your product as it exists today—so you’re not targeting “ideal in theory.”",
      "link": "https://www.onyx.app/3097890-9"
    },
    {
      "text": "Carl Burke: We do have CRM and support data. Product usage is in our analytics, but it’s not well-labeled. How heavy is the setup?",
      "link": "https://www.onyx.app/3097890-10"
    },
    {
      "text": "Irene Shen: For a first pass, it’s light. Most teams start with CRM + support + a handful of onboarding questions or notes. The goal in week one isn’t perfect instrumentation—it’s getting directional clarity: “Which segments should we lean into, and what do they actually care about?” Then you can refine with richer usage events later.",
      "link": "https://www.onyx.app/3097890-11"
    },
    {
      "text": "Carl Burke: Okay. But we’ve had consultants do messaging workshops before. What’s different besides it being software?",
      "link": "https://www.onyx.app/3097890-12"
    },
    {
      "text": "Irene Shen: Two big differences. One, it’s continuous—positioning stays tied to what customers are doing and saying, not just a one-time workshop. Two, it’s operational. Instead of a slide deck that sits in a folder, you get editable messaging blocks your team can drop into a landing page, an SDR sequence, or a pitch deck—plus the objection handling that sales actually needs. And because it’s linked to evidence, it’s easier to get internal alignment.",
      "link": "https://www.onyx.app/3097890-13"
    },
    {
      "text": "Carl Burke: The alignment part is real. Sales pushes for “faster install,” product pushes “reliability,” and marketing is stuck in the middle.",
      "link": "https://www.onyx.app/3097890-14"
    },
    {
      "text": "Irene Shen: Exactly. We’ll surface what’s truly winning—by segment. For example, SMB might respond to “fast setup and fewer tickets,” while mid-market might care more about “uptime, integrations, compliance,” whatever the data shows for you. Then the system recommends how to frame value, what differentiators to lead with, what proof points to collect, and the most common objections—like “we can build this ourselves” or “your competitor is cheaper”—and how to answer them credibly.",
      "link": "https://www.onyx.app/3097890-15"
    },
    {
      "text": "Carl Burke: If it’s generating website copy, how do we make sure it matches our voice and isn’t generic?",
      "link": "https://www.onyx.app/3097890-16"
    },
    {
      "text": "Irene Shen: Good question. It learns from your own customer language—support tickets, surveys, interview notes—so it mirrors the phrases your customers already use. And everything is editable, so your team can tweak tone. The key is the structure and the segmentation: you’re not starting from a blank page, and you’re not writing one message for everyone.",
      "link": "https://www.onyx.app/3097890-17"
    },
    {
      "text": "Carl Burke: We’re also running outbound. Could this help SDRs not spray the same email to every account?",
      "link": "https://www.onyx.app/3097890-18"
    },
    {
      "text": "Irene Shen: Yes. One of the fastest wins is segment-specific email openers and talk tracks. If you define two ICP tiers—SMB vs mid-market—you can generate two outbound angles with different proof points and objection handling. That typically improves reply rates and shortens discovery because you’re leading with what matters to that segment.",
      "link": "https://www.onyx.app/3097890-19"
    },
    {
      "text": "Carl Burke: What do you need from us to show value quickly?",
      "link": "https://www.onyx.app/3097890-20"
    },
    {
      "text": "Irene Shen: For a focused pilot, I’d ask for: a CRM export with a few key fields, a sample of recent closed-won and closed-lost notes if you have them, and a few months of support ticket categories. If you can add even a small set of onboarding survey answers or a couple of customer interview transcripts, that’s a bonus. Then we’d produce: (1) a fit score view for SMB vs mid-market, and (2) positioning recommendations for each—landing page hero + bullets, plus outbound email openers and a basic objection playbook.",
      "link": "https://www.onyx.app/3097890-21"
    },
    {
      "text": "Carl Burke: That sounds doable. How long until we see those outputs?",
      "link": "https://www.onyx.app/3097890-22"
    },
    {
      "text": "Irene Shen: Typically within two weeks for the initial recommendations, depending on data access. And we can start with just the SMB vs mid-market split so it’s not a huge taxonomy exercise.",
      "link": "https://www.onyx.app/3097890-23"
    },
    {
      "text": "Carl Burke: Who usually owns this internally—marketing or product?",
      "link": "https://www.onyx.app/3097890-24"
    },
    {
      "text": "Irene Shen: Usually marketing or product marketing partners with sales leadership. But the benefit lands across teams: marketing gets segment landing page messaging, sales gets objection handling and talk tracks, and product gets clarity on what’s driving retention and expansion in your best-fit segments.",
      "link": "https://www.onyx.app/3097890-25"
    },
    {
      "text": "Carl Burke: If we did this, I’d want our head of demand gen and a sales manager in the room.",
      "link": "https://www.onyx.app/3097890-26"
    },
    {
      "text": "Irene Shen: Perfect. Here’s what I propose: let’s schedule a 30-minute deeper call this week. I’ll walk through what the positioning recommendation output looks like—value prop, differentiators, proof points, objection handling—and we’ll map it directly to your SMB vs mid-market landing page and outbound needs. If it looks relevant, we can outline a small pilot and the exact data we’d pull.",
      "link": "https://www.onyx.app/3097890-27"
    },
    {
      "text": "Carl Burke: Yeah, I’m interested. Thursday afternoon could work. Can you send an agenda so they know what they’re joining?",
      "link": "https://www.onyx.app/3097890-28"
    },
    {
      "text": "Irene Shen: Absolutely. I’ll send a calendar invite for Thursday afternoon with a tight agenda: your current SMB vs mid-market messaging challenge, the data sources we’d use, and a live walkthrough of the messaging blocks—landing page and outbound variants plus the objection playbook. Does 2:00 pm work?",
      "link": "https://www.onyx.app/3097890-29"
    },
    {
      "text": "Carl Burke: 2:00 pm works. Send it over and I’ll pull in the right folks.",
      "link": "https://www.onyx.app/3097890-30"
    },
    {
      "text": "Irene Shen: Great—I'll send that now. Thanks, Carl. Looking forward to it.",
      "link": "https://www.onyx.app/3097890-31"
    },
    {
      "text": "Carl Burke: Thanks, Irene. Talk Thursday.",
      "link": "https://www.onyx.app/3097890-32"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "irene_shen@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "carl_burke@ridgeway_lumen_telecom.onyx.app"
    }
  ]
}