{
  "id": "FIREFLIES_5969428",
  "semantic_identifier": "5969428 - Prairielark Education - sales_call - Discussion with David Green",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-05-16 00:00:00",
  "metadata": {
    "meeting_date": "2025-05-16 00:00:00",
    "duration_min": "34"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-05"
      ],
      "year_month": "2025-05",
      "meeting_title": "5969428 - Prairielark Education - sales_call - Discussion with David Green",
      "organizer_email": "megan_foster@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Megan Foster: Hi David, good to see you again. Last time you mentioned you’re getting hit with repeat “same problem” tickets from different districts and it’s hard to tell what’s actually widespread versus just noisy. I wanted to focus today on Issue_Tracker—specifically the issue clustering piece—and how it ties back to protecting late-stage deals.",
      "link": "https://www.onyx.app/3310916-1"
    },
    {
      "text": "David Green: Hey Megan. Yeah, that’s still the pain. Support says it’s everywhere, product says it’s isolated, and sales is stuck in the middle trying to explain what’s going on to prospects.",
      "link": "https://www.onyx.app/3310916-2"
    },
    {
      "text": "Megan Foster: Exactly. So Issue_Tracker sits between Zendesk or Intercom and your internal tools like Jira, and it standardizes an “issue object”—a theme with evidence, impacted customers, and linked source conversations. The most immediate win is issue_clustering: it automatically groups related tickets, chats, and call-note summaries into deduped clusters, so you stop triaging the same thing ten times under ten different labels.",
      "link": "https://www.onyx.app/3310916-3"
    },
    {
      "text": "David Green: Okay. We already tag tickets and we have macros. The problem is we don’t trust the tags, and we still end up with spreadsheets when leadership asks “how big is this?”",
      "link": "https://www.onyx.app/3310916-4"
    },
    {
      "text": "Megan Foster: That’s a common pattern. Clustering gives you a defensible view: the cluster shows top phrases, representative examples, suggested naming, and it keeps the links back to each Zendesk ticket or Intercom thread. If someone questions “is this real,” you can open the cluster and see the underlying evidence—who said it, when, and from which channel.",
      "link": "https://www.onyx.app/3310916-5"
    },
    {
      "text": "David Green: How much manual effort are we talking? Because if this becomes another tool that needs constant grooming, it’ll die.",
      "link": "https://www.onyx.app/3310916-6"
    },
    {
      "text": "Megan Foster: Fair. The default workflow is mostly automated, but with guardrails: it proposes merges and splits, and you can set rules by product area, platform, severity keywords—so you’re not mixing “mobile login” with “SIS integration,” for example. Usually a support lead or ops person spends a short weekly pass reviewing the clusters that are ambiguous; the rest runs on autopilot.",
      "link": "https://www.onyx.app/3310916-7"
    },
    {
      "text": "David Green: The weekly pass sounds like “someone’s job now.” Also, our org is sensitive to anything that looks like an algorithm telling them what’s important. That came up with a previous vendor.",
      "link": "https://www.onyx.app/3310916-8"
    },
    {
      "text": "Megan Foster: I want to separate two things. Clustering is about deduping and making volume visible—less about telling you what to do. The prioritization layer can be configured, but we don’t need to lead with that today. For Prairielark, the use case you flagged was deal risk: sales wants a clean answer when a late-stage prospect hits a known issue. That’s where linking an opportunity to an issue cluster helps—sales sees current status, internal notes, and safe-to-say language, instead of chasing product in Slack.",
      "link": "https://www.onyx.app/3310916-9"
    },
    {
      "text": "David Green: Linking opportunities sounds great in theory. In practice, we’ve been burned. People argue about severity versus frequency. And if the score is a black box, product will ignore it and create their own list.",
      "link": "https://www.onyx.app/3310916-10"
    },
    {
      "text": "Megan Foster: Totally. When teams feel it’s a black box, they revert to parallel spreadsheets. What we do is make the weighting explicit: you can show the components—frequency, affected segment, revenue exposure—so if leadership wants to adjust ARR weighting for enterprise districts, you do it transparently.",
      "link": "https://www.onyx.app/3310916-11"
    },
    {
      "text": "David Green: But even if it’s “transparent,” it still becomes a political debate every quarter. And right now we’re trying to reduce process overhead, not add another forum where support and product argue.",
      "link": "https://www.onyx.app/3310916-12"
    },
    {
      "text": "Megan Foster: Understood. If the goal is fewer debates, one approach is to treat Issue_Tracker as the single source of evidence, not the single source of priority. So: clustering produces the facts—what’s being reported, by whom, how often, what it’s tied to—and your existing process decides priority. Then later, if you want, you can layer in impact scoring.",
      "link": "https://www.onyx.app/3310916-13"
    },
    {
      "text": "David Green: That might be more acceptable. But I’m still worried about accuracy. Education customers describe the same issue in wildly different terms. If the clustering is off, it’ll either undercount or lump unrelated stuff together.",
      "link": "https://www.onyx.app/3310916-14"
    },
    {
      "text": "Megan Foster: That’s exactly why we use semantic similarity instead of pure keyword matching, and why there’s a merge/split workflow. If two clusters are actually the same root cause—say “grade passback failing” and “SIS sync error”—the system will suggest a merge based on overlapping phrases and linked components, but your team approves it. And if it lumps unrelated issues, you split it and the model learns from those decisions.",
      "link": "https://www.onyx.app/3310916-15"
    },
    {
      "text": "David Green: You’re saying “the model learns,” but we’ve heard that before. What happens when it’s wrong for months and we make decisions on bad groupings?",
      "link": "https://www.onyx.app/3310916-16"
    },
    {
      "text": "Megan Foster: Practically, we recommend starting with a narrow scope. For example: pick one product area—maybe SIS integrations since that’s where districts get loud—and run clustering only there for 30 days. You validate: do the clusters match what your support lead already knows? Are you seeing duplicates collapse? If it’s not accurate enough, you don’t roll it out broadly.",
      "link": "https://www.onyx.app/3310916-17"
    },
    {
      "text": "David Green: That pilot sounds fine. But procurement is asking us to consolidate tooling, not add. We already have Zendesk, Jira, Salesforce, and a couple analytics tools. Another layer is a hard sell internally.",
      "link": "https://www.onyx.app/3310916-18"
    },
    {
      "text": "Megan Foster: I hear you. The argument isn’t “another tool,” it’s reducing the hidden tool—spreadsheets, Slack threads, and ad hoc triage meetings. Issue_Tracker becomes the connective tissue: Zendesk stays Zendesk, Jira stays Jira, but the “issue object” and its history stop being scattered.",
      "link": "https://www.onyx.app/3310916-19"
    },
    {
      "text": "David Green: Our leadership will ask: why can’t Zendesk do this? Or why can’t we just standardize Jira tickets better?",
      "link": "https://www.onyx.app/3310916-20"
    },
    {
      "text": "Megan Foster: Zendesk is great for individual tickets, but it doesn’t create a persistent cluster with business context and links to downstream engineering work in a standardized way. Jira is great for delivery tasks, but it’s not where you want to store customer evidence and the “what are customers saying across channels” picture. Issue_Tracker is the layer in between.",
      "link": "https://www.onyx.app/3310916-21"
    },
    {
      "text": "David Green: Okay, but bringing this back to sales—our sales team wants something simple. “Is this fixed? What do I tell the district?” If they have to learn a new system or interpret clusters, they won’t use it.",
      "link": "https://www.onyx.app/3310916-22"
    },
    {
      "text": "Megan Foster: That’s why the workflow is: sales doesn’t manage clusters. They search the issue by phrase, or it gets linked automatically when an opportunity mentions a known theme. Then they see: status, ETA notes if available, and approved language that product/support agreed is safe to communicate. It’s less interpretation, more “here’s the current truth.”",
      "link": "https://www.onyx.app/3310916-23"
    },
    {
      "text": "David Green: And who writes the “approved language”? Because that becomes another bottleneck and another debate.",
      "link": "https://www.onyx.app/3310916-24"
    },
    {
      "text": "Megan Foster: Typically product or support ops drafts it once per cluster, and it’s versioned. But you can keep it lightweight—two sentences: what’s happening and what the workaround is. The point is preventing each AE from inventing their own narrative.",
      "link": "https://www.onyx.app/3310916-25"
    },
    {
      "text": "David Green: This is all reasonable, but I’m not convinced it won’t turn into a governance project. We’re stretched. Also, our data is messy—ticket fields aren’t consistent, and sometimes issues come in through email that never makes it into Zendesk.",
      "link": "https://www.onyx.app/3310916-26"
    },
    {
      "text": "Megan Foster: If inputs aren’t centralized, clustering can’t see them. We can ingest emails and call-note summaries too, but yes—garbage in, garbage out. We’d need to confirm your channel coverage. If a lot of high-severity issues bypass Zendesk, the clusters will be incomplete.",
      "link": "https://www.onyx.app/3310916-27"
    },
    {
      "text": "David Green: That’s the reality. And honestly, we’re mid-migration on support workflows. I’m hesitant to layer something on top until that stabilizes.",
      "link": "https://www.onyx.app/3310916-28"
    },
    {
      "text": "Megan Foster: That makes sense. Given that, would it be helpful if we scoped a very small proof—one channel, one area, minimal governance—just to validate clustering accuracy? Or is timing the bigger blocker?",
      "link": "https://www.onyx.app/3310916-29"
    },
    {
      "text": "David Green: Timing is big. And I’m also getting pressure to show immediate ROI, not “maybe fewer spreadsheets.” If it takes a quarter to prove out, I’ll lose sponsorship.",
      "link": "https://www.onyx.app/3310916-30"
    },
    {
      "text": "Megan Foster: Understood. The fastest measurable outcome is reduction in duplicate triage effort and faster response for sales on known issues. But if you can’t run even a 30-day focused pilot because of the migration, it may be better to revisit once your support workflows settle.",
      "link": "https://www.onyx.app/3310916-31"
    },
    {
      "text": "David Green: Yeah, I think that’s where we are. I don’t want to start something new, then have to rewire it in two months. The concept is good, but I can’t commit to a buying process right now.",
      "link": "https://www.onyx.app/3310916-32"
    },
    {
      "text": "Megan Foster: That’s fair. Why don’t we do this: you tell me when your migration milestone hits—maybe end of quarter—and I’ll send a short plan for a constrained pilot: SIS integrations only, Zendesk only, with success criteria around dedupe rate and time-to-answer for sales. If it’s not compelling quickly, we stop.",
      "link": "https://www.onyx.app/3310916-33"
    },
    {
      "text": "David Green: That would be okay. Send me the pilot outline and what you’d need from our side—time, data access, who owns what.",
      "link": "https://www.onyx.app/3310916-34"
    },
    {
      "text": "Megan Foster: Will do. And David, before we wrap—are there any internal objections you already anticipate so I can address them in the outline? Sounds like governance overhead and data completeness are the big ones.",
      "link": "https://www.onyx.app/3310916-35"
    },
    {
      "text": "David Green: Yes. And skepticism about any scoring becoming a political football. If you keep it focused on evidence and clustering, it’ll land better.",
      "link": "https://www.onyx.app/3310916-36"
    },
    {
      "text": "Megan Foster: Got it. I’ll keep the plan strictly on clustering and the evidence trail, with optional scoring later. I’ll send that over this afternoon.",
      "link": "https://www.onyx.app/3310916-37"
    },
    {
      "text": "David Green: Thanks, Megan. Let’s regroup later—probably after we get through the migration.",
      "link": "https://www.onyx.app/3310916-38"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "megan_foster@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "david_green@prairielark_education.onyx.app"
    }
  ]
}