{
  "id": "FIREFLIES_7643698",
  "semantic_identifier": "7643698 - Pebble & Pine Coffee - sales_pitch - Discussion with Allison Peterson",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-05-30 00:00:00",
  "metadata": {
    "meeting_date": "2025-05-30 00:00:00",
    "duration_min": "25"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-05"
      ],
      "year_month": "2025-05",
      "meeting_title": "7643698 - Pebble & Pine Coffee - sales_pitch - Discussion with Allison Peterson",
      "organizer_email": "megan_foster@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Megan Foster: Hi Allison—Megan Foster here. Thanks for taking a few minutes. I work with revenue teams that live in Salesforce or HubSpot but need a clearer, more consistent way to turn activity and pipeline signals into “what do I do next” and a forecast they can actually trust. Is now still good for a quick intro?",
      "link": "https://www.onyx.app/6588656-1"
    },
    {
      "text": "Allison Peterson: Yep, I’ve got about five minutes. What are you calling about?",
      "link": "https://www.onyx.app/6588656-2"
    },
    {
      "text": "Megan Foster: Perfect. I wanted to share Sales_Accelerator—it's a sales execution layer that sits on top of your CRM. It doesn’t replace what you already use; it pulls in your existing opportunity stages plus real activity signals—emails, calls, meetings—then gives you explainable forecasting and best-next-action guidance so deals don’t stall quietly. Quick question: at Pebble & Pine Coffee, where do you feel the most pain—forecast accuracy at the end of the month/quarter, or deals slipping after discovery?",
      "link": "https://www.onyx.app/6588656-3"
    },
    {
      "text": "Allison Peterson: Honestly, both. Forecasts get squishy, and we definitely have deals that go dark after discovery.",
      "link": "https://www.onyx.app/6588656-4"
    },
    {
      "text": "Megan Foster: That’s exactly the combo we built for. On the forecast side, Sales_Accelerator produces commit/best-case/pipeline views, but it doesn’t just echo CRM stage. It uses drivers like stage age, last touch, whether a next meeting is actually scheduled, and historical cycle-time benchmarks—so you can see *why* something is likely to close or slip.",
      "link": "https://www.onyx.app/6588656-5"
    },
    {
      "text": "Allison Peterson: We have some dashboards already. How is this different from reporting in Salesforce?",
      "link": "https://www.onyx.app/6588656-6"
    },
    {
      "text": "Megan Foster: Great question. Traditional dashboards show “what is,” but they don’t reliably connect activity to outcome, and they rarely explain slippage early enough to fix it. Sales_Accelerator flags risk patterns—like “this deal is in stage 2 twice as long as your benchmark and hasn’t had a live touch in 10 days”—then recommends the next step to get it moving. It’s proactive, not just retrospective.",
      "link": "https://www.onyx.app/6588656-7"
    },
    {
      "text": "Allison Peterson: Okay. But we’re a lean team—if it’s another tool that requires a lot of admin work, it’ll be tough.",
      "link": "https://www.onyx.app/6588656-8"
    },
    {
      "text": "Megan Foster: Totally fair. The setup is light because it sits on top of your existing CRM and activity data. The biggest change is actually in day-to-day behavior: reps get a clear queue of what to do next, and managers get an early-warning layer before end-of-quarter surprises. You’re not building a new process; you’re making the current one more consistent and visible.",
      "link": "https://www.onyx.app/6588656-9"
    },
    {
      "text": "Allison Peterson: What does “what to do next” look like? Like tasks?",
      "link": "https://www.onyx.app/6588656-10"
    },
    {
      "text": "Megan Foster: Exactly—actionable recommendations tied to the deal. One common use case is right after discovery. The tool will help the AE follow up fast and consistently: it drafts a recap email, suggests a couple tailored proof points from your approved positioning library, and generates a mutual action plan with due dates and stakeholders so you can multi-thread instead of relying on a single champion.",
      "link": "https://www.onyx.app/6588656-11"
    },
    {
      "text": "Allison Peterson: The recap email piece is interesting. Our reps are inconsistent there, and we lose momentum.",
      "link": "https://www.onyx.app/6588656-12"
    },
    {
      "text": "Megan Foster: That’s a very common failure point. When the follow-up is late or vague, the buyer’s urgency evaporates. Sales_Accelerator nudges the rep immediately post-call—“send recap within 2 hours,” “confirm next meeting,” “add stakeholders,” “propose MAP dates”—and it tracks whether that actually happened. If the next meeting isn’t scheduled, it marks it as an elevated risk and surfaces it to the manager as well.",
      "link": "https://www.onyx.app/6588656-13"
    },
    {
      "text": "Allison Peterson: How does it know what proof points to use? We don’t have a huge enablement team.",
      "link": "https://www.onyx.app/6588656-14"
    },
    {
      "text": "Megan Foster: You don’t need a huge team. You’d load a small set of approved positioning blocks—think a lightweight library of “here are our best proof points by persona or problem.” Sales_Accelerator recommends two that fit the context, so reps aren’t improvising. If you already have something like that in docs, we can start small and refine.",
      "link": "https://www.onyx.app/6588656-15"
    },
    {
      "text": "Allison Peterson: And the forecast—how quickly would we see that improve? Everyone says they have “better forecasting.”",
      "link": "https://www.onyx.app/6588656-16"
    },
    {
      "text": "Megan Foster: Fair skepticism. The improvement comes from two things: first, we’re combining stage data with actual activity signals and cycle-time benchmarks; second, the output is explainable—so your team trusts it and can act on it. Instead of a black-box number, it will tell you the drivers: “stage age is high,” “no meeting scheduled,” “no recent touch,” “historically similar deals convert at X%.” That helps managers coach *before* a slip becomes permanent.",
      "link": "https://www.onyx.app/6588656-17"
    },
    {
      "text": "Allison Peterson: We definitely struggle to diagnose why things slip until it’s too late.",
      "link": "https://www.onyx.app/6588656-18"
    },
    {
      "text": "Megan Foster: Exactly. And it also helps with scenario planning. For example, you can ask, “If we add 20 SQLs in our best segment, what impact should we expect?” That’s useful for planning promos, partner pushes, or just aligning leadership on what pipeline is needed to hit target.",
      "link": "https://www.onyx.app/6588656-19"
    },
    {
      "text": "Allison Peterson: That would help. We’ve been guessing a lot when we plan our next quarter.",
      "link": "https://www.onyx.app/6588656-20"
    },
    {
      "text": "Megan Foster: Makes sense. One more quick question so I don’t assume: are your AEs the ones running discovery and follow-up, or do you have SDRs handing off?",
      "link": "https://www.onyx.app/6588656-21"
    },
    {
      "text": "Allison Peterson: We have SDRs setting meetings, but AEs own discovery and everything after.",
      "link": "https://www.onyx.app/6588656-22"
    },
    {
      "text": "Megan Foster: Perfect fit for the post-discovery use case then. We see the fastest ROI when AEs tighten that follow-up motion—recap email, proof points, mutual plan, stakeholder mapping—and managers get a clear view of which deals are drifting and why. That combination tends to lift conversion and reduce forecast surprises.",
      "link": "https://www.onyx.app/6588656-23"
    },
    {
      "text": "Allison Peterson: I like the sound of it. What would the next step be?",
      "link": "https://www.onyx.app/6588656-24"
    },
    {
      "text": "Megan Foster: I’d suggest a 30-minute working session where we connect the dots to your process: what CRM you’re on, what “stage age” looks like for you, what activity signals you capture, and we can walk through a sample opportunity flow—especially the discovery-to-next-step moment. If you’re open to it, we can also show what the forecast view looks like by rep/segment and how risk alerts surface.",
      "link": "https://www.onyx.app/6588656-25"
    },
    {
      "text": "Allison Peterson: Yeah, I’m open to that. Can you loop in my sales ops lead too?",
      "link": "https://www.onyx.app/6588656-26"
    },
    {
      "text": "Megan Foster: Absolutely. Who should I include, and what CRM are you primarily using today—Salesforce or HubSpot?",
      "link": "https://www.onyx.app/6588656-27"
    },
    {
      "text": "Allison Peterson: Salesforce. And I’ll add Jordan Kim from sales ops.",
      "link": "https://www.onyx.app/6588656-28"
    },
    {
      "text": "Megan Foster: Great—Salesforce is very common for us. I’ll send a calendar invite for 30 minutes with you and Jordan. Do mornings or afternoons usually work better next week?",
      "link": "https://www.onyx.app/6588656-29"
    },
    {
      "text": "Allison Peterson: Tuesday afternoon or Thursday morning would work.",
      "link": "https://www.onyx.app/6588656-30"
    },
    {
      "text": "Megan Foster: Perfect. I’ll propose Tuesday at 2:00 and Thursday at 10:00, and you can pick what’s best. Before that meeting, if you can share your current stage definitions and a rough sense of your average sales cycle, we’ll tailor the demo so it’s not generic.",
      "link": "https://www.onyx.app/6588656-31"
    },
    {
      "text": "Allison Peterson: Sure—send me what you need and I’ll see what I can pull together.",
      "link": "https://www.onyx.app/6588656-32"
    },
    {
      "text": "Megan Foster: Will do. Thanks, Allison—appreciate the time today. I’ll get that invite over in the next few minutes.",
      "link": "https://www.onyx.app/6588656-33"
    },
    {
      "text": "Allison Peterson: Sounds good. Talk soon.",
      "link": "https://www.onyx.app/6588656-34"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "megan_foster@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "allison_peterson@pebble_&_pine_coffee.onyx.app"
    }
  ]
}