{
  "id": "FIREFLIES_8902959",
  "semantic_identifier": "8902959 - Nimbunest Snacks - sales_pitch - Discussion with Jade Jacobs",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-05-08 00:00:00",
  "metadata": {
    "meeting_date": "2025-05-08 00:00:00",
    "duration_min": "16"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-05"
      ],
      "year_month": "2025-05",
      "meeting_title": "8902959 - Nimbunest Snacks - sales_pitch - Discussion with Jade Jacobs",
      "organizer_email": "arjun_mehta@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Arjun Mehta: Hi Jade—Arjun Mehta here. Thanks for taking a few minutes today. I’ll keep it brief. I wanted to share an idea that’s helped teams reduce customer-issue chaos across Support, Engineering, and Sales—especially when a deal is on the line.",
      "link": "https://www.onyx.app/4475787-1"
    },
    {
      "text": "Jade Jacobs: Hi Arjun. Okay—quick is good. What’s this about?",
      "link": "https://www.onyx.app/4475787-2"
    },
    {
      "text": "Arjun Mehta: Totally. The product is called Issue_Tracker. It’s a layer that sits between your support channels—like Zendesk or Intercom—your delivery tools like Jira or Linear, and your customer context in Salesforce or HubSpot. It continuously ingests customer-reported issues, deduplicates them into clusters, and ties them back to impacted customers and opportunities—so Sales can see what’s real, what’s duplicative noise, and what’s actually threatening revenue.",
      "link": "https://www.onyx.app/4475787-3"
    },
    {
      "text": "Jade Jacobs: We already have Zendesk and Jira connected with some workflows. And our CSMs try to keep Salesforce updated. So what’s different here?",
      "link": "https://www.onyx.app/4475787-4"
    },
    {
      "text": "Arjun Mehta: Great question. Most setups connect systems, but they don’t standardize the “issue object.” Issue_Tracker creates a single, searchable issue cluster—root cause + evidence + impacted accounts—linked to every source ticket and to the downstream Jira work. The big difference is it stays defensible: you can click from the cluster to the original tickets, and from the cluster to the engineering item, without duplicate data entry or someone manually curating spreadsheets.",
      "link": "https://www.onyx.app/4475787-5"
    },
    {
      "text": "Jade Jacobs: We definitely have spreadsheets. But we also have a support ops person who does some tagging and triage. It’s not perfect, but it works.",
      "link": "https://www.onyx.app/4475787-6"
    },
    {
      "text": "Arjun Mehta: That makes sense. Where Issue_Tracker tends to help is when “it works” until it doesn’t—like when Sales hears about an issue from a prospect, but Support has 37 tickets that are all slightly different phrasing, and Engineering has three Jira tickets that may or may not be the same root cause. With Issue_Tracker, you can set dedupe rules and field mapping so those become one theme, with consistent metadata, and a single status/ETA narrative that’s safe for customer-facing teams.",
      "link": "https://www.onyx.app/4475787-7"
    },
    {
      "text": "Jade Jacobs: We’re not trying to boil the ocean though. And we’re pretty careful about what Sales says—sometimes they overpromise.",
      "link": "https://www.onyx.app/4475787-8"
    },
    {
      "text": "Arjun Mehta: Exactly—and that’s one of the use cases I wanted to highlight. When a late-stage opportunity is tied to a known issue cluster, Issue_Tracker can surface the current status, any ETA notes, and even approved language—what’s safe to communicate—so Sales doesn’t freelanced their own story. It also integrates with Sales_Accelerator so the deal can be flagged “at risk” based on the issue’s status and impact.",
      "link": "https://www.onyx.app/4475787-9"
    },
    {
      "text": "Jade Jacobs: We don’t use Sales_Accelerator. And candidly, our Sales team doesn’t always log things cleanly in Salesforce either.",
      "link": "https://www.onyx.app/4475787-10"
    },
    {
      "text": "Arjun Mehta: Understood. Even without Sales_Accelerator, the core value still stands: the connector to Salesforce can link clusters to accounts and opportunities, so you can prioritize issues based on business impact—revenue exposure, ICP segment, or deal risk—rather than whoever yelled loudest in Slack. If data hygiene is uneven, we usually start with light-touch field mapping: account ID, segment, opportunity stage—just enough to be useful.",
      "link": "https://www.onyx.app/4475787-11"
    },
    {
      "text": "Jade Jacobs: How heavy is the setup? We don’t have bandwidth for a big implementation.",
      "link": "https://www.onyx.app/4475787-12"
    },
    {
      "text": "Arjun Mehta: Setup is typically connectors plus mapping. For sources: Zendesk/Intercom/Help Scout. For delivery: Jira/Linear/GitHub. And for context: Salesforce/HubSpot plus Customer_Analyzer fit/segment IDs if you have them. You can start with just Zendesk + Jira + Salesforce. Then define dedupe rules—like matching by error signature, keywords, product area, or custom fields. The goal is to keep Zendesk and Jira as systems of record; Issue_Tracker just synchronizes metadata and adds back-links so teams can navigate without re-entering anything.",
      "link": "https://www.onyx.app/4475787-13"
    },
    {
      "text": "Jade Jacobs: That’s the concern—tools on top of tools. We already have a lot of dashboards no one checks.",
      "link": "https://www.onyx.app/4475787-14"
    },
    {
      "text": "Arjun Mehta: Totally fair. The reason teams use this is it replaces the manual “translation layer” between teams—spreadsheets, internal docs, recurring meetings to align on what’s actually happening. Instead of another dashboard, it’s more like: “Here’s the cluster, here’s the evidence, here’s impacted accounts, here’s the Jira link, here’s what we can safely tell customers.” It becomes the one place to answer “is this a known issue” and “what’s the real status.”",
      "link": "https://www.onyx.app/4475787-15"
    },
    {
      "text": "Jade Jacobs: We can usually answer “known issue,” but the “real status” part is tricky. Engineering doesn’t like committing to ETAs.",
      "link": "https://www.onyx.app/4475787-16"
    },
    {
      "text": "Arjun Mehta: Right, and Issue_Tracker doesn’t force hard ETAs. It can capture status notes and decision history in a way that’s searchable and attributable—so if Engineering says “investigating root cause; workaround exists,” that’s what gets surfaced, with the supporting tickets linked. It helps Sales and Support avoid guessing. And because clusters are deduped, you don’t have 50 tickets all asking for updates separately—Support can update one cluster and it propagates contextually.",
      "link": "https://www.onyx.app/4475787-17"
    },
    {
      "text": "Jade Jacobs: Okay. But I’m not sure this is a priority for us this quarter. We’re in the middle of a tooling freeze.",
      "link": "https://www.onyx.app/4475787-18"
    },
    {
      "text": "Arjun Mehta: I hear you. If this quarter is locked, it may not be the right time. The only reason I reached out is I’ve seen snack/CPG brands with ecommerce + wholesale pipelines get hit with deal slippage when a recurring issue pops up—like order routing bugs, integration failures, or reporting inaccuracies—and Sales doesn’t have a crisp, approved status to share. Even one late-stage deal slipping can be painful.",
      "link": "https://www.onyx.app/4475787-19"
    },
    {
      "text": "Jade Jacobs: We’re more B2B wholesale, and our issues are usually operational rather than software defects. Also, we don’t run Intercom—just Zendesk.",
      "link": "https://www.onyx.app/4475787-20"
    },
    {
      "text": "Arjun Mehta: Zendesk alone is fine. And operational issues can still be captured as themes if they’re coming through support channels—like “invoice mismatch” or “ASN delays”—and then tied back to impacted accounts. But if most of that work happens outside ticketing, Issue_Tracker may not be as strong a fit.",
      "link": "https://www.onyx.app/4475787-21"
    },
    {
      "text": "Jade Jacobs: Yeah, a lot of that is handled by our ops team directly. Support tickets exist, but they’re not the whole picture.",
      "link": "https://www.onyx.app/4475787-22"
    },
    {
      "text": "Arjun Mehta: That’s helpful. In that case, it might be less of an immediate win. One lightweight way some teams start is simply using the Zendesk + Jira sync and dedupe clustering to reduce duplicate engineering asks—without trying to model every operational workflow. But if Engineering volume is low, it’s probably not compelling.",
      "link": "https://www.onyx.app/4475787-23"
    },
    {
      "text": "Jade Jacobs: Engineering volume is relatively low, and Jira is mostly for internal projects. We don’t open many tickets from Support.",
      "link": "https://www.onyx.app/4475787-24"
    },
    {
      "text": "Arjun Mehta: Got it. Then I don’t want to force a square peg here. Would it be useful if I sent a one-pager on the “late-stage deal risk” use case—how linking Salesforce opportunities to issue clusters works—just so you have it on file in case priorities shift later?",
      "link": "https://www.onyx.app/4475787-25"
    },
    {
      "text": "Jade Jacobs: You can send it, sure, but I can’t promise I’ll get to it. And I don’t think I can commit to a longer sales call right now.",
      "link": "https://www.onyx.app/4475787-26"
    },
    {
      "text": "Arjun Mehta: Completely fine. Last quick question so I don’t waste your inbox: when Sales does get pulled into an issue—say a key account escalation—where do they go today to understand status? Is it Slack, a CSM, a spreadsheet?",
      "link": "https://www.onyx.app/4475787-27"
    },
    {
      "text": "Jade Jacobs: Usually they ping the CSM or Support lead, and then someone asks Engineering if needed. It’s messy, but it’s workable.",
      "link": "https://www.onyx.app/4475787-28"
    },
    {
      "text": "Arjun Mehta: Understood. That “messy but workable” is exactly the gap we address—when it becomes frequent enough to justify standardizing. I’ll send the short overview and a couple screenshots of the Zendesk-to-cluster-to-Jira back-link flow and the Salesforce opportunity linkage. If at some point you want to sanity-check fit, we can do a 20-minute discovery—no prep—just to confirm whether it’s worth revisiting.",
      "link": "https://www.onyx.app/4475787-29"
    },
    {
      "text": "Jade Jacobs: Okay. Send it over and maybe we’ll circle back later in the year.",
      "link": "https://www.onyx.app/4475787-30"
    },
    {
      "text": "Arjun Mehta: Will do. Thanks again for the time, Jade—appreciate it. I’ll keep it concise in email and won’t spam you. Have a good rest of your day.",
      "link": "https://www.onyx.app/4475787-31"
    },
    {
      "text": "Jade Jacobs: Thanks. Bye.",
      "link": "https://www.onyx.app/4475787-32"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "arjun_mehta@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "jade_jacobs@nimbunest_snacks.onyx.app"
    }
  ]
}