{
  "id": "FIREFLIES_3085500",
  "semantic_identifier": "3085500 - Pinewell Logistics - buy - Discussion with Grace Pierce",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2026-05-04 00:00:00",
  "metadata": {
    "meeting_date": "2026-05-04 00:00:00",
    "duration_min": "29"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2026-05"
      ],
      "year_month": "2026-05",
      "meeting_title": "3085500 - Pinewell Logistics - buy - Discussion with Grace Pierce",
      "organizer_email": "mina_park@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Mina Park: Hi Grace—good to see you again. Since this is our third call, I was hoping we could use today to confirm scope, address the clustering accuracy concerns you raised, and—if it feels right—lock in next steps toward a purchase. Does that still work?",
      "link": "https://www.onyx.app/9756859-1"
    },
    {
      "text": "Grace Pierce: Hi Mina. Yes, that’s fine. I do want to be upfront though: we’re interested, but we’re still not convinced it’s worth buying right now.",
      "link": "https://www.onyx.app/9756859-2"
    },
    {
      "text": "Mina Park: Totally fair. Let’s make it concrete. Last time you mentioned you’re swimming in ticket noise—around 5,000 tickets a month across channels—and you’re trying to get that down to a manageable set of themes for product and engineering. Issue_Tracker’s core value is clustering and dedupe into something like ~80 active themes, and then helping you route the top 10 with evidence and impacted customer lists. Is that still the biggest pain?",
      "link": "https://www.onyx.app/9756859-3"
    },
    {
      "text": "Grace Pierce: Yes. Our support ops team spends too much time tagging and summarizing. But our product team doesn’t trust summaries unless the links back to source conversations are clean and accurate.",
      "link": "https://www.onyx.app/9756859-4"
    },
    {
      "text": "Mina Park: That’s exactly why I want to focus on two things today: the clustering workflow for reducing noise, and the issue_history feature—because it’s what keeps trust over time. On clustering: we ingest from Zendesk/Intercom, dedupe and cluster, then your team can review the clusters and adjust before they become “official” themes. On issue_history: every cluster has a full timeline—creation, merges and splits, priority changes with rationale, linked Jira items, status milestones like investigating → in progress → released, plus customer communication history. So when product asks “why did we deprioritize this?” it’s not tribal knowledge; it’s documented.",
      "link": "https://www.onyx.app/9756859-5"
    },
    {
      "text": "Grace Pierce: The audit trail sounds good. But our biggest concern is still the false merges. If two distinct issues get merged, we look sloppy. If one issue gets fragmented across multiple clusters, we miss the real volume and urgency. We’ve been burned by automation that overpromises.",
      "link": "https://www.onyx.app/9756859-6"
    },
    {
      "text": "Mina Park: Yep—if clustering is wrong, everything downstream is wrong. Let me ask: where do you see the language variation most? Different segments describing the same root cause differently? Or different channels like phone vs chat?",
      "link": "https://www.onyx.app/9756859-7"
    },
    {
      "text": "Grace Pierce: Both. Our enterprise customers describe problems in operational terms. Smaller customers describe symptoms. And chat is messy—typos, shorthand, screenshots. Email tickets are more structured.",
      "link": "https://www.onyx.app/9756859-8"
    },
    {
      "text": "Mina Park: Got it. So two points. First, we don’t position this as “set it and forget it.” We position it as “80% automated, 20% human-in-the-loop,” with controls. Your ops lead can review the top clusters weekly, approve merges, split clusters when needed, and add a note on why. Second, issue_history helps reduce rework even when you do have to correct a cluster—because the changes are tracked. If you split a cluster, you don’t lose the story: what got moved, why, which customers were impacted, and which Jira work items were linked.",
      "link": "https://www.onyx.app/9756859-9"
    },
    {
      "text": "Grace Pierce: But that still assumes our team has time to review and correct clusters. We’re trying to reduce workload, not add a new review process.",
      "link": "https://www.onyx.app/9756859-10"
    },
    {
      "text": "Mina Park: Fair. The way teams usually do this is they don’t review everything. They review the top 10–20 clusters by volume or revenue exposure, because those are the ones that matter. The long tail can stay automated and still be helpful for search and pattern detection. Also, the point is to replace the manual tagging and summary work you’re doing today. Instead of support ops reading hundreds of tickets to write a weekly “themes” doc, the system generates the clusters and the evidence set automatically.",
      "link": "https://www.onyx.app/9756859-11"
    },
    {
      "text": "Grace Pierce: That’s attractive. But I’m not sure we’re set up internally to operationalize it. Our product team already has a Jira intake process and they’re protective of it.",
      "link": "https://www.onyx.app/9756859-12"
    },
    {
      "text": "Mina Park: We’re not trying to replace Jira intake. Issue_Tracker sits between support and Jira. The “issue object” stays linked: cluster with root cause hypothesis + evidence + affected customers on our side, and then one or more Jira tickets on their side. The benefit for product is: when they open a Jira item, it’s not just “support says this is bad.” It’s “here are the representative examples, here are the customers, here’s the history, here’s what we told them.” That tends to reduce the back-and-forth.",
      "link": "https://www.onyx.app/9756859-13"
    },
    {
      "text": "Grace Pierce: If it worked that cleanly, yes. But we’d need to prove it. And we don’t have bandwidth for a heavy implementation.",
      "link": "https://www.onyx.app/9756859-14"
    },
    {
      "text": "Mina Park: Understood. Implementation-wise, for Pinewell, I’d propose a lightweight start: connect Zendesk, connect Jira, and import your last 90 days of tickets. Then we’d configure your cluster review rules and set up a weekly export of the top 10 themes to your product meeting. That’s it to start. If we can’t show “5,000 tickets → ~80 themes” with something your team trusts, we stop.",
      "link": "https://www.onyx.app/9756859-15"
    },
    {
      "text": "Grace Pierce: That sounds like a pilot. Are you asking us to buy first or pilot first?",
      "link": "https://www.onyx.app/9756859-16"
    },
    {
      "text": "Mina Park: Ideally, we start with a paid pilot—short term—so we can give you full functionality and proper support, and so your team treats it as real. Then we convert into an annual. That’s the cleanest path.",
      "link": "https://www.onyx.app/9756859-17"
    },
    {
      "text": "Grace Pierce: I’m going to be honest, Mina: I don’t think we can do a paid pilot right now. Budget is tight, and procurement is slow. We’re in the middle of renegotiating our Zendesk contract and leadership wants us to limit new tools this quarter.",
      "link": "https://www.onyx.app/9756859-18"
    },
    {
      "text": "Mina Park: Okay, thanks for being direct. If budget and procurement are the blockers, can I ask: is the value still compelling enough that we should plan for next quarter? Or is it more that the clustering trust issue makes it a “maybe later” even if budget freed up?",
      "link": "https://www.onyx.app/9756859-19"
    },
    {
      "text": "Grace Pierce: It’s both. I like the concept and the issue history piece—having a defensible timeline and consistent customer comms would help. But the trust risk is big for us. If we have to spend time policing false merges, leadership will call it a failed tool.",
      "link": "https://www.onyx.app/9756859-20"
    },
    {
      "text": "Mina Park: Makes sense. If we could reduce that risk with a success criterion—say, “top 20 clusters have under X% merge/split corrections after the first two weeks”—would that change things? Or is the organizational constraint the bigger factor?",
      "link": "https://www.onyx.app/9756859-21"
    },
    {
      "text": "Grace Pierce: Organizational constraint. Even if you gave me perfect clustering, I can’t get a new purchase through this quarter. And I’m not sure I can even get the product team to participate in a pilot until we finish the Zendesk work.",
      "link": "https://www.onyx.app/9756859-22"
    },
    {
      "text": "Mina Park: Got it. Then instead of trying to force a close today, let’s land on a realistic path. Would you be open to a no-cost dataset assessment? You give us an export—90 days—so we can show you what your themes would look like, and we can quantify how often clusters would need correction. That way, when budget opens up, you have evidence internally.",
      "link": "https://www.onyx.app/9756859-23"
    },
    {
      "text": "Grace Pierce: Possibly, but even that takes time to coordinate with our data/security folks. And our legal team is cautious about exporting ticket data.",
      "link": "https://www.onyx.app/9756859-24"
    },
    {
      "text": "Mina Park: Understood. What if we keep it even simpler: we schedule a 30-minute working session next month with you and whoever owns support ops reporting, and we map your current “weekly themes” workflow end-to-end—where the time goes, what breaks, what signals product trusts. I can then send a one-page ROI and risk assessment you can share internally. No data transfer required.",
      "link": "https://www.onyx.app/9756859-25"
    },
    {
      "text": "Grace Pierce: That’s more doable. But I want to set expectations: I’m not committing to a purchase off the back of that.",
      "link": "https://www.onyx.app/9756859-26"
    },
    {
      "text": "Mina Park: Completely fair. Given what you’ve said, I don’t think it’s responsible for me to push you into procurement this quarter. My goal would be: help you build the internal case, and if the timing aligns next quarter, we pick up and run with minimal rework.",
      "link": "https://www.onyx.app/9756859-27"
    },
    {
      "text": "Grace Pierce: That sounds reasonable.",
      "link": "https://www.onyx.app/9756859-28"
    },
    {
      "text": "Mina Park: Before we wrap, can I confirm the two decision blockers so I reflect them accurately? One: timing/budget/procurement due to Zendesk renegotiation and tool freeze this quarter. Two: risk of false merges/fragmented clusters and the perception cost if your team has to babysit it.",
      "link": "https://www.onyx.app/9756859-29"
    },
    {
      "text": "Grace Pierce: Yes, that’s exactly it.",
      "link": "https://www.onyx.app/9756859-30"
    },
    {
      "text": "Mina Park: Great. I’ll send an invite for that workflow session—mid-February—along with an agenda focused on (1) your current ticket-to-theme process, (2) what “trust” means for your product team, and (3) what success criteria would need to be true for a pilot. Does Feb 12 or Feb 14 work better?",
      "link": "https://www.onyx.app/9756859-31"
    },
    {
      "text": "Grace Pierce: Feb 14 is better.",
      "link": "https://www.onyx.app/9756859-32"
    },
    {
      "text": "Mina Park: Perfect. I’ll send that. And Grace—thanks for the candor today. I know this isn’t a “yes” right now, but this was still really helpful to align on what would make it a yes later.",
      "link": "https://www.onyx.app/9756859-33"
    },
    {
      "text": "Grace Pierce: Thanks, Mina. I appreciate you not pushing. We’ll talk on the 14th.",
      "link": "https://www.onyx.app/9756859-34"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mina_park@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "grace_pierce@pinewell_logistics.onyx.app"
    }
  ]
}