{
  "id": "FIREFLIES_4387916",
  "semantic_identifier": "4387916 - Deltavantage Group - buy - Discussion with Mia Newman",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-12-19 00:00:00",
  "metadata": {
    "meeting_date": "2025-12-19 00:00:00",
    "duration_min": "27"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-12"
      ],
      "year_month": "2025-12",
      "meeting_title": "4387916 - Deltavantage Group - buy - Discussion with Mia Newman",
      "organizer_email": "camila_vega@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Camila Vega: Hi Mia—thanks for making time again. Since this is call three, I wanted to use today to confirm the decision path and, ideally, wrap up next steps to get Sales_Accelerator live for your SDR team. Does that still work?",
      "link": "https://www.onyx.app/4182739-1"
    },
    {
      "text": "Mia Newman: Hey Camila. Yes, but I’ll be upfront—I’m not sure we’re ready to decide today. There are a couple concerns we keep circling back to.",
      "link": "https://www.onyx.app/4182739-2"
    },
    {
      "text": "Camila Vega: Totally fair. If we can resolve the concerns, is there anything else that would block moving forward—security, budget, timing?",
      "link": "https://www.onyx.app/4182739-3"
    },
    {
      "text": "Mia Newman: Budget and timing are manageable. The main issue is adoption. My SDR managers are skeptical of “AI telling them what to do,” and I’m worried we’ll buy something and reps won’t trust it.",
      "link": "https://www.onyx.app/4182739-4"
    },
    {
      "text": "Camila Vega: That’s helpful. Let’s focus on trust and adoption. The two pieces I think matter most for your use case are: (1) the sales initiation recommendations—next-best accounts plus next-best message—and (2) the explainable rationale behind every recommendation, so managers can coach to it instead of arguing with a black box. Can I walk through how that would look for Deltavantage’s SDR workflow?",
      "link": "https://www.onyx.app/4182739-5"
    },
    {
      "text": "Mia Newman: Sure, but I’ll want specifics. “Explainable” can mean a lot of things.",
      "link": "https://www.onyx.app/4182739-6"
    },
    {
      "text": "Camila Vega: Absolutely. In Sales_Accelerator, your SDR lead opens a prioritized list—say the “next 50 accounts.” That list is built using your CRM data, engagement/intent signals, and—importantly—Customer_Analyzer outputs like fit score and segment positioning blocks. For each account, we show “why this account now” in plain language: the fit tier, the fit drivers pulled from Customer_Analyzer, and any detected trigger events like recent engagement or a change in the account’s activity.",
      "link": "https://www.onyx.app/4182739-7"
    },
    {
      "text": "Mia Newman: When you say “show,” is it like a generic confidence score? Or can someone actually see something concrete and repeatable?",
      "link": "https://www.onyx.app/4182739-8"
    },
    {
      "text": "Camila Vega: Concrete and repeatable. Example: “Fit Tier A because: matches your target segment X, has required attributes Y and Z, and aligns to positioning block ‘Reduce operational risk’.” Then on the messaging side, it recommends an opener and proof points tied directly to that segment block—so the SDR sees: “Lead with this angle because this account fits Segment X and recently engaged with [signal].” Managers can click into the rationale, not just a number.",
      "link": "https://www.onyx.app/4182739-9"
    },
    {
      "text": "Mia Newman: That’s the theory, but my team’s pushback is usually: “We already know who to go after,” or “Our best reps don’t need templates.” They’ll ignore it.",
      "link": "https://www.onyx.app/4182739-10"
    },
    {
      "text": "Camila Vega: That’s a common pattern. Two things typically change the outcome. First, we’re not replacing your team’s judgment—we’re tightening consistency. Your best reps can still freestyle, but the floor rises because everyone starts aligned to your ICP and positioning rather than random outreach. Second, the initiation playbooks are customizable. So you can make the “recommended first-touch email” and “call talk track” match how Deltavantage already sells—tone, proof points, objection handlers—and then the system selects the right version based on segment and triggers.",
      "link": "https://www.onyx.app/4182739-11"
    },
    {
      "text": "Mia Newman: Customizable is good, but it also sounds like work. We’re lean. I don’t have someone who can spend weeks tuning playbooks.",
      "link": "https://www.onyx.app/4182739-12"
    },
    {
      "text": "Camila Vega: Understood. The reason Sales_Accelerator integrates with Customer_Analyzer instead of duplicating it is to reduce that setup load. You already have fit tiers and positioning blocks—so we can start with a minimal set: two segments, two playbooks each, and iterate. For a pilot, we’d keep it lightweight: import your existing outreach snippets, map them to the segment blocks, and let the system recommend which to use where.",
      "link": "https://www.onyx.app/4182739-13"
    },
    {
      "text": "Mia Newman: I’m also concerned about the “why.” Even if you show drivers, managers will ask: “Who decided these drivers?” If it’s not something we can defend, it becomes political internally.",
      "link": "https://www.onyx.app/4182739-14"
    },
    {
      "text": "Camila Vega: That makes sense. In our approach, the “drivers” aren’t invented out of thin air—they come from Customer_Analyzer’s fit scoring and the positioning blocks your team has already approved. Sales_Accelerator is consuming what you’ve already signed off on and operationalizing it. So when a manager asks “who decided,” the answer is: your ICP and messaging framework did—Sales_Accelerator just applies it systematically and flags the trigger events from CRM/engagement data.",
      "link": "https://www.onyx.app/4182739-15"
    },
    {
      "text": "Mia Newman: But in practice, we’ve had tools claim they “use our ICP” and then the recommendations still feel off. Like it picks accounts that look nothing like our best customers.",
      "link": "https://www.onyx.app/4182739-16"
    },
    {
      "text": "Camila Vega: If the recommendations feel off, that’s a showstopper. That’s why we emphasize the transparent trail: fit tier + explicit drivers + the segment mapping. In a pilot, we typically run side-by-side: your manager’s top 50 and Sales_Accelerator’s top 50, and we compare overlaps and differences with rationale. The goal isn’t 100% overlap; it’s that every “different” pick is defensible. If it’s not, we adjust the inputs and thresholds.",
      "link": "https://www.onyx.app/4182739-17"
    },
    {
      "text": "Mia Newman: Okay, but we’re past pilot discussions. You sent an order form last week. My VP asked me, “Are we sure this won’t be another dashboard no one opens?”",
      "link": "https://www.onyx.app/4182739-18"
    },
    {
      "text": "Camila Vega: Right—and that’s the core buying question. Sales_Accelerator is meant to live in the rep’s daily motion, not a separate reporting layer. The output isn’t “insights”; it’s an action queue: who to contact next, what message to lead with, and a ready-to-send first-touch email or LinkedIn opener plus a call talk track. So adoption is tied to whether it saves time and boosts replies. If reps don’t see that, we shouldn’t move forward.",
      "link": "https://www.onyx.app/4182739-19"
    },
    {
      "text": "Mia Newman: That’s exactly it. I don’t have confidence they’ll see that. My best manager already has a prioritization spreadsheet. They’ll say your queue is redundant.",
      "link": "https://www.onyx.app/4182739-20"
    },
    {
      "text": "Camila Vega: Let’s pressure-test it. Your spreadsheet prioritizes based on what inputs?",
      "link": "https://www.onyx.app/4182739-21"
    },
    {
      "text": "Mia Newman: Mostly firmographics, some intent, and rep notes. It’s manual, though. They update weekly.",
      "link": "https://www.onyx.app/4182739-22"
    },
    {
      "text": "Camila Vega: Got it. The delta is automation and message alignment. Your manager might still keep their list, but Sales_Accelerator can refresh daily using CRM + signals + Customer_Analyzer fit tiers, and then generate the segment-aligned opener with proof points. Even if you keep the same accounts, the messaging piece alone can lift reply rates and reduce “random” copy. Would your VP care if we could demonstrate higher meeting creation within, say, 30 days?",
      "link": "https://www.onyx.app/4182739-23"
    },
    {
      "text": "Mia Newman: Yes, but the problem is the burden of proof. To get the green light, I need a referenceable story or something stronger than “trust us, it works.”",
      "link": "https://www.onyx.app/4182739-24"
    },
    {
      "text": "Camila Vega: Understood. We can offer two things: a structured success plan with measurable targets—reply rate, meeting creation, time-to-first-touch—and a short, no-drama rollout. But if your internal stakeholders are already leaning “no,” I don’t want to force this.",
      "link": "https://www.onyx.app/4182739-25"
    },
    {
      "text": "Mia Newman: It’s not a “no,” it’s a “not now.” The skepticism is real, and we’re also rolling out a new comp plan next month. Change fatigue is high. If we introduce an automated recommendation engine now, managers will see it as another thing to police.",
      "link": "https://www.onyx.app/4182739-26"
    },
    {
      "text": "Camila Vega: That timing context matters. If the organization is in comp-plan rollout, adoption risk goes up. Let me ask: what decision did you want to make today? Sign, delay, or close it out?",
      "link": "https://www.onyx.app/4182739-27"
    },
    {
      "text": "Mia Newman: Delay. I don’t want to close it out completely, but I can’t take a signature to procurement right now.",
      "link": "https://www.onyx.app/4182739-28"
    },
    {
      "text": "Camila Vega: Okay. If we delay, I want to make it intentional, not “we’ll revisit someday.” What would need to be true in, say, 6–8 weeks for you to feel confident signing?",
      "link": "https://www.onyx.app/4182739-29"
    },
    {
      "text": "Mia Newman: Two things. One, I need to see that the “why” is actually something my managers accept—not just a screen with reasons, but reasons they agree are valid. Two, I need proof that reps will use it. Even a small internal test would help.",
      "link": "https://www.onyx.app/4182739-30"
    },
    {
      "text": "Camila Vega: That’s clear. Here’s a proposal: instead of moving to procurement, we do a short validation sprint—two weeks—focused only on sales initiation recommendations for one SDR pod. We’ll set up a side-by-side: their current prioritized list versus Sales_Accelerator’s recommended next 50, with the rationale visible. Your managers score “agree/disagree” on the why. And reps test the segment-aligned openers on a small batch to see if it saves time and gets replies. Would that be feasible during the comp rollout, or still too much?",
      "link": "https://www.onyx.app/4182739-31"
    },
    {
      "text": "Mia Newman: Even two weeks is tough right now. And honestly, my VP is asking why we can’t just tighten our existing process instead of adding a new layer.",
      "link": "https://www.onyx.app/4182739-32"
    },
    {
      "text": "Camila Vega: That’s a fair question. If tightening the existing process is the priority, the case for a new execution layer is weaker. Sales_Accelerator makes most sense when you want a consistent system that scales across reps and managers without manual upkeep. If you’re not ready for that operational shift, it may be premature.",
      "link": "https://www.onyx.app/4182739-33"
    },
    {
      "text": "Mia Newman: That’s where we are. I like the concept, but I can’t justify it internally right now. The trust piece is the biggest gap, and we don’t have bandwidth to run a proper evaluation.",
      "link": "https://www.onyx.app/4182739-34"
    },
    {
      "text": "Camila Vega: I appreciate the candor. Let’s do this: we’ll pause the commercial process. I’ll send a short recap for your VP: what Sales_Accelerator would do for Deltavantage’s SDR prioritization and segment-aligned messaging, plus the exact adoption risks you’re flagging and a low-lift validation option when timing is better. Then we can set a check-in for after the comp rollout—maybe mid-next quarter?",
      "link": "https://www.onyx.app/4182739-35"
    },
    {
      "text": "Mia Newman: Yes, that would be helpful. Let’s plan for mid-next quarter. I don’t want you chasing me weekly when I’ve already said we can’t move.",
      "link": "https://www.onyx.app/4182739-36"
    },
    {
      "text": "Camila Vega: Completely understood. I’ll stop the order form, send the recap today, and propose two dates about eight weeks out. If anything changes—like your VP asks for a quick proof point—you can pull me in sooner.",
      "link": "https://www.onyx.app/4182739-37"
    },
    {
      "text": "Mia Newman: Sounds good. Thanks, Camila.",
      "link": "https://www.onyx.app/4182739-38"
    },
    {
      "text": "Camila Vega: Thank you, Mia. I’ll follow up with that note shortly and we’ll regroup when the timing is right.",
      "link": "https://www.onyx.app/4182739-39"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "camila_vega@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mia_newman@deltavantage_group.onyx.app"
    }
  ]
}