{
  "id": "FIREFLIES_4726845",
  "semantic_identifier": "4726845 - Inland Crest Packaging - sales_call - Discussion with Jerry Dean",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-12-27 00:00:00",
  "metadata": {
    "meeting_date": "2025-12-27 00:00:00",
    "duration_min": "45"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-12"
      ],
      "year_month": "2025-12",
      "meeting_title": "4726845 - Inland Crest Packaging - sales_call - Discussion with Jerry Dean",
      "organizer_email": "arjun_mehta@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Arjun Mehta: Hey Jerry, good to see you again. Thanks for making time for a second chat. Last time you mentioned you’re trying to get more disciplined about which customer segments Inland Crest should really lean into—especially for product planning. I wanted to show you one piece of Customer_Analyzer that tends to get teams to a decision quickly: our fit estimation and the driver breakdown behind it.",
      "link": "https://www.onyx.app/5225117-1"
    },
    {
      "text": "Jerry Dean: Hey Arjun. Yeah, we’re still interested, but I’m juggling a few priorities. So if we can keep this tight, that’d help.",
      "link": "https://www.onyx.app/5225117-2"
    },
    {
      "text": "Arjun Mehta: Absolutely. Quick agenda: confirm what “good” looks like for you, walk through how the fit score works with the data you already have, and then see if it’s worth moving to procurement or if there are blockers. Sound good?",
      "link": "https://www.onyx.app/5225117-3"
    },
    {
      "text": "Jerry Dean: Sure. Though I’ll tell you upfront—internally we don’t always agree on what “good customer” means. Product, sales, marketing… they all argue.",
      "link": "https://www.onyx.app/5225117-4"
    },
    {
      "text": "Arjun Mehta: That’s actually the most common reason teams adopt this. Customer_Analyzer is designed to create a shared view using signals you already collect. For Inland Crest, when you say product planning, are you trying to identify high-fit customers with unmet needs to guide roadmap bets? Or is it more about sales targeting?",
      "link": "https://www.onyx.app/5225117-5"
    },
    {
      "text": "Jerry Dean: Product planning first. We’ve had a couple roadmap projects based on loud customers that didn’t pan out. But sales is going to push back if we tell them to stop chasing certain accounts.",
      "link": "https://www.onyx.app/5225117-6"
    },
    {
      "text": "Arjun Mehta: Makes sense. So here’s how fit estimation would help without it being “Arjun’s opinion” or “Product’s opinion.” You define fit drivers—industry, size, problem severity, willingness to pay, time-to-value, adoption patterns, even support burden—and then we compute a fit score 0–100 at the account and segment level. The key is the driver breakdown: you can show exactly why a segment scores high or low.",
      "link": "https://www.onyx.app/5225117-7"
    },
    {
      "text": "Jerry Dean: Okay, but define “we.” Is this your team doing consulting, or is it automated?",
      "link": "https://www.onyx.app/5225117-8"
    },
    {
      "text": "Arjun Mehta: Mostly product. We provide a guided setup, but the system computes it continuously once connected. Typically we connect CRM fields, onboarding survey answers if you have them, and product usage events if applicable. Support tickets can be useful too, especially for support burden and churn risk signals.",
      "link": "https://www.onyx.app/5225117-9"
    },
    {
      "text": "Jerry Dean: We’re a packaging company—usage events are limited. We have Salesforce, support tickets in Zendesk, and some onboarding forms. But it’s messy. Sales reps don’t fill in half the fields.",
      "link": "https://www.onyx.app/5225117-10"
    },
    {
      "text": "Arjun Mehta: Totally fair. When fields are sparse, we start with what’s reliable—closed-won history, renewal outcomes, ticket volume, onboarding survey themes—and we can weight drivers accordingly. Even with imperfect data, you can still get segment comparisons: like mid-market manufacturers versus smaller distributors, and see which group actually retains and expands.",
      "link": "https://www.onyx.app/5225117-11"
    },
    {
      "text": "Jerry Dean: I get the concept. I’m more worried that we’ll spend a bunch of time integrating and still end up with a score that sales doesn’t trust.",
      "link": "https://www.onyx.app/5225117-12"
    },
    {
      "text": "Arjun Mehta: That’s exactly why we emphasize transparency. It’s not a black box score—every score comes with “here are the drivers.” For example, a segment might score 82 because time-to-value is fast, support burden is low, and willingness to pay is high. Another might score 51 because support tickets spike and churn risk signals are elevated. You can take that into a product planning meeting and argue from evidence rather than gut feel.",
      "link": "https://www.onyx.app/5225117-13"
    },
    {
      "text": "Jerry Dean: Evidence is good, but our internal issue is political as much as it is analytical. Marketing will say “we need a broader ICP to grow.” Sales will say “don’t tell me no.” Product wants to focus.",
      "link": "https://www.onyx.app/5225117-14"
    },
    {
      "text": "Arjun Mehta: Understood. One way teams handle that is agreeing upfront on what outcomes matter. If the goal is roadmap bets that drive retention and expansion, then the fit drivers align to that: retention, adoption, support burden, expansion. It reframes the conversation. Instead of “who do we like,” it’s “who succeeds with us.”",
      "link": "https://www.onyx.app/5225117-15"
    },
    {
      "text": "Jerry Dean: That sounds nice in theory. In practice, we’ve tried “shared definitions” before. It becomes a workshop that everyone nods at and then ignores.",
      "link": "https://www.onyx.app/5225117-16"
    },
    {
      "text": "Arjun Mehta: Then I’d recommend avoiding a big workshop. We can do a lightweight pilot: pick two segments you’re debating today, run fit estimation using your last 12–18 months of accounts, and show a comparison with driver breakdown and recommended ICP profile based on observed outcomes. If it doesn’t resonate, you stop. If it does, you’ve got something concrete to take back internally.",
      "link": "https://www.onyx.app/5225117-17"
    },
    {
      "text": "Jerry Dean: What do you need from us to run that pilot?",
      "link": "https://www.onyx.app/5225117-18"
    },
    {
      "text": "Arjun Mehta: Minimum: Salesforce export or read-only connection for key fields and outcomes—close dates, deal size, industry, employee count if you track it—plus a Zendesk connection or export for ticket volume and categories. Optional: onboarding forms. We can get to a first set of fit scores in about two weeks.",
      "link": "https://www.onyx.app/5225117-19"
    },
    {
      "text": "Jerry Dean: Two weeks isn’t terrible. But we’ve been burned by “recommended ICP profile” tools that just restate whatever data we fed it. Like, “your best customers are the ones that renew.” Not helpful.",
      "link": "https://www.onyx.app/5225117-20"
    },
    {
      "text": "Arjun Mehta: Fair critique. The differentiation is in the driver analysis and segment comparison. It’s not just “renewers.” It’s identifying what characteristics correlate with renewals and expansion—like time-to-value under 30 days, certain operational pain points, or lower support burden. And it flags where you’re winning deals that later churn, which is often the hidden cost.",
      "link": "https://www.onyx.app/5225117-21"
    },
    {
      "text": "Jerry Dean: Another concern: our data is not clean enough to make those correlations. If a sales rep doesn’t log the industry correctly, you’ll tell us the wrong segment is best.",
      "link": "https://www.onyx.app/5225117-22"
    },
    {
      "text": "Arjun Mehta: Data quality impacts any model, agreed. In those cases, we lean on the signals that are hardest to fake: renewal status, support volume, and whatever objective firmographics you do have. We also surface “confidence” in the score—if the drivers are based on thin data, you’ll see it.",
      "link": "https://www.onyx.app/5225117-23"
    },
    {
      "text": "Jerry Dean: Okay. But here’s where I’m stuck. Even if you give us a fit score and driver breakdown, how does that turn into a decision? We still have to convince leadership. And frankly, we’re in budget season—anything new is scrutinized.",
      "link": "https://www.onyx.app/5225117-24"
    },
    {
      "text": "Arjun Mehta: Totally. Let me ask directly: what would you need to see to move this to buying? Is it proof it will change roadmap decisions, or proof it will reduce churn, or something else?",
      "link": "https://www.onyx.app/5225117-25"
    },
    {
      "text": "Jerry Dean: It’d have to show that we can actually get alignment across teams. And I’m not sure software solves that. Also, I don’t own the budget. That’s part of the issue.",
      "link": "https://www.onyx.app/5225117-26"
    },
    {
      "text": "Arjun Mehta: Who does? If we can get them into a quick readout after the pilot, we can tie results to business value—better segment focus, fewer wasted roadmap bets, lower churn risk. Would your VP Product or RevOps be the right person?",
      "link": "https://www.onyx.app/5225117-27"
    },
    {
      "text": "Jerry Dean: VP Product is involved, but she’s skeptical of “scoring.” RevOps is swamped and won’t prioritize another tool integration right now.",
      "link": "https://www.onyx.app/5225117-28"
    },
    {
      "text": "Arjun Mehta: If RevOps bandwidth is the bottleneck, we can do exports instead of full integration for the pilot. That reduces lift.",
      "link": "https://www.onyx.app/5225117-29"
    },
    {
      "text": "Jerry Dean: Exports might be possible, but then we’re back to the “messy data” problem. And my VP is going to ask why we can’t do this in a spreadsheet with our BI team.",
      "link": "https://www.onyx.app/5225117-30"
    },
    {
      "text": "Arjun Mehta: You can do some of it in BI, but it’s usually expensive in analyst time and doesn’t stay current. Customer_Analyzer keeps the fit score updated and makes the driver breakdown accessible to non-analysts. The ongoing value is consistency.",
      "link": "https://www.onyx.app/5225117-31"
    },
    {
      "text": "Jerry Dean: I hear you. But I don’t think I can sell “consistency” right now. We’re under pressure to cut tools, not add them. And the internal disagreement you’re describing—honestly, it’s not something we’ve solved with dashboards.",
      "link": "https://www.onyx.app/5225117-32"
    },
    {
      "text": "Arjun Mehta: That’s fair. If adding a tool is a hard no right now, we can pause. Before we do, is there any scenario where a small pilot—say limited to product planning—could be funded as a one-time evaluation?",
      "link": "https://www.onyx.app/5225117-33"
    },
    {
      "text": "Jerry Dean: Not this quarter. Maybe later in the year. Right now we’re locked. Also, I don’t want to pull data and then have it go nowhere. That’s a bad look internally.",
      "link": "https://www.onyx.app/5225117-34"
    },
    {
      "text": "Arjun Mehta: Understood. Would it be helpful if I sent a one-page outline of a pilot plan and the specific data fields we’d need, so when timing opens up you’re not starting from scratch?",
      "link": "https://www.onyx.app/5225117-35"
    },
    {
      "text": "Jerry Dean: You can send it, sure. But I’m not committing to anything. And I’d rather not schedule another meeting until I know budgets are loosening.",
      "link": "https://www.onyx.app/5225117-36"
    },
    {
      "text": "Arjun Mehta: Completely fine. I’ll send a concise pilot brief—focus on fit estimation, driver breakdown, and a segment comparison tied to product planning decisions. If you’re open to it, I can also include a way to handle stakeholder disagreement—basically a lightweight decision framework around drivers and outcomes.",
      "link": "https://www.onyx.app/5225117-37"
    },
    {
      "text": "Jerry Dean: Send it over. I’ll skim it. Just keep in mind: if this requires cross-team alignment work, that’s where we usually stall.",
      "link": "https://www.onyx.app/5225117-38"
    },
    {
      "text": "Arjun Mehta: Got it. I’ll keep it practical and minimal lift. Thanks, Jerry—appreciate the candor. I’ll follow up by email today, and you can tell me if it’s worth revisiting later this year.",
      "link": "https://www.onyx.app/5225117-39"
    },
    {
      "text": "Jerry Dean: Sounds good. Thanks, Arjun.",
      "link": "https://www.onyx.app/5225117-40"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "arjun_mehta@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "jerry_dean@inland_crest_packaging.onyx.app"
    }
  ]
}