{
  "id": "FIREFLIES_5569572",
  "semantic_identifier": "5569572 - Frostline Commerce - sales_pitch - Discussion with Wayne Barrett",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-12-10 00:00:00",
  "metadata": {
    "meeting_date": "2025-12-10 00:00:00",
    "duration_min": "41"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-12"
      ],
      "year_month": "2025-12",
      "meeting_title": "5569572 - Frostline Commerce - sales_pitch - Discussion with Wayne Barrett",
      "organizer_email": "megan_foster@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Megan Foster: Hi Wayne, it’s Megan Foster. Thanks for taking a few minutes—did I catch you at an okay time?",
      "link": "https://www.onyx.app/9787517-1"
    },
    {
      "text": "Wayne Barrett: Yeah, I’ve got a few minutes. What’s up?",
      "link": "https://www.onyx.app/9787517-2"
    },
    {
      "text": "Megan Foster: Appreciate it. I work with teams that are drowning in customer issues spread across Zendesk, Intercom, emails, and internal notes—and the problem is it all stays fragmented, so product and engineering only see a noisy, incomplete picture. The product I wanted to quickly introduce is Issue_Tracker. It sits between your support channels and your delivery tools like Jira or Linear, and it turns raw tickets and messages into deduped “issue clusters” with clear evidence and impacted customer lists.",
      "link": "https://www.onyx.app/9787517-3"
    },
    {
      "text": "Wayne Barrett: Okay. We already use Zendesk and Jira. Support tags stuff, and we have a weekly triage. What would this replace?",
      "link": "https://www.onyx.app/9787517-4"
    },
    {
      "text": "Megan Foster: It wouldn’t replace Zendesk or Jira. Think of it as a triage and intelligence layer that standardizes the “issue object”—the theme, suspected root cause, examples, and who’s impacted—then links it back to the original Zendesk conversations and forward to the Jira work. The core feature is issue clustering: it automatically groups related tickets, chats, and even call note summaries into one cluster, suggests a name, pulls top phrases, and gives you a merge/split workflow so you can clean it up without losing the audit trail.",
      "link": "https://www.onyx.app/9787517-5"
    },
    {
      "text": "Wayne Barrett: We have macros, tags, and some automations. Clustering sounds like AI doing what our support leads do manually.",
      "link": "https://www.onyx.app/9787517-6"
    },
    {
      "text": "Megan Foster: That’s fair. The difference is scale and consistency. A typical support ops use case is taking something like 5,000 monthly tickets and collapsing it into ~80 active themes—then routing the top 10 clusters to product/engineering weekly with representative examples and the list of affected customers. Instead of “we saw a few reports,” you can say “this cluster has 143 tickets in two weeks, affects Enterprise customers, likely root cause is integration, and here are the top examples.”",
      "link": "https://www.onyx.app/9787517-7"
    },
    {
      "text": "Wayne Barrett: I get the concept, but we’re not at 5,000 tickets a month. And we already meet weekly with engineering.",
      "link": "https://www.onyx.app/9787517-8"
    },
    {
      "text": "Megan Foster: Totally—ticket volume varies a lot by org. Where it still tends to help even at lower volumes is deduping the long tail and making trends visible earlier. Often the same issue shows up as slightly different tickets across different categories, and teams underestimate how widespread it is until it turns into an escalation. With clustering, you get that roll-up automatically, plus the searchable history of “what decision was made, when, and why,” tied to source conversations.",
      "link": "https://www.onyx.app/9787517-9"
    },
    {
      "text": "Wayne Barrett: We can search Zendesk and Jira already. I’m trying to understand what I’d actually do differently week to week.",
      "link": "https://www.onyx.app/9787517-10"
    },
    {
      "text": "Megan Foster: Week to week, instead of reviewing a tag report and a pile of “top tickets,” you’d review the top clusters—already deduped—with severity signals and customer impact. Then you can route the top clusters to product/engineering with the evidence packaged up: examples, top phrases, affected accounts, and links back to the originals. Support ops spends less time consolidating, and product gets cleaner input.",
      "link": "https://www.onyx.app/9787517-11"
    },
    {
      "text": "Wayne Barrett: Who typically owns it? Support? Product? Because if it’s another system, it becomes one more place people don’t check.",
      "link": "https://www.onyx.app/9787517-12"
    },
    {
      "text": "Megan Foster: Great question—usually Support Ops or a Support lead is the day-to-day owner, with Product as a key consumer. The reason it sticks is the workflow: support continues working in Zendesk; engineering continues working in Jira; Issue_Tracker is the connective tissue and the place the “issue clusters” live. But it does require someone to own the merge/split and keep the clusters tidy, at least lightly.",
      "link": "https://www.onyx.app/9787517-13"
    },
    {
      "text": "Wayne Barrett: That’s kind of my concern. We’re lean, and “lightly” tends to become “another weekly chore.” Also, our tagging is pretty mature.",
      "link": "https://www.onyx.app/9787517-14"
    },
    {
      "text": "Megan Foster: If your tagging is mature, you’re ahead of most teams. The clustering can still leverage your existing metadata—product area, severity, keywords—so it’s not throwing that work away. It uses semantic similarity plus configurable rules. But I hear you: if your process is already working and you don’t have a lot of noise, the ROI might be harder to justify.",
      "link": "https://www.onyx.app/9787517-15"
    },
    {
      "text": "Wayne Barrett: Yeah. Also, security-wise, we’re cautious about piping customer conversations into another platform. We’ve been told “AI” solutions, and then it’s a whole procurement thing.",
      "link": "https://www.onyx.app/9787517-16"
    },
    {
      "text": "Megan Foster: Understood. We do run into that. We can share our security posture and how data is handled, and we integrate rather than scrape. But if procurement is a heavy lift and the pain isn’t acute, it may not be the best time.",
      "link": "https://www.onyx.app/9787517-17"
    },
    {
      "text": "Wayne Barrett: Exactly. Right now we’re focused on a replatform project, so adding tooling isn’t on our list this quarter.",
      "link": "https://www.onyx.app/9787517-18"
    },
    {
      "text": "Megan Foster: That makes sense. Before I let you go, just to sanity-check: do you ever have the situation where multiple tickets are really the same root issue, but they’re split across different categories or phrased differently, so it’s hard to quantify impact?",
      "link": "https://www.onyx.app/9787517-19"
    },
    {
      "text": "Wayne Barrett: Sometimes, sure. But we usually catch the big ones through escalations or our CSMs. It’s not perfect, but it’s okay.",
      "link": "https://www.onyx.app/9787517-20"
    },
    {
      "text": "Megan Foster: Got it. Given your replatform focus, I don’t want to push a full evaluation. The main reason I reached out was that teams often don’t realize how much triage time is going into deduping and how many issues are hidden in plain sight until something blows up. But if “okay” is good enough right now, totally fair.",
      "link": "https://www.onyx.app/9787517-21"
    },
    {
      "text": "Wayne Barrett: Yeah, I appreciate the overview, but I don’t think we’re going to take a deeper call at the moment.",
      "link": "https://www.onyx.app/9787517-22"
    },
    {
      "text": "Megan Foster: No problem at all. Would it be useful if I sent a one-pager that summarizes the clustering workflow and that support ops use case—5,000 tickets into ~80 themes—just so you have it on hand if priorities shift?",
      "link": "https://www.onyx.app/9787517-23"
    },
    {
      "text": "Wayne Barrett: Sure, you can send it. I can take a look when I have time.",
      "link": "https://www.onyx.app/9787517-24"
    },
    {
      "text": "Megan Foster: Perfect. I’ll email it over. And if, after the replatform, you find the weekly triage is getting noisy or you’re spending too much time consolidating duplicates, we can revisit. Thanks again for the time, Wayne.",
      "link": "https://www.onyx.app/9787517-25"
    },
    {
      "text": "Wayne Barrett: Sounds good. Thanks, Megan.",
      "link": "https://www.onyx.app/9787517-26"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "megan_foster@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "wayne_barrett@frostline_commerce.onyx.app"
    }
  ]
}