{
  "id": "FIREFLIES_5916692",
  "semantic_identifier": "5916692 - Velvetcompass Travel - sales_call - Discussion with Oscar Montgomery",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-12-18 00:00:00",
  "metadata": {
    "meeting_date": "2025-12-18 00:00:00",
    "duration_min": "35"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-12"
      ],
      "year_month": "2025-12",
      "meeting_title": "5916692 - Velvetcompass Travel - sales_call - Discussion with Oscar Montgomery",
      "organizer_email": "james_choi@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "James Choi: Hi Oscar—good to see you again. Last time you mentioned your SDR team is already using Customer_Analyzer fit tiers to guide outbound, but it’s still hard to keep reps focused day-to-day and to predict where the quarter lands. Today I wanted to show how Sales_Accelerator takes those fit tiers and turns them into a forecast you can trust plus very specific next actions—so you can get to “we know what to do next and what we’re closing” instead of a scramble in the last two weeks. Sound good?",
      "link": "https://www.onyx.app/1938309-1"
    },
    {
      "text": "Oscar Montgomery: Yeah, that’s exactly it. The fit tiers help, but execution is inconsistent, and our forecast is… optimistic. If you can connect the dots between prioritization and forecast without adding a bunch of overhead, I’m interested.",
      "link": "https://www.onyx.app/1938309-2"
    },
    {
      "text": "James Choi: Perfect. I’ll focus on one core capability: the sales_forecast. Sales_Accelerator sits on top of your CRM—so we’re not replacing Salesforce, we’re reading it—and we blend stage data with activity signals like emails, calls, meetings, plus cycle-time benchmarks. Optionally, we weight opportunities by Customer_Analyzer fit score, so a Tier 1 account with strong engagement carries more confidence than a Tier 3 deal sitting in the same stage.",
      "link": "https://www.onyx.app/1938309-3"
    },
    {
      "text": "Oscar Montgomery: Okay. We’ve tried forecasting tools before. The issue is always the inputs—our stages go stale, close dates drift, and reps don’t always log next steps. Then the tool spams us with alerts that aren’t real.",
      "link": "https://www.onyx.app/1938309-4"
    },
    {
      "text": "James Choi: That’s a fair callout, and it’s exactly the failure mode we design around. Two things. First, our forecast is explainable: every change is driven by visible factors—stage age, last touch, whether there’s a next meeting scheduled, historical win rate for similar deals, and fit tier. So when something looks off, you can see why it’s off. Second, we can set guardrails to reduce noise: for example, only trigger “deal at risk” when a deal is past the normal stage age *and* there’s no future meeting *and* activity has dropped, instead of firing on a single missing field.",
      "link": "https://www.onyx.app/1938309-5"
    },
    {
      "text": "Oscar Montgomery: The explainable part helps. But I still worry it becomes a CRM policing system. My managers don’t want to spend their week chasing data cleanup.",
      "link": "https://www.onyx.app/1938309-6"
    },
    {
      "text": "James Choi: Totally. The goal isn’t “perfect CRM,” it’s “minimum viable hygiene for accurate forecasting.” We usually start with a light baseline: required next step on opportunities in commit, close date within a range, and stage age thresholds. Sales_Accelerator highlights exceptions so managers can focus on the 10 deals that materially impact the number, not 200 records. And because it’s tied to forecast impact, reps tend to comply faster—it’s not arbitrary admin.",
      "link": "https://www.onyx.app/1938309-7"
    },
    {
      "text": "Oscar Montgomery: Got it. How does this tie back to outbound? Because my SDR lead will ask, “Is this just for AEs and managers?”",
      "link": "https://www.onyx.app/1938309-8"
    },
    {
      "text": "James Choi: Great question—and it’s actually where you’ll see immediate lift. Since you already have Customer_Analyzer fit tiers, we pull those into Sales_Accelerator. Then for SDRs, it recommends the next set of accounts to contact—think “next 50 accounts” based on fit tier plus recent engagement signals—and provides segment-aligned openers and proof points. That means SDR activity becomes more consistent and more measurable, and it feeds the forecast with cleaner activity signals earlier in the cycle.",
      "link": "https://www.onyx.app/1938309-9"
    },
    {
      "text": "Oscar Montgomery: So the SDR guidance and the forecast are connected through the same signals.",
      "link": "https://www.onyx.app/1938309-10"
    },
    {
      "text": "James Choi: Exactly. You get a closed loop: fit tier drives who to contact and how to message; activity and meetings drive opportunity momentum; momentum and stage benchmarks drive forecast confidence. Then managers can see, “If we add 20 SQLs in Tier 1, what’s the expected impact?” That scenario planning is built in.",
      "link": "https://www.onyx.app/1938309-11"
    },
    {
      "text": "Oscar Montgomery: That scenario planning is interesting. We do that today in spreadsheets, but it’s hand-wavy. What’s the setup like? I’m trying to picture how long before we trust it.",
      "link": "https://www.onyx.app/1938309-12"
    },
    {
      "text": "James Choi: Typical rollout is measured in weeks, not months. Week one is connecting Salesforce and mapping a few key fields. Week two is calibrating your stage benchmarks—cycle times by segment, rep, source—and turning on the forecast views: commit/best-case/pipeline. We usually recommend a 30-day “parallel run” where you compare Sales_Accelerator’s forecast to your current method so everyone builds confidence before it becomes the official number.",
      "link": "https://www.onyx.app/1938309-13"
    },
    {
      "text": "Oscar Montgomery: And during that parallel run, if our data is messy, does it just fall apart?",
      "link": "https://www.onyx.app/1938309-14"
    },
    {
      "text": "James Choi: It won’t fall apart, but it will surface where messiness is affecting confidence. For example, if close dates are constantly pushed, you’ll see slippage diagnostics showing that pattern and which segments are most affected. If stages are stale, you’ll see a cluster of deals with high stage age and low activity. The point is it turns the vague “our CRM is messy” into specific, fixable behaviors tied to revenue impact.",
      "link": "https://www.onyx.app/1938309-15"
    },
    {
      "text": "Oscar Montgomery: That’s helpful. But I still want to avoid alert fatigue. My team already ignores half the “at risk” flags in tools we have.",
      "link": "https://www.onyx.app/1938309-16"
    },
    {
      "text": "James Choi: 100%. We handle that with thresholds and audience targeting. SDRs don’t need deal-risk alerts; they need “next accounts to contact.” AEs get a short list of opportunities with the clearest risk drivers—like no next meeting scheduled plus inactivity—and managers get rollups, not pings. And we tune sensitivity early: we’d rather start conservative and expand once the team trusts the signal.",
      "link": "https://www.onyx.app/1938309-17"
    },
    {
      "text": "Oscar Montgomery: Makes sense. If we did this, what would you need from us to get started?",
      "link": "https://www.onyx.app/1938309-18"
    },
    {
      "text": "James Choi: I’d propose a very specific pilot at Velvetcompass Travel: one SDR pod and one AE team—say 8–10 users—focused on your Tier 1 and Tier 2 Customer_Analyzer segments. Success criteria: (1) forecast accuracy improves versus your baseline in the parallel run, and (2) SDRs follow the recommended account list and hit a measurable lift in meetings booked or reply rate. To do that, we’d need a Salesforce admin for the connector, your current stage definitions, and agreement on a few “must-have” fields for commit deals: next step, close date, and stage.",
      "link": "https://www.onyx.app/1938309-19"
    },
    {
      "text": "Oscar Montgomery: That’s reasonable. I can get you our Salesforce admin for an hour. The stage definitions are pretty standard. The “must-have fields” might get some pushback, but if it’s limited to commit deals, that’s manageable.",
      "link": "https://www.onyx.app/1938309-20"
    },
    {
      "text": "James Choi: Great—keeping it to commit deals is the right compromise. On pricing and procurement: if the pilot hits the criteria, are you in a position to move to purchase this quarter?",
      "link": "https://www.onyx.app/1938309-21"
    },
    {
      "text": "Oscar Montgomery: Yes. We have budget allocated for sales ops tooling this quarter, and I can sponsor it if we can show the forecast improvement and the SDR execution piece. I just need the pilot to be tight and not disruptive.",
      "link": "https://www.onyx.app/1938309-22"
    },
    {
      "text": "James Choi: Perfect. Then here’s what I suggest as next steps: I’ll send a one-page pilot plan today—scope, timeline, success metrics, and the minimal data requirements. Then we schedule a 45-minute technical kickoff with your Salesforce admin and your SDR lead. If we start next week, we can have the parallel forecast running within two weeks and have enough signal by week four to make a buying decision.",
      "link": "https://www.onyx.app/1938309-23"
    },
    {
      "text": "Oscar Montgomery: That timeline works. Send the plan, and I’ll connect you with our admin and SDR lead. One more thing—can you include in the plan how you’ll prevent the alert fatigue we talked about? That’s the one thing I’ll get questioned on internally.",
      "link": "https://www.onyx.app/1938309-24"
    },
    {
      "text": "James Choi: Absolutely. I’ll outline the alert policy by role, the conservative thresholds we start with, and how we’ll tune after week one based on false positives. I’ll also include a quick “data hygiene minimum” section so it’s clear we’re not asking for a CRM overhaul.",
      "link": "https://www.onyx.app/1938309-25"
    },
    {
      "text": "Oscar Montgomery: Good. If you can keep it minimal and show the explainable drivers, I think we’re in a strong spot.",
      "link": "https://www.onyx.app/1938309-26"
    },
    {
      "text": "James Choi: Great—I'll get that over in the next couple hours. Thanks Oscar. Once you introduce me to the admin and SDR lead, we’ll lock dates and get moving.",
      "link": "https://www.onyx.app/1938309-27"
    },
    {
      "text": "Oscar Montgomery: Sounds good, James. Talk soon.",
      "link": "https://www.onyx.app/1938309-28"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "james_choi@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "oscar_montgomery@velvetcompass_travel.onyx.app"
    }
  ]
}