{
  "id": "FIREFLIES_7151961",
  "semantic_identifier": "7151961 - Truenorth Circuits - sales_pitch - Discussion with Emma Fowler",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-12-11 00:00:00",
  "metadata": {
    "meeting_date": "2025-12-11 00:00:00",
    "duration_min": "43"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-12"
      ],
      "year_month": "2025-12",
      "meeting_title": "7151961 - Truenorth Circuits - sales_pitch - Discussion with Emma Fowler",
      "organizer_email": "mina_park@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Mina Park: Hi Emma—Mina Park here. Thanks for taking a few minutes. I’ll keep this quick. I work with teams that are getting swamped by customer issues coming in from Zendesk/Intercom, then getting re-triaged again in Jira, and the same “issue” shows up in twenty different ways. Does that sound familiar at Truenorth Circuits?",
      "link": "https://www.onyx.app/4173458-1"
    },
    {
      "text": "Emma Fowler: Hi Mina. Yeah, we definitely have a lot of incoming, but we already have a process. We use Zendesk and Jira and our CSMs track key accounts pretty closely.",
      "link": "https://www.onyx.app/4173458-2"
    },
    {
      "text": "Mina Park: Totally—most teams do. The gap we see is not “having tools,” it’s having a consistent issue object across tools: one theme/root cause with evidence, impacted customers, and a clear status that doesn’t get lost between support, product, and CS. Our product, Issue_Tracker, sits between Zendesk/Intercom and Jira/Linear and continuously ingests the raw tickets/chats/email summaries, then automatically deduplicates and clusters them into issue themes.",
      "link": "https://www.onyx.app/4173458-3"
    },
    {
      "text": "Emma Fowler: Okay. We actually do a lot of manual tagging and we have some macros and views for that. I’m not sure we need another layer in between.",
      "link": "https://www.onyx.app/4173458-4"
    },
    {
      "text": "Mina Park: That makes sense. The two areas where teams usually feel relief quickly are, first, issue clustering—so instead of 40 separate tickets with slightly different wording, you get one cluster with top phrases, representative examples, and links back to every source record. And second, a lightweight workflow to merge/split clusters with guardrails, so it stays accurate without becoming a full-time job.",
      "link": "https://www.onyx.app/4173458-5"
    },
    {
      "text": "Emma Fowler: The concern is always: clustering sounds nice, but we already have categories and labels. Also, AI grouping can be messy, and my team doesn’t have time to babysit it.",
      "link": "https://www.onyx.app/4173458-6"
    },
    {
      "text": "Mina Park: Completely fair. The reason customers like the clustering is it’s not just labels; it’s semantic similarity plus configurable rules—like product area, platform, severity, and keywords—so you can keep it constrained to how Truenorth thinks about the product. And the output is something actionable: “here’s the cluster, here are the top examples, here are the impacted accounts,” rather than just another tag field.",
      "link": "https://www.onyx.app/4173458-7"
    },
    {
      "text": "Emma Fowler: We’d still need to see whether it really saves time. Right now, support triages, then product reviews weekly, and CSMs follow up when there’s something notable. It’s not perfect, but it works.",
      "link": "https://www.onyx.app/4173458-8"
    },
    {
      "text": "Mina Park: If it’s working, I don’t want to disrupt it. The use case I wanted to sanity-check is specifically around consistent follow-up. For CSMs, Issue_Tracker lets you subscribe accounts to relevant clusters. When the linked Jira ticket ships, we record the release milestone and create a history trail of which customers were notified and when—so you’re not searching through old threads or relying on someone’s spreadsheet.",
      "link": "https://www.onyx.app/4173458-9"
    },
    {
      "text": "Emma Fowler: We do have a spreadsheet for follow-ups, and honestly it’s annoying, but it’s also simple. My bigger issue is change management. If I add another system, support has to learn it, CS has to learn it, product has to trust it, and engineering will ignore it.",
      "link": "https://www.onyx.app/4173458-10"
    },
    {
      "text": "Mina Park: That’s a common fear. The way we try to avoid “another system” is: Zendesk stays Zendesk, Jira stays Jira. We link back to the source conversations and downstream engineering work. The idea is you don’t have to change where people live day-to-day—Issue_Tracker becomes the shared layer where the issue cluster lives and stays consistent.",
      "link": "https://www.onyx.app/4173458-11"
    },
    {
      "text": "Emma Fowler: Integration is always the sticking point. We’ve been burned by tools that promise “plug in Zendesk and Jira” and then it’s weeks of configuration and permissions and cleanup.",
      "link": "https://www.onyx.app/4173458-12"
    },
    {
      "text": "Mina Park: Understood. I’m not going to claim it’s zero effort. But in many setups, the initial value comes from just connecting the support source and creating clusters—no need to rebuild workflows. We can start small: one product area, one or two queues, see if clustering reduces duplicate triage and makes volume/trends visible.",
      "link": "https://www.onyx.app/4173458-13"
    },
    {
      "text": "Emma Fowler: Even starting small means I need someone to own it. And candidly, we’re in a busy quarter—my bandwidth for pilots is near zero.",
      "link": "https://www.onyx.app/4173458-14"
    },
    {
      "text": "Mina Park: That’s helpful to know. Let me ask one quick question to see if there’s a pain worth revisiting later: do you ever have situations where a “widespread problem” is underestimated because it’s scattered across many tickets and channels, so it doesn’t look big until it’s too late?",
      "link": "https://www.onyx.app/4173458-15"
    },
    {
      "text": "Emma Fowler: Sure, that happens. But we usually catch it in our weekly reviews or when a couple big customers complain loudly. It’s not ideal, but it’s not our top priority right now.",
      "link": "https://www.onyx.app/4173458-16"
    },
    {
      "text": "Mina Park: Got it. And on the follow-up side—do CSMs ever miss notifying a customer when a fix ships, because the Jira ticket status changes but nobody ties it back to the right accounts?",
      "link": "https://www.onyx.app/4173458-17"
    },
    {
      "text": "Emma Fowler: Occasionally, yes. But again, we manage it. We have internal notes, and our CSMs are on top of their accounts. I’m not convinced we need dedicated software for that.",
      "link": "https://www.onyx.app/4173458-18"
    },
    {
      "text": "Mina Park: Fair. My goal today wasn’t to force it—just to see if it’s worth a deeper look. If we did a 30-minute walkthrough, I’d show you two things: how clusters are formed from your existing Zendesk inputs, and how account subscriptions and release milestones create an audit trail for customer comms.",
      "link": "https://www.onyx.app/4173458-19"
    },
    {
      "text": "Emma Fowler: I appreciate it, Mina, but I’m going to be honest: I don’t think I can commit to another evaluation right now. We’re already reviewing a couple tools and my leadership wants us to focus.",
      "link": "https://www.onyx.app/4173458-20"
    },
    {
      "text": "Mina Park: I respect that. Would it be okay if I sent a one-pager that summarizes the clustering and the CSM follow-up history trail, and then I check back in, say, next quarter when things calm down?",
      "link": "https://www.onyx.app/4173458-21"
    },
    {
      "text": "Emma Fowler: Yes, a one-pager is fine. But I can’t promise timing. If you send it, I’ll skim it, and if it becomes more urgent we can reach out.",
      "link": "https://www.onyx.app/4173458-22"
    },
    {
      "text": "Mina Park: That works. Last thing—so I tailor the summary: are you more interested in the “dedupe/issue trends” angle for support/product, or the “CSM follow-up and notification history” angle for CS?",
      "link": "https://www.onyx.app/4173458-23"
    },
    {
      "text": "Emma Fowler: Probably the issue trends piece, but again, it’s not something we’re acting on immediately.",
      "link": "https://www.onyx.app/4173458-24"
    },
    {
      "text": "Mina Park: Perfect. I’ll send a short overview focused on issue clustering—how it dedupes, surfaces volume, and keeps links back to Zendesk and Jira—plus a quick note on the follow-up history trail. Thanks for being direct, Emma.",
      "link": "https://www.onyx.app/4173458-25"
    },
    {
      "text": "Emma Fowler: No problem. Thanks for keeping it short.",
      "link": "https://www.onyx.app/4173458-26"
    },
    {
      "text": "Mina Park: Of course. I’ll email that over today. Have a good rest of your week.",
      "link": "https://www.onyx.app/4173458-27"
    },
    {
      "text": "Emma Fowler: You too.",
      "link": "https://www.onyx.app/4173458-28"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mina_park@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "emma_fowler@truenorth_circuits.onyx.app"
    }
  ]
}