{
  "id": "FIREFLIES_7346242",
  "semantic_identifier": "7346242 - Lucid Grove Studios - sales_pitch - Discussion with Ava Jacobs",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-12-08 00:00:00",
  "metadata": {
    "meeting_date": "2025-12-08 00:00:00",
    "duration_min": "37"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-12"
      ],
      "year_month": "2025-12",
      "meeting_title": "7346242 - Lucid Grove Studios - sales_pitch - Discussion with Ava Jacobs",
      "organizer_email": "mina_park@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Mina Park: Hi Ava—Mina Park here. Thanks for taking a few minutes. I’ll be brief. I work with teams who are trying to get sharper on which customer segments are actually the best fit, and then turning that into messaging that helps win more deals. Does that match anything you’re focused on at Lucid Grove Studios right now?",
      "link": "https://www.onyx.app/9430168-1"
    },
    {
      "text": "Ava Jacobs: Hi Mina. Sort of, but I’m about to jump to another meeting. What is this in one sentence?",
      "link": "https://www.onyx.app/9430168-2"
    },
    {
      "text": "Mina Park: Totally—Customer_Analyzer is a SaaS tool that pulls signals you already have—CRM fields, product usage, support tickets, onboarding surveys—and gives you a fit score by segment, plus a plain-English breakdown of why a segment is a good or bad fit, so you can prioritize who to target next quarter.",
      "link": "https://www.onyx.app/9430168-3"
    },
    {
      "text": "Ava Jacobs: Okay. We already have dashboards for a lot of that. What’s different?",
      "link": "https://www.onyx.app/9430168-4"
    },
    {
      "text": "Mina Park: Great question. Dashboards show activity; they don’t usually answer “who is most likely to buy, succeed, renew, and expand” in a consistent, comparable way. The key feature is fit_estimation: you define fit drivers—industry, size, problem severity, time-to-value, adoption patterns, support burden, churn-risk signals—and we compute a 0–100 fit score at the account and segment level, with a driver breakdown. So instead of debating “healthcare feels good,” you can see “healthcare is 82 because retention is high and support burden is low; agencies are 55 because time-to-value is slower and churn risk is higher.”",
      "link": "https://www.onyx.app/9430168-5"
    },
    {
      "text": "Ava Jacobs: We’re not really struggling with that level of detail. We’re a studio—our segments are a bit all over the place.",
      "link": "https://www.onyx.app/9430168-6"
    },
    {
      "text": "Mina Park: That’s actually when this helps most—when the segments are messy and the team is operating on anecdotes. One common use case is prioritizing which industries to target next quarter using retention and support burden signals. For example, if one industry keeps renewing but generates heavy support load, it might not be the best segment to scale. Or the opposite: a smaller segment might look quiet in volume but has great retention, fast adoption, and low support burden—meaning you can grow it profitably.",
      "link": "https://www.onyx.app/9430168-7"
    },
    {
      "text": "Ava Jacobs: I hear you. But we don’t have clean data. Support tickets are in one system, CRM is half-filled, product usage is… inconsistent.",
      "link": "https://www.onyx.app/9430168-8"
    },
    {
      "text": "Mina Park: That’s very normal. We don’t require perfection to start. The model can begin with whatever you trust—say CRM firmographics and basic retention—and then layer in other signals as you connect them. Even with partial data, the output is still useful because it forces a consistent definition of fit drivers and shows the “why” behind the score. And if a driver is missing or low confidence, it’s flagged rather than silently skewing results.",
      "link": "https://www.onyx.app/9430168-9"
    },
    {
      "text": "Ava Jacobs: We’re also in the middle of a bunch of launches. I’m not sure we can take on another tool right now.",
      "link": "https://www.onyx.app/9430168-10"
    },
    {
      "text": "Mina Park: Understood. My goal today isn’t to sell you on a big rollout—just to see if it’s worth a deeper look. Typically the first step is a short working session where we map 5–7 fit drivers you already agree on, then we run a quick segment comparison—like SMB vs mid-market, or industry A vs industry B—based on retention and support burden. That usually takes a couple weeks end-to-end, and the output is a recommended ICP profile and a segment ranking you can actually use in planning.",
      "link": "https://www.onyx.app/9430168-11"
    },
    {
      "text": "Ava Jacobs: We already decided our next quarter targets. So it’s probably too late.",
      "link": "https://www.onyx.app/9430168-12"
    },
    {
      "text": "Mina Park: If targets are locked, one alternative is using it to sanity-check the plan and reduce churn risk—spot segments that look good on pipeline but historically have low adoption or high support burden. Even if you don’t change the target, it can influence positioning—what proof points to lead with, which objections to preempt, and what “good fit” looks like for qualification.",
      "link": "https://www.onyx.app/9430168-13"
    },
    {
      "text": "Ava Jacobs: Positioning is mostly handled by our marketing lead. I’m not the right owner.",
      "link": "https://www.onyx.app/9430168-14"
    },
    {
      "text": "Mina Park: That makes sense. Who typically owns decisions around ICP and segment focus—marketing lead, sales ops, product marketing?",
      "link": "https://www.onyx.app/9430168-15"
    },
    {
      "text": "Ava Jacobs: It’s kind of shared. But honestly, we’re not shopping for new software. Budget is tight.",
      "link": "https://www.onyx.app/9430168-16"
    },
    {
      "text": "Mina Park: I hear you. If budget and timing are constraints, the only reason to keep talking would be if you felt there’s a clear cost today—like wasted spend targeting segments that churn, or high-support customers dragging margin—that’s worth addressing. Are you seeing any pain around support burden in particular? Like certain types of customers taking disproportionate effort?",
      "link": "https://www.onyx.app/9430168-17"
    },
    {
      "text": "Ava Jacobs: Support is annoying, yes, but we’re a services-heavy business. It’s just part of it. And our churn isn’t terrible.",
      "link": "https://www.onyx.app/9430168-18"
    },
    {
      "text": "Mina Park: Got it. Then let me keep it very concrete: if you could press a button and see a ranked list of your customer segments with (1) a fit score, and (2) the top three drivers—retention, support burden, time-to-value—would that be useful for planning? Or would it just be “interesting”?",
      "link": "https://www.onyx.app/9430168-19"
    },
    {
      "text": "Ava Jacobs: Probably interesting, but not something I can prioritize. And I’m wary of “AI scoring” without a lot of time to validate it.",
      "link": "https://www.onyx.app/9430168-20"
    },
    {
      "text": "Mina Park: Fair concern. The scoring isn’t a black box—it’s driver-based and transparent. You choose the drivers and weights, and we show the breakdown. Still, validation takes attention, and if you don’t have that bandwidth, it may not be the right moment.",
      "link": "https://www.onyx.app/9430168-21"
    },
    {
      "text": "Ava Jacobs: Yeah, I think that’s where we are. We’re heads-down.",
      "link": "https://www.onyx.app/9430168-22"
    },
    {
      "text": "Mina Park: Totally respect that. Would it be helpful if I sent a one-pager with the fit_estimation concept and the specific “prioritize industries using retention + support burden” workflow, so if planning comes up later you can forward it internally?",
      "link": "https://www.onyx.app/9430168-23"
    },
    {
      "text": "Ava Jacobs: Sure, you can send it. No promises.",
      "link": "https://www.onyx.app/9430168-24"
    },
    {
      "text": "Mina Park: That’s perfect. What’s the best email for you, and should I copy your marketing lead or whoever owns ICP discussions?",
      "link": "https://www.onyx.app/9430168-25"
    },
    {
      "text": "Ava Jacobs: Send it to ava@lucidgrove.com. Don’t CC anyone—I’ll decide.",
      "link": "https://www.onyx.app/9430168-26"
    },
    {
      "text": "Mina Park: Will do. Last quick question so I tailor it: when you think about next quarter, are you more concerned about improving conversion on new deals, or reducing churn/support load on existing customers?",
      "link": "https://www.onyx.app/9430168-27"
    },
    {
      "text": "Ava Jacobs: Conversion, mostly. But again, we’re not evaluating tools right now.",
      "link": "https://www.onyx.app/9430168-28"
    },
    {
      "text": "Mina Park: Understood. I’ll send a brief note focused on segment fit scoring for conversion—who to target and why—without asking you for a meeting. If in a month or two you want to pressure-test your target segments, we can set up a 20-minute working session then. Sound okay?",
      "link": "https://www.onyx.app/9430168-29"
    },
    {
      "text": "Ava Jacobs: That’s fine. I need to run.",
      "link": "https://www.onyx.app/9430168-30"
    },
    {
      "text": "Mina Park: Thanks, Ava. Appreciate the time—I’ll email that over today. Have a good one.",
      "link": "https://www.onyx.app/9430168-31"
    },
    {
      "text": "Ava Jacobs: You too. Bye.",
      "link": "https://www.onyx.app/9430168-32"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mina_park@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "ava_jacobs@lucid_grove_studios.onyx.app"
    }
  ]
}