{
  "id": "FIREFLIES_7589514",
  "semantic_identifier": "7589514 - Opalgate Enterprises - sales_pitch - Discussion with Aria Daniels",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-12-13 00:00:00",
  "metadata": {
    "meeting_date": "2025-12-13 00:00:00",
    "duration_min": "29"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-12"
      ],
      "year_month": "2025-12",
      "meeting_title": "7589514 - Opalgate Enterprises - sales_pitch - Discussion with Aria Daniels",
      "organizer_email": "sneha_reddy@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Sneha Reddy: Hi Aria—thanks for taking a few minutes. I’ll keep this brief. I work with teams that are drowning in duplicate support tickets and “is this the same issue?” debates between Support, CS, and Engineering. I wanted to share how Issue_Tracker helps create a single, trustworthy view of customer issues without replacing your existing tools. Does that sound relevant?",
      "link": "https://www.onyx.app/9825397-1"
    },
    {
      "text": "Aria Daniels: Possibly, but I’m heads-down today. We already use Zendesk and Jira, so I’m not looking to add another system.",
      "link": "https://www.onyx.app/9825397-2"
    },
    {
      "text": "Sneha Reddy: Totally fair—and Issue_Tracker is meant to sit between Zendesk and Jira, not replace them. The main thing it does is automatically cluster and dedupe incoming tickets, chats, and even call note summaries into issue themes. So instead of 60 separate “login broken” tickets, you get one cluster with the top phrases, representative examples, and links back to every source ticket in Zendesk. Then you can merge or split clusters with guardrails when something’s actually two different root causes. Does Opalgate see a lot of repeated issues that are hard to quantify?",
      "link": "https://www.onyx.app/9825397-3"
    },
    {
      "text": "Aria Daniels: We do get repeats, but our support leads already tag tickets and we run reports. It’s not perfect, but it works.",
      "link": "https://www.onyx.app/9825397-4"
    },
    {
      "text": "Sneha Reddy: Makes sense. Where we typically help teams like yours is reducing the manual tagging overhead and making trends visible earlier—especially when issues are phrased differently across channels. Because the clustering uses semantic similarity, it catches duplicates even when the wording is all over the place. Then each cluster keeps a clean “issue object”: suspected category like bug vs UX vs missing feature, affected product area, and the evidence trail back to the original conversations.",
      "link": "https://www.onyx.app/9825397-5"
    },
    {
      "text": "Aria Daniels: Okay, but we still need engineering to act, and that’s all in Jira. I don’t want another queue for my team to manage.",
      "link": "https://www.onyx.app/9825397-6"
    },
    {
      "text": "Sneha Reddy: You wouldn’t be managing a second queue. One practical workflow is: Support or CS reviews the cluster, then links the cluster to an existing Jira issue—or creates one if needed. After that, Issue_Tracker just maintains the connection so everyone can see, “This theme maps to Jira-1234, status in progress, shipped in release X.” It becomes a searchable history of decisions and status across teams, without making people change where they work day to day.",
      "link": "https://www.onyx.app/9825397-7"
    },
    {
      "text": "Aria Daniels: We can already link Zendesk tickets to Jira. That’s been fine.",
      "link": "https://www.onyx.app/9825397-8"
    },
    {
      "text": "Sneha Reddy: You can—and that’s helpful at a ticket level. The gap we see is at the theme level. Linking 200 individual tickets to one Jira item is tedious, and teams often stop after linking a handful, so leadership underestimates impact. With clustering, you get the roll-up automatically: “This Jira bug affects 214 tickets, 38 accounts,” and you can drill in if needed. It’s less about the link existing and more about the completeness and the trend visibility.",
      "link": "https://www.onyx.app/9825397-9"
    },
    {
      "text": "Aria Daniels: I’m not sure we’d trust automated clustering. False merges would be a mess.",
      "link": "https://www.onyx.app/9825397-10"
    },
    {
      "text": "Sneha Reddy: That concern comes up a lot. Two points: first, clusters come with representative examples and top phrases so a human can quickly sanity-check what’s grouped. Second, the merge/split workflow is designed to be reversible and auditable, so if two similar issues get lumped together, you can split them and preserve the decision trail. We also use configurable rules—like product area, platform, severity keywords—so you can constrain clustering to reduce risky merges.",
      "link": "https://www.onyx.app/9825397-11"
    },
    {
      "text": "Aria Daniels: Even if it works, what’s the actual win for CS? My team cares about follow-ups and renewals, not prettier triage.",
      "link": "https://www.onyx.app/9825397-12"
    },
    {
      "text": "Sneha Reddy: Exactly—and the CS win is consistent customer follow-up without spreadsheets. Your CSMs can subscribe an account to relevant issue clusters. Then when the linked Jira ticket ships, Issue_Tracker records the release milestone and creates a history trail: which customers were impacted, who was notified, and when. That means fewer “Did anyone tell Aria’s accounts this got fixed?” moments, and it helps you show proactive value in QBRs.",
      "link": "https://www.onyx.app/9825397-13"
    },
    {
      "text": "Aria Daniels: We already have a process for that. It’s manual, but it’s controlled. Automating customer notifications can create mistakes, and our customers are sensitive.",
      "link": "https://www.onyx.app/9825397-14"
    },
    {
      "text": "Sneha Reddy: I’m with you—most teams don’t auto-notify externally. The automation is more about tracking and prompting internally: “This cluster shipped; these accounts were subscribed; here are draft notes or a reminder to follow up.” You can keep human approval in the loop. The key is having a reliable list of affected customers tied to the theme, not trying to reconstruct it after the fact.",
      "link": "https://www.onyx.app/9825397-15"
    },
    {
      "text": "Aria Daniels: I get it conceptually. But this still feels like added tooling and change management. We just went through a big ops cleanup and I don’t have appetite for another rollout.",
      "link": "https://www.onyx.app/9825397-16"
    },
    {
      "text": "Sneha Reddy: Understood. If it helps, teams often start small: one product area, connect Zendesk + Jira, and let clustering run in the background for a couple weeks. Then you compare: what did the cluster view surface that tags and reports missed? If it’s not materially better, you stop. I’m not trying to force a heavy implementation on you.",
      "link": "https://www.onyx.app/9825397-17"
    },
    {
      "text": "Aria Daniels: We’re also pretty locked in on budget right now. Anything new would have to be next cycle.",
      "link": "https://www.onyx.app/9825397-18"
    },
    {
      "text": "Sneha Reddy: That’s helpful context. In that case, my ask would just be a deeper 30-minute discovery to see if there’s a clear ROI case for when budget opens—like reducing duplicate triage time, or improving visibility into widespread issues that are impacting key accounts. Would next week be realistic?",
      "link": "https://www.onyx.app/9825397-19"
    },
    {
      "text": "Aria Daniels: Honestly, no. We’re in renewal season and I’m not taking vendor meetings unless we have an urgent gap. This sounds nice-to-have.",
      "link": "https://www.onyx.app/9825397-20"
    },
    {
      "text": "Sneha Reddy: Got it. Before I let you go—quick check: is your biggest pain more around identifying patterns early, or more around tracking which customers are impacted and ensuring follow-up?",
      "link": "https://www.onyx.app/9825397-21"
    },
    {
      "text": "Aria Daniels: If anything, it’s pattern identification, but we’re not resourced to overhaul the process. And Engineering prioritization is the bottleneck anyway.",
      "link": "https://www.onyx.app/9825397-22"
    },
    {
      "text": "Sneha Reddy: That makes sense. The reason I asked is clustering tends to reduce the “pattern finding” burden on Support/CS, so Engineering gets clearer signal sooner—volume, affected accounts, and evidence in one place—without asking your team to do more. But I hear you on timing.",
      "link": "https://www.onyx.app/9825397-23"
    },
    {
      "text": "Aria Daniels: Yeah. Maybe send me a one-pager and I can circulate it, but I can’t commit to a call.",
      "link": "https://www.onyx.app/9825397-24"
    },
    {
      "text": "Sneha Reddy: Absolutely. I’ll send a concise overview focused on clustering and the CS follow-up workflow, plus an example of how the theme-to-Jira linkage looks with the history trail. If it’s useful, could I check back in a month or two?",
      "link": "https://www.onyx.app/9825397-25"
    },
    {
      "text": "Aria Daniels: Sure, follow up in a couple months. If something changes, I’ll reach out.",
      "link": "https://www.onyx.app/9825397-26"
    },
    {
      "text": "Sneha Reddy: Perfect. Thanks, Aria—I’ll keep it short in email and won’t spam you. Appreciate your time today.",
      "link": "https://www.onyx.app/9825397-27"
    },
    {
      "text": "Aria Daniels: Thanks. Bye.",
      "link": "https://www.onyx.app/9825397-28"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "sneha_reddy@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "aria_daniels@opalgate_enterprises.onyx.app"
    }
  ]
}