{
  "id": "FIREFLIES_9939835",
  "semantic_identifier": "9939835 - Westgate Alloy Works - sales_pitch - Discussion with Levi Ray",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-12-11 00:00:00",
  "metadata": {
    "meeting_date": "2025-12-11 00:00:00",
    "duration_min": "44"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-12"
      ],
      "year_month": "2025-12",
      "meeting_title": "9939835 - Westgate Alloy Works - sales_pitch - Discussion with Levi Ray",
      "organizer_email": "james_choi@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "James Choi: Hi Levi, James Choi here. Appreciate you taking a few minutes—did I catch you at an okay time?",
      "link": "https://www.onyx.app/6597542-1"
    },
    {
      "text": "Levi Ray: Yeah, I’ve got a few minutes. What’s up?",
      "link": "https://www.onyx.app/6597542-2"
    },
    {
      "text": "James Choi: Great. I’ll keep it tight. I work with teams like Westgate Alloy Works that live in Salesforce or HubSpot and are trying to get more consistent about pipeline—especially forecasting—and making sure reps are working the right deals at the right time. We built something called Sales_Accelerator. It sits on top of your CRM and turns the signals you already have—stages, emails, calls, meetings—into an explainable forecast and “best next action” guidance so you don’t get end-of-quarter surprises. Curious—how are you forecasting today?",
      "link": "https://www.onyx.app/6597542-3"
    },
    {
      "text": "Levi Ray: Mostly Salesforce stages plus a weekly rep rollup. It’s… fine, but it gets messy toward the end of the month.",
      "link": "https://www.onyx.app/6597542-4"
    },
    {
      "text": "James Choi: That’s the exact pattern we see. The main issue is stages are lagging indicators—people update them late, or optimism creeps in—so the forecast becomes a negotiation instead of a system. Sales_Accelerator’s forecasting looks at the CRM stage, but also activity signals and cycle-time benchmarks, and then flags the drivers behind the number—like stage age, last touch, whether a next meeting is scheduled—so your forecast is explainable, not just a black box.",
      "link": "https://www.onyx.app/6597542-5"
    },
    {
      "text": "Levi Ray: Okay. Explainable is good. But we already have dashboards—what’s actually different?",
      "link": "https://www.onyx.app/6597542-6"
    },
    {
      "text": "James Choi: Two big differences. First, it gives you commit/best-case/pipeline views that automatically adjust based on risk signals, not just rep sentiment. Second, it tells you why—like “This deal is in stage 3 for 28 days vs. a typical 14, no meeting on the books, last touch 10 days ago,” so a manager can coach the right action instead of just pushing for an updated close date. Does that resonate with what you’re seeing?",
      "link": "https://www.onyx.app/6597542-7"
    },
    {
      "text": "Levi Ray: Yeah, we have deals that sit forever and then suddenly “slip” when we look closely. But I also care about speed-to-lead. We have inbound forms and sometimes it takes a day for someone to respond.",
      "link": "https://www.onyx.app/6597542-8"
    },
    {
      "text": "James Choi: Perfect—there’s a really specific use case we support there. For growth teams, Sales_Accelerator can prioritize inbound leads and recommend the best first response based on what’s most likely to convert. And then it tracks whether faster first-touch correlates with higher win rate for your team—so you can prove if “respond within 10 minutes” is actually worth operationalizing.",
      "link": "https://www.onyx.app/6597542-9"
    },
    {
      "text": "Levi Ray: We’ve talked about that internally, but we never measure it cleanly. We just assume faster is better.",
      "link": "https://www.onyx.app/6597542-10"
    },
    {
      "text": "James Choi: Exactly. We make it measurable. And we don’t ask you to rip out your CRM or rebuild your processes. We sit on top of Salesforce/HubSpot, ingest activity signals, and then operationalize it: “Here are the five inbound leads right now that match your best customers; here’s the message to send first; here’s the follow-up sequence if they don’t reply.” Even if you don’t implement everything, the visibility alone usually highlights where leads are stalling.",
      "link": "https://www.onyx.app/6597542-11"
    },
    {
      "text": "Levi Ray: How does it know which leads match our best customers? We’ve been working on ICP, but it’s not perfect.",
      "link": "https://www.onyx.app/6597542-12"
    },
    {
      "text": "James Choi: Good question. If you already have any fit scoring—whether it’s a simple rubric or something more advanced—we can use it as a weighting factor in the forecast and prioritization. And if you use a system like Customer_Analyzer, Sales_Accelerator can consume those fit scores and positioning blocks rather than duplicating that work. The idea is: Customer_Analyzer defines who to go after and how to position; Sales_Accelerator turns that into day-to-day execution—prioritize, message, sequence, and forecast outcomes.",
      "link": "https://www.onyx.app/6597542-13"
    },
    {
      "text": "Levi Ray: We don’t use Customer_Analyzer today, but we do tag accounts and segments in Salesforce. Could it still work?",
      "link": "https://www.onyx.app/6597542-14"
    },
    {
      "text": "James Choi: Absolutely. We can start with what you have—segments, source, historical win rate, and activity patterns—and then mature it over time. The near-term value is you get an early warning system on deal slippage and a clearer forecast by segment/rep/source, plus actionable recommendations for what to do next so deals don’t just “age.”",
      "link": "https://www.onyx.app/6597542-15"
    },
    {
      "text": "Levi Ray: What does setup look like? I don’t want a six-month project.",
      "link": "https://www.onyx.app/6597542-16"
    },
    {
      "text": "James Choi: Totally fair. The lightest version is connecting your CRM and your activity sources—email/calendar/calling—so we can read stage, timestamps, and engagement. Then we configure a few benchmarks: typical cycle times by stage, what “healthy activity” looks like, and your segments. From there you get dashboards plus rep-level guidance. In most cases, you can see signal in a couple of weeks, not months.",
      "link": "https://www.onyx.app/6597542-17"
    },
    {
      "text": "Levi Ray: And who uses it day to day? Sales ops, managers, reps?",
      "link": "https://www.onyx.app/6597542-18"
    },
    {
      "text": "James Choi: All three, but in different ways. Managers use it for the forecast views and slippage diagnostics—so pipeline reviews focus on drivers and next steps, not opinions. Reps see “best next action” on accounts and opps—like “book next meeting,” “send follow-up,” “loop in stakeholder”—based on what typically moves deals forward. Sales ops uses the scenario planning: for example, “If we add 20 SQLs in our top segment, what’s the expected impact on bookings?” That’s really helpful for planning and resourcing.",
      "link": "https://www.onyx.app/6597542-19"
    },
    {
      "text": "Levi Ray: Scenario planning sounds interesting. We’re trying to decide whether to invest more in inbound versus outbound this quarter.",
      "link": "https://www.onyx.app/6597542-20"
    },
    {
      "text": "James Choi: That’s a great fit. Because we can forecast by source and segment, you can compare what incremental inbound SQLs tend to produce versus outbound—based on your historical conversion and cycle times—then pressure test “what if” scenarios. And it stays grounded because you can drill into the drivers: win rates for similar deals, stage conversions, and whether deals are actually being touched.",
      "link": "https://www.onyx.app/6597542-21"
    },
    {
      "text": "Levi Ray: How “pushy” is it for reps? I don’t want another tool they ignore.",
      "link": "https://www.onyx.app/6597542-22"
    },
    {
      "text": "James Choi: We’re pretty intentional there. The recommendations are short, explainable, and tied to outcomes—so a rep sees “why” it’s recommending something. Also, because it sits on top of your CRM, you’re not asking them to live in a totally separate universe; it’s about making the CRM data and activity data actually useful. Adoption usually comes from managers using it in 1:1s and pipeline reviews—reps quickly learn it helps them avoid dead deals and focus effort.",
      "link": "https://www.onyx.app/6597542-23"
    },
    {
      "text": "Levi Ray: Makes sense. What would you need from me to see if it’s worth a deeper look?",
      "link": "https://www.onyx.app/6597542-24"
    },
    {
      "text": "James Choi: For a proper evaluation, I’d suggest a 30–45 minute working session where we map your current forecast process and your inbound speed-to-lead flow. If you can share: which CRM you’re on, where inbound is captured, and how you define segments today, we can show what the forecast drivers and inbound prioritization would look like for Westgate. Does next week work for a deeper dive?",
      "link": "https://www.onyx.app/6597542-25"
    },
    {
      "text": "Levi Ray: Yeah, I’m open to that. We’re on HubSpot for marketing and Salesforce for sales, and inbound flows through HubSpot forms.",
      "link": "https://www.onyx.app/6597542-26"
    },
    {
      "text": "James Choi: Perfect—that’s a common setup. How about Tuesday at 11am or Wednesday at 2pm your time? In that meeting, I’ll walk you through: (1) the forecast views—commit/best-case/pipeline with driver explanations, (2) slippage diagnostics—what’s aging and why, and (3) the inbound speed-to-lead workflow—prioritization and first-touch recommendations, plus how we’d measure the win-rate impact.",
      "link": "https://www.onyx.app/6597542-27"
    },
    {
      "text": "Levi Ray: Wednesday at 2 works better.",
      "link": "https://www.onyx.app/6597542-28"
    },
    {
      "text": "James Choi: Great—Wednesday at 2. I’ll send a calendar invite with a short agenda and a couple of questions so we can make it useful. If you can, bring whoever owns forecasting—maybe sales ops or your sales manager—and whoever owns inbound routing. Sound good?",
      "link": "https://www.onyx.app/6597542-29"
    },
    {
      "text": "Levi Ray: Yep, I can pull in our sales ops lead. Send it over.",
      "link": "https://www.onyx.app/6597542-30"
    },
    {
      "text": "James Choi: Will do. Last quick one—what’s the biggest pain you want solved first: forecast accuracy, catching slipping deals earlier, or improving inbound response and conversion?",
      "link": "https://www.onyx.app/6597542-31"
    },
    {
      "text": "Levi Ray: Forecast accuracy and catching slippage. Inbound matters, but the forecast is what leadership hounds us on.",
      "link": "https://www.onyx.app/6597542-32"
    },
    {
      "text": "James Choi: Got it. I’ll tailor Wednesday’s session around forecast drivers and early warnings, and we’ll still carve out five minutes on inbound speed-to-lead since it’s usually a quick win. Thanks, Levi—I’ll send the invite shortly.",
      "link": "https://www.onyx.app/6597542-33"
    },
    {
      "text": "Levi Ray: Sounds good. Talk Wednesday.",
      "link": "https://www.onyx.app/6597542-34"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "james_choi@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "levi_ray@westgate_alloy_works.onyx.app"
    }
  ]
}