{
  "id": "FIREFLIES_2381286",
  "semantic_identifier": "2381286 - Ultraviolet Summit Labs - sales_pitch - Discussion with Natalie Collins",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-04-15 00:00:00",
  "metadata": {
    "meeting_date": "2025-04-15 00:00:00",
    "duration_min": "28"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-04"
      ],
      "year_month": "2025-04",
      "meeting_title": "2381286 - Ultraviolet Summit Labs - sales_pitch - Discussion with Natalie Collins",
      "organizer_email": "mina_park@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Mina Park: Hi Natalie—Mina Park here. Thanks for taking a few minutes. I’ll keep this quick. I’m calling because we built Customer_Analyzer to help product and go-to-market teams get crisp on who their best customers are and how to position to win more of them, using the signals you already have—CRM fields, onboarding surveys, product usage, support tickets, even interview notes.",
      "link": "https://www.onyx.app/9916329-1"
    },
    {
      "text": "Natalie Collins: Hi Mina, sure. We’re in between meetings, but I can do a quick overview. What are you seeing teams struggle with that you solve?",
      "link": "https://www.onyx.app/9916329-2"
    },
    {
      "text": "Mina Park: The most common pattern is: teams have lots of customer data, but it doesn’t translate into a shared view of “these are our highest-fit segments” and “this is the message that actually resonates with them.” So Customer_Analyzer does two things: it helps you prioritize segments with a fit score, and then it generates positioning recommendations—editable messaging blocks—based on the fit drivers and the actual language customers use.",
      "link": "https://www.onyx.app/9916329-3"
    },
    {
      "text": "Natalie Collins: Positioning recommendations—like copy suggestions? Or more like a framework?",
      "link": "https://www.onyx.app/9916329-4"
    },
    {
      "text": "Mina Park: Both. The feature I’d highlight is our positioning_recommendation module. Once you’ve identified a prioritized segment, it outputs a segment-specific value proposition, top use cases, differentiators, proof points you should collect, pricing/value framing notes, and an objection-handling playbook. And it’s not just a generic doc—it’s packaged as usable blocks: website hero copy, sales deck bullets, email openers. Each block links back to the underlying drivers and evidence so product, marketing, and sales can all see “why this claim is true.”",
      "link": "https://www.onyx.app/9916329-5"
    },
    {
      "text": "Natalie Collins: Interesting. We’ve been trying to tighten ICP and messaging, but it tends to be opinion-based. How does it decide what’s “high fit”?",
      "link": "https://www.onyx.app/9916329-6"
    },
    {
      "text": "Mina Park: Great question. We ingest your existing signals—whatever you trust today: CRM attributes, onboarding responses, usage events, support patterns, and notes from calls. Then we identify the drivers that correlate with success outcomes you care about—things like time-to-value, expansion, retention, or faster deal cycles. The fit score is essentially “how closely does this segment match what your product is currently best at delivering,” and it’s transparent: you can see which drivers contributed and which data points supported it.",
      "link": "https://www.onyx.app/9916329-7"
    },
    {
      "text": "Natalie Collins: Okay. We’re a smaller team—Ultraviolet Summit Labs doesn’t have a huge ops function. I’m worried this becomes a big data project.",
      "link": "https://www.onyx.app/9916329-8"
    },
    {
      "text": "Mina Park: Totally fair. We’re designed for “start small.” Most teams begin with two or three sources—often CRM + product usage + a lightweight survey—or even CRM + interview notes. You can get value without perfect instrumentation. The point is to move from scattered inputs to a prioritized segment view and messaging you can immediately test in outbound, on the website, and in discovery calls.",
      "link": "https://www.onyx.app/9916329-9"
    },
    {
      "text": "Natalie Collins: You mentioned product teams—my main focus is product planning. How does this help roadmap decisions?",
      "link": "https://www.onyx.app/9916329-10"
    },
    {
      "text": "Mina Park: That’s one of the strongest use cases: product planning. Because once you see which segments are highest fit and what their unmet needs are—based on patterns in tickets, usage drop-offs, interview language—you can make cleaner roadmap bets. Instead of “we should build X because we heard it twice,” you can say “this is a high-fit segment with consistent unmet need around Y; solving Y improves retention and expands the addressable footprint inside that segment.”",
      "link": "https://www.onyx.app/9916329-11"
    },
    {
      "text": "Natalie Collins: That’s the kind of evidence we’ve been missing. But how do you prevent it from just reflecting current customers and missing where we want to go?",
      "link": "https://www.onyx.app/9916329-12"
    },
    {
      "text": "Mina Park: We handle that in two ways. First, you can define the outcomes you want to optimize for—like expansion potential or enterprise readiness—so the fit scoring doesn’t over-index on “easy small customers” if that’s not strategic. Second, positioning recommendations explicitly include “proof points to collect” and “objections to address,” which is helpful when you’re moving upmarket or into a newer segment—so you can run targeted experiments and build evidence rather than guessing.",
      "link": "https://www.onyx.app/9916329-13"
    },
    {
      "text": "Natalie Collins: Got it. What would an example output look like for a segment?",
      "link": "https://www.onyx.app/9916329-14"
    },
    {
      "text": "Mina Park: Say you identify a segment like “mid-market teams with high onboarding completion but recurring support requests around integrations.” The output might recommend a value proposition emphasizing faster time-to-value with fewer workflow breaks, differentiators around your integration approach, proof points like integration setup time or support deflection, plus an objection-handling playbook—for example, “we already have tooling for this” or “your platform seems complex.” And then it gives you ready-to-edit blocks: a homepage hero line, 3 sales deck bullets, and an email opener tailored to that segment.",
      "link": "https://www.onyx.app/9916329-15"
    },
    {
      "text": "Natalie Collins: That’s useful. We constantly rewrite messaging and still aren’t sure it matches what customers actually care about.",
      "link": "https://www.onyx.app/9916329-16"
    },
    {
      "text": "Mina Park: Exactly. And because the recommendations are tied back to observed customer language—pulled from tickets, surveys, and notes—you get that “this is how customers describe the problem” angle, not internal jargon. That tends to tighten marketing and sales alignment fast.",
      "link": "https://www.onyx.app/9916329-17"
    },
    {
      "text": "Natalie Collins: What does implementation look like? Like timeline and effort.",
      "link": "https://www.onyx.app/9916329-18"
    },
    {
      "text": "Mina Park: Typically, week one is connecting the first sources—often CRM and one other system—and agreeing on the success outcomes you want to model. Week two is producing the first cut of fit scoring and a couple prioritized segments. Then we generate positioning recommendations for those segments and run a working session to edit and turn them into assets you can deploy. Most teams see something actionable in the first two weeks, without a big IT lift.",
      "link": "https://www.onyx.app/9916329-19"
    },
    {
      "text": "Natalie Collins: And is this replacing what we do in research? Or augmenting it?",
      "link": "https://www.onyx.app/9916329-20"
    },
    {
      "text": "Mina Park: Augmenting. It’s not trying to replace qualitative discovery; it helps you scale it. It turns scattered qualitative and quantitative signals into a coherent picture, then gives you a structured way to translate that into messaging and product bets. Many teams use it to decide where to do deeper interviews next—because you can see which segments are high fit but poorly understood, or where unmet needs cluster.",
      "link": "https://www.onyx.app/9916329-21"
    },
    {
      "text": "Natalie Collins: This sounds like something our product marketing and sales leads would also want to see. I’m not the only stakeholder.",
      "link": "https://www.onyx.app/9916329-22"
    },
    {
      "text": "Mina Park: That’s perfect, and honestly that’s when it works best—when product, marketing, and sales can look at the same drivers and messaging. Would it be reasonable to set up a 45-minute session next week with you plus whoever owns positioning—maybe product marketing—and someone from sales? I can walk through a sample workflow, show the positioning blocks, and we can talk through your current segments and what data you already have.",
      "link": "https://www.onyx.app/9916329-23"
    },
    {
      "text": "Natalie Collins: Yes, I think that makes sense. If you can keep it practical—less “theory,” more “here’s what you’d get.”",
      "link": "https://www.onyx.app/9916329-24"
    },
    {
      "text": "Mina Park: Absolutely. I’ll tailor it. Before we schedule, two quick questions so I bring the right examples: one, what’s the biggest product planning decision you’re trying to make this quarter—new segment, expansion, retention? Two, what systems do you have today for customer signals—CRM, analytics, support?",
      "link": "https://www.onyx.app/9916329-25"
    },
    {
      "text": "Natalie Collins: This quarter we’re debating whether to double down on a segment we’re seeing traction with, versus chasing a newer one. Systems-wise: we’re on a standard CRM, we have product usage events in an analytics tool, and support tickets in a helpdesk platform. We also have a bunch of call notes in docs.",
      "link": "https://www.onyx.app/9916329-26"
    },
    {
      "text": "Mina Park: Perfect—that’s exactly the mix we work with. I’ll set the agenda around segment prioritization for that decision, then generate sample positioning recommendations for the top two segments so you can compare. What does your calendar look like Tuesday or Wednesday afternoon?",
      "link": "https://www.onyx.app/9916329-27"
    },
    {
      "text": "Natalie Collins: Wednesday afternoon could work. Send me a couple options and I’ll loop in our product marketing lead.",
      "link": "https://www.onyx.app/9916329-28"
    },
    {
      "text": "Mina Park: Great. I’ll email two times for Wednesday afternoon and include a brief outline: inputs we’d use, what the fit score shows, and example positioning blocks—value prop, differentiators, and objection handling. Thanks Natalie—looking forward to it.",
      "link": "https://www.onyx.app/9916329-29"
    },
    {
      "text": "Natalie Collins: Sounds good. Thanks, Mina.",
      "link": "https://www.onyx.app/9916329-30"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mina_park@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "natalie_collins@ultraviolet_summit_labs.onyx.app"
    }
  ]
}