{
  "id": "FIREFLIES_7297025",
  "semantic_identifier": "7297025 - Dunecrown Mining - sales_pitch - Discussion with Bianca Ramirez",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-04-06 00:00:00",
  "metadata": {
    "meeting_date": "2025-04-06 00:00:00",
    "duration_min": "26"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-04"
      ],
      "year_month": "2025-04",
      "meeting_title": "7297025 - Dunecrown Mining - sales_pitch - Discussion with Bianca Ramirez",
      "organizer_email": "james_choi@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "James Choi: Hi Bianca, thanks for taking a few minutes—James Choi here. I know you’re busy, so I’ll keep this tight. I’m calling because a lot of support ops teams are drowning in duplicate tickets and “same issue, different wording” requests, and it makes it hard to tell Product what’s actually trending. We built Issue_Tracker specifically to sit between Zendesk/Intercom and Jira/Linear and turn raw customer noise into clear, prioritized issue themes. Mind if I ask how you’re handling that today at Dunecrown Mining?",
      "link": "https://www.onyx.app/3685596-1"
    },
    {
      "text": "Bianca Ramirez: Hi James—sure. We’re definitely seeing a lot of repeats, especially around a few product areas. We tag and categorize in Zendesk, and then we manually summarize for our weekly handoff to Product. It works, but it’s time-consuming and we still miss patterns.",
      "link": "https://www.onyx.app/3685596-2"
    },
    {
      "text": "James Choi: That’s exactly the pain we hear. The core thing Issue_Tracker does is automatic issue clustering—so it ingests tickets, chats, emails, even call-note summaries, and deduplicates them into issue clusters using semantic similarity plus rules you can control, like product area, severity, keywords, or platform. Instead of 5,000 tickets feeling like 5,000 separate problems, you end up with, say, ~80 active themes you can actually manage. When you say you miss patterns, is it because the volume is too high, or because customers describe the same issue in different ways?",
      "link": "https://www.onyx.app/3685596-3"
    },
    {
      "text": "Bianca Ramirez: Both. Volume is a big factor, but also people describe things differently. Sometimes they file it as a bug, sometimes as a feature request, and it splinters across tags. Then engineering thinks it’s small because each bucket looks small.",
      "link": "https://www.onyx.app/3685596-4"
    },
    {
      "text": "James Choi: Right—Issue_Tracker is built to prevent that “false smallness.” The clustering creates a standardized “issue object” with the theme, suspected root cause category—bug vs UX vs missing feature vs integration—plus evidence and links back to the source conversations in Zendesk. So when you go to engineering, you’re not saying “we think this matters,” you’re showing: here’s the cluster, here are representative examples, here are the top phrases customers use, and here’s the list of affected customers.",
      "link": "https://www.onyx.app/3685596-5"
    },
    {
      "text": "Bianca Ramirez: That sounds useful. How much manual work is involved? We don’t want another tool that requires constant babysitting.",
      "link": "https://www.onyx.app/3685596-6"
    },
    {
      "text": "James Choi: Totally fair. Most teams start with the automatic clustering and then do light human refinement using a merge/split workflow with guardrails. So if two clusters are basically the same, you merge; if one cluster is too broad, you split. The system suggests cluster names, highlights representative tickets, and keeps the underlying links intact so nothing becomes a dead end. The goal is: your team spends minutes curating the top themes, not hours sorting every ticket.",
      "link": "https://www.onyx.app/3685596-7"
    },
    {
      "text": "Bianca Ramirez: Okay. And how does this fit with our existing process? We use Zendesk heavily, and then Jira for engineering work.",
      "link": "https://www.onyx.app/3685596-8"
    },
    {
      "text": "James Choi: Issue_Tracker is designed to sit between them rather than replace either. Zendesk stays your system of record for support interactions; Jira stays engineering’s system of record for delivery. We pull in the customer-reported inputs, cluster them into themes, and then you can route the top clusters to your weekly Product/Engineering sync with one click—each cluster carries the evidence bundle and the affected customer list. Then when engineering creates or links a Jira issue, Issue_Tracker keeps that status connected back to the cluster so Support can see what’s in progress, what’s shipped, and what’s stalled—without digging through Jira tickets.",
      "link": "https://www.onyx.app/3685596-9"
    },
    {
      "text": "Bianca Ramirez: That “status connected back” part would help. Our agents get asked for updates and it’s hard to give a consistent answer.",
      "link": "https://www.onyx.app/3685596-10"
    },
    {
      "text": "James Choi: Exactly—because the issue object stays linked to both the original conversations and the downstream engineering work. So you can search, “What’s the status of the theme that’s driving all these tickets?” and you get a defensible history: when it was first reported, how it evolved, what decisions were made, and what’s currently happening. That usually reduces internal back-and-forth and also helps you set clearer customer expectations.",
      "link": "https://www.onyx.app/3685596-11"
    },
    {
      "text": "Bianca Ramirez: Do you have an example of how support ops teams actually use it week to week?",
      "link": "https://www.onyx.app/3685596-12"
    },
    {
      "text": "James Choi: Yes—one very common workflow is: support ops clusters, say, 5,000 monthly tickets into around 80 active themes. During the week, the clustering updates continuously as new tickets come in. Then before the Product/Engineering weekly meeting, you take the top 10 clusters—based on volume, severity, or customer impact—send those over with representative examples and affected customer lists, and keep the rest as monitored themes. The team stops arguing about anecdotes and starts prioritizing based on a single shared view of “what’s happening to customers.”",
      "link": "https://www.onyx.app/3685596-13"
    },
    {
      "text": "Bianca Ramirez: That sounds like what we want. Our biggest challenge is making the case that something is widespread, not a one-off.",
      "link": "https://www.onyx.app/3685596-14"
    },
    {
      "text": "James Choi: That’s the sweet spot. And because the clusters show volume and trends over time, you can say, “This issue is up 40% week-over-week,” or “This theme affects these customers,” with direct links back to the source tickets. It’s hard to dismiss because the evidence is right there, and it’s not dependent on perfect tagging discipline.",
      "link": "https://www.onyx.app/3685596-15"
    },
    {
      "text": "Bianca Ramirez: How long does it take to get value? We’re mid-quarter and I can’t take on a long implementation.",
      "link": "https://www.onyx.app/3685596-16"
    },
    {
      "text": "James Choi: Understood. The typical path is: connect Zendesk, let it ingest historical and new tickets, and within the first week you’ll see clusters forming and can start using them in your handoffs. Then you tune a few rules—like product areas or severity—and that’s usually incremental. If it’s helpful, on a full call we can map your current weekly triage workflow and show what it would look like with Issue_Tracker layered in, without disrupting Zendesk or Jira.",
      "link": "https://www.onyx.app/3685596-17"
    },
    {
      "text": "Bianca Ramirez: I’d be open to that. I’d want to see how well it clusters our real tickets, because our terminology is a bit unique.",
      "link": "https://www.onyx.app/3685596-18"
    },
    {
      "text": "James Choi: Completely reasonable—seeing your data is the only way to judge clustering quality. On the next call, we can do a quick discovery on your current categories and then walk through a sample output: how it names clusters, what it picks as representative examples, and how the merge/split workflow works when terminology is unique. If it doesn’t group things the way you’d expect, we’ll be transparent about that.",
      "link": "https://www.onyx.app/3685596-19"
    },
    {
      "text": "Bianca Ramirez: Okay. Who else should be on that call from your side?",
      "link": "https://www.onyx.app/3685596-20"
    },
    {
      "text": "James Choi: It would just be me, and if you want a deeper technical walkthrough we can add someone later—but for the first full sales call, I’d keep it focused: your support ops perspective, how you currently hand off to Product/Engineering, and what “success” would look like at Dunecrown. Would it make sense to include whoever runs the weekly triage meeting, or a PM who consumes the insights?",
      "link": "https://www.onyx.app/3685596-21"
    },
    {
      "text": "Bianca Ramirez: Yes, I can bring our support ops lead and maybe one PM. Can you send times?",
      "link": "https://www.onyx.app/3685596-22"
    },
    {
      "text": "James Choi: Absolutely. I’ll email a couple options—does next Tuesday or Wednesday afternoon work better for a 30-minute session? We’ll aim to confirm: ticket volume, current tagging, how you route themes to engineering, and then we’ll show what Issue_Tracker would produce—top clusters, evidence bundles, and affected customer lists.",
      "link": "https://www.onyx.app/3685596-23"
    },
    {
      "text": "Bianca Ramirez: Wednesday afternoon is usually better. Send a couple slots and I’ll coordinate.",
      "link": "https://www.onyx.app/3685596-24"
    },
    {
      "text": "James Choi: Perfect. I’ll send two Wednesday options and a short agenda. Last question so I tailor it—roughly how many tickets a month are you seeing in Zendesk right now?",
      "link": "https://www.onyx.app/3685596-25"
    },
    {
      "text": "Bianca Ramirez: Around 4,000 to 6,000 depending on the month.",
      "link": "https://www.onyx.app/3685596-26"
    },
    {
      "text": "James Choi: Great—that’s right in the range where clustering pays off quickly. I’ll follow up with the invite options, and if you can reply with any current tag taxonomy or a sample of your weekly summary format, I’ll align the demo to that. Thanks, Bianca.",
      "link": "https://www.onyx.app/3685596-27"
    },
    {
      "text": "Bianca Ramirez: Sounds good. Thanks, James—talk soon.",
      "link": "https://www.onyx.app/3685596-28"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "james_choi@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "bianca_ramirez@dunecrown_mining.onyx.app"
    }
  ]
}