{
  "id": "FIREFLIES_1700960",
  "semantic_identifier": "1700960 - Aurorakite Software - sales_pitch - Discussion with Marco Aguilar",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-09-07 00:00:00",
  "metadata": {
    "meeting_date": "2025-09-07 00:00:00",
    "duration_min": "42"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-09"
      ],
      "year_month": "2025-09",
      "meeting_title": "1700960 - Aurorakite Software - sales_pitch - Discussion with Marco Aguilar",
      "organizer_email": "sneha_reddy@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Sneha Reddy: Hi Marco—Sneha Reddy here. Thanks for taking a few minutes. I’ll be brief: I’m calling from Customer_Analyzer. We help product, marketing, and sales teams get really crisp on which customer segments are actually a great fit right now—and then turn that into messaging your teams can use immediately.",
      "link": "https://www.onyx.app/4506306-1"
    },
    {
      "text": "Marco Aguilar: Hey Sneha. Yeah, I’ve got a few minutes. What do you mean by “get crisp” exactly?",
      "link": "https://www.onyx.app/4506306-2"
    },
    {
      "text": "Sneha Reddy: Totally. Most teams have an ICP slide, but it’s often based on a mix of anecdotes and outdated assumptions. Customer_Analyzer ingests signals you already have—CRM fields, onboarding surveys, product usage events, support tickets, even interview notes—and outputs two things: a fit score by segment, and positioning recommendations tailored to the segments you should prioritize.",
      "link": "https://www.onyx.app/4506306-3"
    },
    {
      "text": "Marco Aguilar: Okay. We’re actually trying to decide which industries to lean into next quarter. But it gets messy—some verticals retain well but are a pain for support.",
      "link": "https://www.onyx.app/4506306-4"
    },
    {
      "text": "Sneha Reddy: That’s exactly one of the use cases we see a lot: “Which industries should we target next quarter using retention and support burden signals?” We’ll combine retention metrics with support burden—like ticket volume, categories, time-to-resolution—then score segments so you’re not just chasing top-of-funnel or logos. You can see, for example, “Industry A retains 15% better but generates 2x support load,” versus “Industry B retains slightly lower but scales cleanly.”",
      "link": "https://www.onyx.app/4506306-5"
    },
    {
      "text": "Marco Aguilar: Interesting. We do have that data, but it’s spread across tools. How heavy is the setup?",
      "link": "https://www.onyx.app/4506306-6"
    },
    {
      "text": "Sneha Reddy: Setup is usually lightweight because we start with what you already track. For Aurorakite Software, we’d typically pull core CRM fields for industry and deal context, product usage events for adoption, and support ticket metadata for burden. If you don’t have perfect instrumentation, that’s fine—we’ll still produce a first-pass segment fit score and then show you what signals would improve confidence.",
      "link": "https://www.onyx.app/4506306-7"
    },
    {
      "text": "Marco Aguilar: And the “positioning” part—what does that look like? We don’t want another dashboard nobody uses.",
      "link": "https://www.onyx.app/4506306-8"
    },
    {
      "text": "Sneha Reddy: Completely agree. Our most-used feature is the positioning_recommendation output. Once the fit score identifies, say, two segments worth prioritizing next quarter, Customer_Analyzer generates editable messaging blocks for each segment: a segment-specific value proposition, top use cases, differentiators, proof points you should collect, pricing/value framing notes, and an objection-handling playbook.",
      "link": "https://www.onyx.app/4506306-9"
    },
    {
      "text": "Marco Aguilar: Editable messaging blocks—like what, exactly?",
      "link": "https://www.onyx.app/4506306-10"
    },
    {
      "text": "Sneha Reddy: Think practical, not theoretical. For example: website hero copy tailored to the segment, sales deck bullets, and even email openers SDRs can use. And the key is it’s linked back to evidence—what drivers we saw in usage, what language shows up in support tickets or survey responses—so your team can trust it and iterate instead of debating opinions.",
      "link": "https://www.onyx.app/4506306-11"
    },
    {
      "text": "Marco Aguilar: That “linked back to evidence” part is compelling. We constantly argue internally about why we win or lose in a vertical.",
      "link": "https://www.onyx.app/4506306-12"
    },
    {
      "text": "Sneha Reddy: Yes—Customer_Analyzer is built to reduce those circular conversations. If your team says, “Healthcare is our best segment,” the system can show: retention trend, time-to-value, support burden, and which product behaviors correlate with renewals. Then the positioning recommendation translates that into, “Lead with X benefit, prove it with Y proof point, and handle the Z objection this way.”",
      "link": "https://www.onyx.app/4506306-13"
    },
    {
      "text": "Marco Aguilar: How does it handle objections? That sounds a bit… generic if it’s auto-generated.",
      "link": "https://www.onyx.app/4506306-14"
    },
    {
      "text": "Sneha Reddy: Fair question. We don’t just spit out generic scripts. The objection playbook is anchored to what we see in your real customer language—support tickets, call notes, onboarding feedback—so it reflects what prospects in that segment actually push back on. And it’s editable, so your sales leaders can tune it and roll it out consistently.",
      "link": "https://www.onyx.app/4506306-15"
    },
    {
      "text": "Marco Aguilar: Got it. We’re mid-refresh on messaging, but I’m worried about change management. Marketing and sales rarely align perfectly.",
      "link": "https://www.onyx.app/4506306-16"
    },
    {
      "text": "Sneha Reddy: That’s one of the reasons customers adopt us. The output is designed to be shared across functions: product can see the fit drivers, marketing gets segment-specific positioning, and sales gets usable talk tracks and email openers. It becomes a single “source of truth” you can review in a working session rather than a static deck.",
      "link": "https://www.onyx.app/4506306-17"
    },
    {
      "text": "Marco Aguilar: How quickly would we see something useful? We’re planning next quarter now.",
      "link": "https://www.onyx.app/4506306-18"
    },
    {
      "text": "Sneha Reddy: Typically within the first couple weeks you’ll have a clear ranking of segments using retention and support burden signals, plus draft positioning blocks for the top one or two segments. Many teams use that directly in quarterly planning: “Here are the two industries we’re leaning into, here’s the narrative, here are the proof points we need to collect.”",
      "link": "https://www.onyx.app/4506306-19"
    },
    {
      "text": "Marco Aguilar: Proof points to collect—like customer stories?",
      "link": "https://www.onyx.app/4506306-20"
    },
    {
      "text": "Sneha Reddy: Exactly—case studies, metrics, quotes, before/after outcomes. The positioning recommendation will flag what proof points are missing for a segment. So instead of “we should get more case studies,” it’s, “For Segment B, we need a quantified time-to-value story and a support reduction angle, because that’s what correlates with retention and shows up in customer language.”",
      "link": "https://www.onyx.app/4506306-21"
    },
    {
      "text": "Marco Aguilar: That’s pretty practical. What do you need from me to evaluate this?",
      "link": "https://www.onyx.app/4506306-22"
    },
    {
      "text": "Sneha Reddy: The best next step is a 30-minute working session with you and whoever owns growth or GTM planning. In that session, we’ll map your current industries, confirm where retention and support burden live, and I’ll show you a sample of the positioning blocks—hero copy, deck bullets, objection handling—so you can judge if it’s the kind of output your teams would actually use.",
      "link": "https://www.onyx.app/4506306-23"
    },
    {
      "text": "Marco Aguilar: Okay. I’d want our Head of Marketing in that, and maybe someone from RevOps since the data is in a few places.",
      "link": "https://www.onyx.app/4506306-24"
    },
    {
      "text": "Sneha Reddy: Perfect—those are the right folks. If you’re open to it, I’ll send a calendar invite for 30 minutes. Beforehand, I’ll send a short checklist: which CRM fields you use for industry, where support ticket tags live, and what retention metric you trust (logo vs. revenue). That way we can spend the meeting on insights, not plumbing.",
      "link": "https://www.onyx.app/4506306-25"
    },
    {
      "text": "Marco Aguilar: Sounds good. What times are you thinking?",
      "link": "https://www.onyx.app/4506306-26"
    },
    {
      "text": "Sneha Reddy: I have Wednesday at 11:00am or Thursday at 2:00pm your time. Do either work for you?",
      "link": "https://www.onyx.app/4506306-27"
    },
    {
      "text": "Marco Aguilar: Thursday at 2:00 works. Send it over and I’ll loop in Marketing and RevOps.",
      "link": "https://www.onyx.app/4506306-28"
    },
    {
      "text": "Sneha Reddy: Great—Thursday at 2:00 it is. I’ll include the checklist and a quick agenda: segment fit scoring using retention + support burden, then positioning recommendations for the top two industries. Thanks, Marco—looking forward to it.",
      "link": "https://www.onyx.app/4506306-29"
    },
    {
      "text": "Marco Aguilar: Thanks, Sneha. Talk Thursday.",
      "link": "https://www.onyx.app/4506306-30"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "sneha_reddy@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "marco_aguilar@aurorakite_software.onyx.app"
    }
  ]
}