{
  "id": "FIREFLIES_3663559",
  "semantic_identifier": "3663559 - Nightfall Beacon Entertainment - sales_call - Discussion with Audrey Pierce",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-09-22 00:00:00",
  "metadata": {
    "meeting_date": "2025-09-22 00:00:00",
    "duration_min": "40"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-09"
      ],
      "year_month": "2025-09",
      "meeting_title": "3663559 - Nightfall Beacon Entertainment - sales_call - Discussion with Audrey Pierce",
      "organizer_email": "james_choi@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "James Choi: Hi Audrey, good to connect again. Last time you mentioned you’re trying to get sharper about which industries to prioritize next quarter, especially balancing retention with support load. I wanted to walk you through how Customer_Analyzer’s fit estimation would handle that, and see if we can map it to a small pilot.",
      "link": "https://www.onyx.app/8060839-1"
    },
    {
      "text": "Audrey Pierce: Hi James. Yes, that’s still the priority. We’ve got pressure to pick two or three verticals and stop being so broad, but we don’t want to chase segments that churn or crush support.",
      "link": "https://www.onyx.app/8060839-2"
    },
    {
      "text": "James Choi: Totally. So the core of what I’d recommend we focus on is fit estimation—basically a 0–100 fit score at the account and segment level, with a driver breakdown that explains the “why.” For your use case, we’d set fit drivers like retention signals, support burden, and any usage/adoption patterns you have, then compare segments—like “industry A vs industry B”—to see which ones are most likely to renew and expand without creating a support tax.",
      "link": "https://www.onyx.app/8060839-3"
    },
    {
      "text": "Audrey Pierce: Okay. How do you actually calculate “support burden”? Because we have tickets in Zendesk, but tagging is inconsistent, and a lot of what’s painful is in notes, not in neat fields.",
      "link": "https://www.onyx.app/8060839-4"
    },
    {
      "text": "James Choi: Great question. We can ingest ticket volume and metadata, and where tagging is inconsistent, we can still start with ticket count per account, ticket severity if you have it, time-to-first-response, reopen rate—things that are typically more reliable. If you also have categories, we’ll use them; if not, we can still get directional signals. Then the model shows you how much that driver is pulling the fit score down for certain segments.",
      "link": "https://www.onyx.app/8060839-5"
    },
    {
      "text": "Audrey Pierce: “Directional” is the part that worries me. We tried something similar internally and it devolved into arguments about whether the data is even trustworthy enough to make decisions. Our CRM fields are messy, and usage data is spotty because some customers don’t fully instrument.",
      "link": "https://www.onyx.app/8060839-6"
    },
    {
      "text": "James Choi: That’s fair—and data quality is usually the make-or-break. What we do in Customer_Analyzer is surface missingness explicitly in the driver breakdown. So if a segment’s fit score is being computed with limited usage signals, you’ll see that confidence is lower and which fields are sparse. The goal isn’t to pretend the data is perfect—it’s to help you see what’s reliable enough to act on and what isn’t.",
      "link": "https://www.onyx.app/8060839-7"
    },
    {
      "text": "Audrey Pierce: But at the end of the day, we’d still be making a call on which industries to target. If the score is built on incomplete CRM and inconsistent tagging, I’m not sure I can take it to leadership as something we should trust.",
      "link": "https://www.onyx.app/8060839-8"
    },
    {
      "text": "James Choi: Understood. Let me anchor this to a concrete workflow. Step one: we pull your last 12–18 months of customers, group by industry, and compute segment-level fit based on outcomes you care about—retention and support burden. Step two: you get a comparison view: “industry segments ranked by fit,” plus the driver breakdown. Step three: we generate a recommended ICP profile based on observed outcomes—basically what patterns correlate with renewals and low support load. That becomes the artifact you take to leadership.",
      "link": "https://www.onyx.app/8060839-9"
    },
    {
      "text": "Audrey Pierce: That sounds nice in theory, but we don’t have clean “industry.” We have like 30% blank, and the rest is free text, so “Media” and “Entertainment” and “Broadcast” are all different. We’ve been trying to fix it and it’s slow.",
      "link": "https://www.onyx.app/8060839-10"
    },
    {
      "text": "James Choi: Got it. If industry is noisy, we can still do segmenting by other firmographic proxies—company size, region, revenue band—whatever is more consistent. Or we can normalize the industry field, but I’m not going to pretend that’s zero effort. The fit estimation works best when at least a couple of key drivers are reasonably complete.",
      "link": "https://www.onyx.app/8060839-11"
    },
    {
      "text": "Audrey Pierce: We’re also mid-migration in CRM. We’re moving fields around, and there are duplicates. I’m just being honest: I don’t want to buy something that immediately tells us “your data is bad” and then we spend a quarter cleaning it.",
      "link": "https://www.onyx.app/8060839-12"
    },
    {
      "text": "James Choi: I appreciate the honesty. The way we usually de-risk that is a tight pilot with a limited scope—one or two data sources. For example, we could start with retention outcomes plus Zendesk ticket volume and a couple of firmographic fields you trust. Then, even if usage events are incomplete, you’ll still get a segment ranking that’s tied to real outcomes.",
      "link": "https://www.onyx.app/8060839-13"
    },
    {
      "text": "Audrey Pierce: But even retention outcomes aren’t clean for us. Churn reasons aren’t standardized, and we have some customers that “downgrade” but don’t fully churn, and finance reports those differently than CS.",
      "link": "https://www.onyx.app/8060839-14"
    },
    {
      "text": "James Choi: That’s common. We can define the outcome together: full churn, downgrade, NRR, renewal rate—whatever leadership uses. Customer_Analyzer is flexible on what you treat as “success.” The key is choosing one definition for the pilot so the fit score is consistent.",
      "link": "https://www.onyx.app/8060839-15"
    },
    {
      "text": "Audrey Pierce: Okay, but I’m still stuck on how credible the scoring is if our fields are incomplete. Last time you showed examples with crisp driver inputs like “problem severity” and “time-to-value.” We don’t track those reliably.",
      "link": "https://www.onyx.app/8060839-16"
    },
    {
      "text": "James Choi: You don’t need every driver. You can start with a subset. In your case, the most actionable drivers for industry prioritization are: retention/NRR outcomes, support burden, and a couple of firmographics. Then we can layer in adoption later if your instrumentation improves. The model will show you “here’s what’s contributing” and “here’s what’s missing,” so you’re not guessing.",
      "link": "https://www.onyx.app/8060839-17"
    },
    {
      "text": "Audrey Pierce: But then isn’t the output kind of obvious? Like, “industries with high retention and low tickets are good.” We already know that. The hard part is that we don’t know if those patterns hold when you control for company size or onboarding differences.",
      "link": "https://www.onyx.app/8060839-18"
    },
    {
      "text": "James Choi: That’s exactly where the driver breakdown and segment comparisons help. You can see, for example, that “industry X looks good overall, but only for mid-market accounts,” or “tickets are high, but only during onboarding,” which points you to what to fix versus what to avoid. It makes the tradeoffs visible and quantifies them.",
      "link": "https://www.onyx.app/8060839-19"
    },
    {
      "text": "Audrey Pierce: I hear you. I’m just trying to map this to effort. Who on our side is doing the work to connect sources and clean fields? Because my team is stretched.",
      "link": "https://www.onyx.app/8060839-20"
    },
    {
      "text": "James Choi: For the pilot, we’d aim to keep your lift light—read-only access to CRM and Zendesk, and then a quick working session to decide the drivers and the outcome definition. But I won’t undersell it: if key fields are messy, there will be some up-front alignment and possibly a small cleanup pass.",
      "link": "https://www.onyx.app/8060839-21"
    },
    {
      "text": "Audrey Pierce: That’s the sticking point. We’re in budget season, and we’re also evaluating a couple of tools that are closer to execution—like routing and outbound automation. Those have clearer ROI for us right now. This feels more like a strategy layer we’re not resourced to operationalize.",
      "link": "https://www.onyx.app/8060839-22"
    },
    {
      "text": "James Choi: That makes sense. The reason I’m pushing this now is because industry prioritization is exactly where teams waste quarters if they choose the wrong segments. Even a lightweight fit score can prevent that. If we do a 30-day pilot and it doesn’t produce a credible segment ranking, you walk away with no ongoing commitment.",
      "link": "https://www.onyx.app/8060839-23"
    },
    {
      "text": "Audrey Pierce: Is the pilot paid?",
      "link": "https://www.onyx.app/8060839-24"
    },
    {
      "text": "James Choi: Yes—typically discounted, with the intent that if it meets agreed success criteria, we roll into an annual. We can define the criteria up front: for instance, produce a ranked list of industries with driver explanations that your leadership agrees are credible, plus an ICP summary.",
      "link": "https://www.onyx.app/8060839-25"
    },
    {
      "text": "Audrey Pierce: I don’t think I can get that approved right now. If it were free, maybe. But I can’t ask for spend on something that depends on us fixing the data first, especially while we’re migrating CRM.",
      "link": "https://www.onyx.app/8060839-26"
    },
    {
      "text": "James Choi: Understood. If budget approval is the blocker, we could also talk about timing—maybe align this for right after the CRM migration when your fields stabilize. Alternatively, we could do a non-paid scoping workshop to assess data readiness and estimate the effort, so you can make a more confident case internally.",
      "link": "https://www.onyx.app/8060839-27"
    },
    {
      "text": "Audrey Pierce: A scoping workshop could be useful, but I need to be upfront: we’re probably not buying this quarter. The data readiness piece is too uncertain, and leadership wants tools that directly move pipeline in the next 60 days.",
      "link": "https://www.onyx.app/8060839-28"
    },
    {
      "text": "James Choi: I appreciate the clarity. Why don’t we do this: we schedule a 45-minute scoping session, you bring whoever owns CRM hygiene or ops, and we’ll quickly map what fields are reliable enough for fit estimation. If we find it’s not viable, we’ll say so. If it is, you’ll have a plan and a timeline for when it makes sense.",
      "link": "https://www.onyx.app/8060839-29"
    },
    {
      "text": "Audrey Pierce: Okay. I can do that, but I can’t promise the ops person will join—everyone’s slammed. Send me an outline of what you’d need ahead of time.",
      "link": "https://www.onyx.app/8060839-30"
    },
    {
      "text": "James Choi: Will do. I’ll send a short checklist—CRM fields, how you define retention/NRR, and what’s available from Zendesk. And I’ll propose a couple of dates. Anything else you want me to include so it’s easier for you to evaluate without extra work?",
      "link": "https://www.onyx.app/8060839-31"
    },
    {
      "text": "Audrey Pierce: Include what “minimum viable” looks like—like the bare minimum fields needed to get a score that isn’t misleading. That’ll help me decide if it’s even worth pulling people in.",
      "link": "https://www.onyx.app/8060839-32"
    },
    {
      "text": "James Choi: Perfect. I’ll send that today. Thanks, Audrey—talk soon.",
      "link": "https://www.onyx.app/8060839-33"
    },
    {
      "text": "Audrey Pierce: Thanks, James. Bye.",
      "link": "https://www.onyx.app/8060839-34"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "james_choi@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "audrey_pierce@nightfall_beacon_entertainment.onyx.app"
    }
  ]
}