{
  "id": "FIREFLIES_3910621",
  "semantic_identifier": "3910621 - Marinerock Outdoor Gear - buy - Discussion with Dustin Dean",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-09-24 00:00:00",
  "metadata": {
    "meeting_date": "2025-09-24 00:00:00",
    "duration_min": "33"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-09"
      ],
      "year_month": "2025-09",
      "meeting_title": "3910621 - Marinerock Outdoor Gear - buy - Discussion with Dustin Dean",
      "organizer_email": "james_choi@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "James Choi: Hey Dustin, good to talk again. Last time we walked through how Sales_Accelerator sits on top of Salesforce and uses your existing data plus activity signals. For today, I want to keep it tight: confirm the outcomes you need for Q1, address the trust/explainability concern you raised, and—if we’re aligned—lock down next steps to get this in place.",
      "link": "https://www.onyx.app/5096578-1"
    },
    {
      "text": "Dustin Dean: Sounds good, James. We’re definitely interested. My main thing is still adoption—my managers and reps won’t follow “AI guidance” unless it’s very clear why it’s saying something.",
      "link": "https://www.onyx.app/5096578-2"
    },
    {
      "text": "James Choi: Totally fair—and that’s exactly where Sales_Accelerator is different from a black box. Let me anchor on two areas: the sales_forecast and the risk signals that drive deal reviews. On forecasting, you get commit/best-case/pipeline, but every number is explainable by drivers you can see: stage age, last touch, whether there’s a next meeting scheduled, engagement trend, and optionally fit tier if you want to weight by ICP. When a deal flips from commit to best-case, it shows the “why,” not just the “what.”",
      "link": "https://www.onyx.app/5096578-3"
    },
    {
      "text": "Dustin Dean: Okay, but in practice what does that look like? My team has been burned by tools that say “at risk” and it’s basically vibes.",
      "link": "https://www.onyx.app/5096578-4"
    },
    {
      "text": "James Choi: Yep. In your case, let’s take the example you gave me: your “SummitPro Retail Expansion” opportunity type where deals often stall in late-stage because legal and merchandising move slowly. Sales_Accelerator would flag risk with specific, visible drivers like: “Stage age is 18 days over benchmark for this segment,” “No next meeting scheduled,” and “No outbound/inbound activity in 9 days.” It’s not just a red label; it’s a checklist of conditions. Your manager can click in and see the benchmark it’s using—based on your historical cycle times for similar deals.",
      "link": "https://www.onyx.app/5096578-5"
    },
    {
      "text": "Dustin Dean: That benchmark part matters. We have different cycles for enterprise versus mid-market, and even by channel.",
      "link": "https://www.onyx.app/5096578-6"
    },
    {
      "text": "James Choi: Exactly. The forecast breaks down by segment/rep/source, so your enterprise retail channel can have different cycle-time expectations than, say, your B2B wholesale segment. And the explainability stays consistent across those slices. That also helps your VP Sales—who you said is tired of the spreadsheet rollups—because instead of debating whose spreadsheet is “right,” you can run the forecast call off the same drivers.",
      "link": "https://www.onyx.app/5096578-7"
    },
    {
      "text": "Dustin Dean: We do a lot of spreadsheet wrangling at the end of the month. It’s painful. But I still worry reps will say, “This tool doesn’t understand my deal.”",
      "link": "https://www.onyx.app/5096578-8"
    },
    {
      "text": "James Choi: That’s why we focus on surfacing signals they already believe in. Reps intuitively know “I haven’t talked to them,” or “we don’t have next steps,” or “this deal’s been sitting forever.” Sales_Accelerator just standardizes it and puts it into the forecast so it’s consistent. And it’s not telling them to do random things; it’s helping managers run targeted deal reviews. For example: “Here are the five commit deals that look like they’re weakening because stage age is high and there’s no next meeting.” That’s a very coachable conversation.",
      "link": "https://www.onyx.app/5096578-9"
    },
    {
      "text": "Dustin Dean: Right. Our deal reviews can turn into storytelling sessions. If this can keep it grounded, that’s good.",
      "link": "https://www.onyx.app/5096578-10"
    },
    {
      "text": "James Choi: Exactly. And you’re not replacing Salesforce—this sits on top. So your reps don’t have to learn a new CRM. They keep working as they do; you’re adding a layer that interprets what’s happening and makes forecasting more accurate.",
      "link": "https://www.onyx.app/5096578-11"
    },
    {
      "text": "Dustin Dean: Let’s talk accuracy. Our VP Sales wants more reliable commit. We’ve missed a couple quarters because deals slipped late.",
      "link": "https://www.onyx.app/5096578-12"
    },
    {
      "text": "James Choi: Sales_Accelerator is built for that exact use case: quarter-end accuracy with fewer surprises. The forecast combines CRM stage with activity signals and cycle-time benchmarks, so it’s harder for a deal to look “healthy” just because it’s in a late stage. If it’s late-stage but there’s no next meeting and it’s gone quiet, it will show up as risk—early enough to do something about it, not just discover it on the last week of the quarter.",
      "link": "https://www.onyx.app/5096578-13"
    },
    {
      "text": "Dustin Dean: How early are we talking? Because if it only tells us in the last two weeks, it’s not that helpful.",
      "link": "https://www.onyx.app/5096578-14"
    },
    {
      "text": "James Choi: Typically you start seeing weakening signals as soon as the activity pattern and stage age deviate from your norms—often 3–6 weeks before quarter end, depending on your cycle length. And because it’s driver-based, you can act on it: schedule the next meeting, re-engage the champion, or re-qualify and pull it out of commit. The value is less “perfect prediction,” more “earlier visibility plus a consistent standard.”",
      "link": "https://www.onyx.app/5096578-15"
    },
    {
      "text": "Dustin Dean: Okay. And what about scenario planning? You mentioned it on the earlier call.",
      "link": "https://www.onyx.app/5096578-16"
    },
    {
      "text": "James Choi: Yes—lightly, because I don’t want to boil the ocean. But it’s useful for planning. You can answer questions like: “If we add 20 SQLs in our top ICP tier, what’s the expected impact on revenue?” That helps sales ops and your VP Sales connect pipeline generation with realistic outcomes. Again, with explainability: it shows assumptions like historical win rate for similar deals and average cycle time.",
      "link": "https://www.onyx.app/5096578-17"
    },
    {
      "text": "Dustin Dean: That could help us justify headcount or push marketing for more of the right leads. But adoption is still my gate. How do we make sure reps trust it from day one?",
      "link": "https://www.onyx.app/5096578-18"
    },
    {
      "text": "James Choi: Great question. There are two practical ways we handle that. First: we start with transparency. In the rollout, we explicitly train managers and reps to read the drivers—stage age, last touch, next meeting, engagement. We’re not asking them to “believe the score,” we’re asking them to validate the drivers. Second: we run it in parallel for a short window—two to three weeks—where managers compare their forecast calls with Sales_Accelerator’s view. When they see it consistently calling out the same deals that end up slipping, trust builds quickly.",
      "link": "https://www.onyx.app/5096578-19"
    },
    {
      "text": "Dustin Dean: Parallel run makes sense. My VP Sales will ask how much work this is for ops.",
      "link": "https://www.onyx.app/5096578-20"
    },
    {
      "text": "James Choi: Very manageable. Because it sits on top of Salesforce, the core setup is mapping your stages, confirming segmentation, and connecting activity sources like email/call/meeting signals. Then we calibrate cycle-time benchmarks from your historical data. You’re not rewriting your process—you’re instrumenting it. Most teams get to a usable forecast view fast, and then refine.",
      "link": "https://www.onyx.app/5096578-21"
    },
    {
      "text": "Dustin Dean: And does it require reps to log every email or call perfectly? Because that’s… not always reality.",
      "link": "https://www.onyx.app/5096578-22"
    },
    {
      "text": "James Choi: It helps, but it’s not brittle. We can pull activity signals from connected systems so you’re not relying on perfect manual logging. And even when activity is incomplete, stage age and next meeting scheduled are strong indicators. The system is designed to work with real-world CRM hygiene.",
      "link": "https://www.onyx.app/5096578-23"
    },
    {
      "text": "Dustin Dean: Good. So if we move forward, what exactly are we buying? And what’s the timeline to value?",
      "link": "https://www.onyx.app/5096578-24"
    },
    {
      "text": "James Choi: You’re buying Sales_Accelerator for your revenue team—primarily your managers and ops for forecasting, and your AEs/SDRs for the guidance layer, though for this phase I’d recommend we focus on forecasting and risk signals first since that’s the highest urgency for you. Timeline: week 1 connect and map; week 2 calibrate and validate drivers; week 3 start parallel run; by week 4 you’re using it in forecast calls.",
      "link": "https://www.onyx.app/5096578-25"
    },
    {
      "text": "Dustin Dean: That’s reasonable. We’re trying to tighten forecasting before the next quarter ramps. Pricing-wise, we’re aligned with what you sent?",
      "link": "https://www.onyx.app/5096578-26"
    },
    {
      "text": "James Choi: Yes—same scope we discussed: Sales_Accelerator with the sales_forecast module enabled, plus the risk diagnostics that feed targeted deal reviews. No surprise add-ons. If you’re good, the cleanest path is: I send the order form today, you and procurement review, and we schedule a kickoff for next week.",
      "link": "https://www.onyx.app/5096578-27"
    },
    {
      "text": "Dustin Dean: I think we can do that. I’ll need to get final sign-off from our VP Sales, but he’s already leaning yes if we can prove it’s explainable and helps quarter-end.",
      "link": "https://www.onyx.app/5096578-28"
    },
    {
      "text": "James Choi: Perfect. Why don’t we do this: I’ll send a one-page summary you can forward—focused on the VP Sales use case: replacing spreadsheet rollups with an explainable forecast, highlighting weakening commit deals using stage age + no next meeting + low engagement, and running targeted deal reviews. Then I’ll attach the order form. If you can get me an answer by Friday, we can hold the kickoff slot for Tuesday.",
      "link": "https://www.onyx.app/5096578-29"
    },
    {
      "text": "Dustin Dean: Friday is doable. Send it over, and I’ll push it through. Assuming no curveballs, we’ll move forward.",
      "link": "https://www.onyx.app/5096578-30"
    },
    {
      "text": "James Choi: Great. I’ll get that email out within the hour. Before we wrap—any last concerns that would block you, especially around the trust piece?",
      "link": "https://www.onyx.app/5096578-31"
    },
    {
      "text": "Dustin Dean: As long as the drivers are visible like you’re describing, and we can do that parallel run, I’m comfortable. My team will challenge it, but they’ll come around if it’s grounded in real signals.",
      "link": "https://www.onyx.app/5096578-32"
    },
    {
      "text": "James Choi: That’s exactly the plan. I’ll include the parallel-run approach in the summary. Thanks, Dustin—I’ll follow up shortly, and I’ll pencil in Tuesday kickoff pending your Friday confirmation.",
      "link": "https://www.onyx.app/5096578-33"
    },
    {
      "text": "Dustin Dean: Sounds good. Talk soon, James.",
      "link": "https://www.onyx.app/5096578-34"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "james_choi@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "dustin_dean@marinerock_outdoor_gear.onyx.app"
    }
  ]
}