{
  "id": "FIREFLIES_4186045",
  "semantic_identifier": "4186045 - Moonrise Quarry Supply - sales_pitch - Discussion with Eliana Jacobs",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-09-19 00:00:00",
  "metadata": {
    "meeting_date": "2025-09-19 00:00:00",
    "duration_min": "38"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-09"
      ],
      "year_month": "2025-09",
      "meeting_title": "4186045 - Moonrise Quarry Supply - sales_pitch - Discussion with Eliana Jacobs",
      "organizer_email": "megan_foster@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Megan Foster: Hi Eliana, it’s Megan Foster—thanks for taking a few minutes. I’ll be brief. I’m calling because we built Customer_Analyzer to help teams get really clear on who their best customers are and what to say to win more of them, and I thought it might be relevant for Moonrise Quarry Supply.",
      "link": "https://www.onyx.app/7672205-1"
    },
    {
      "text": "Eliana Jacobs: Hi Megan. Okay—what exactly do you do?",
      "link": "https://www.onyx.app/7672205-2"
    },
    {
      "text": "Megan Foster: Customer_Analyzer pulls together customer signals you already have—CRM fields, onboarding survey responses, product usage, even support tickets or notes—and turns that into two things: a fit score by account and segment, and positioning recommendations based on what actually correlates with winning, retention, and expansion. Most teams use it to validate their ideal customer profile before they scale outbound or paid acquisition.",
      "link": "https://www.onyx.app/7672205-3"
    },
    {
      "text": "Eliana Jacobs: We’re not really a “SaaS startup.” We’re a supply company. I’m not sure how that maps.",
      "link": "https://www.onyx.app/7672205-4"
    },
    {
      "text": "Megan Foster: Totally fair. The workflow isn’t limited to SaaS—it’s really about segmenting customers and seeing where you get the best outcomes. For example, you might want to compare fit across contractor types, regions, company size, or order frequency, and then understand what the highest-fit segment has in common. The fit estimation feature gives you a 0–100 score plus a breakdown of the drivers—so it’s not a black box.",
      "link": "https://www.onyx.app/7672205-5"
    },
    {
      "text": "Eliana Jacobs: We already know our best customers are the repeat contractors. This sounds like analytics we could do in-house.",
      "link": "https://www.onyx.app/7672205-6"
    },
    {
      "text": "Megan Foster: If you already have strong conviction, that’s great. Where teams usually get stuck is proving it with data and aligning sales and marketing around it. The fit estimation piece lets you define drivers—like willingness to pay, time-to-value, support burden, churn risk signals—and then it compares segments side-by-side. So you can answer, “Are repeat contractors actually higher margin and lower support?” or “Which sub-segment expands?”",
      "link": "https://www.onyx.app/7672205-7"
    },
    {
      "text": "Eliana Jacobs: We don’t really track “churn” the way software does. And we’re not running paid acquisition at scale.",
      "link": "https://www.onyx.app/7672205-8"
    },
    {
      "text": "Megan Foster: Understood. In your world it might be: repeat purchase rate, frequency dropping off, returns, discount dependency, or accounts that become inactive. The concept is the same—signals that indicate whether a segment sticks and grows. On the acquisition side, even if you’re not scaling paid, the same ICP clarity helps prioritize outreach, territory planning, and what your reps emphasize.",
      "link": "https://www.onyx.app/7672205-9"
    },
    {
      "text": "Eliana Jacobs: I’m still not sure it’s worth another tool. We’re trying to cut software spend this quarter.",
      "link": "https://www.onyx.app/7672205-10"
    },
    {
      "text": "Megan Foster: That makes sense. The reason I’m reaching out is that Customer_Analyzer is designed to replace a lot of manual analysis and the “everyone has their own definition of ICP” problem. If you’re already doing this in spreadsheets, it can take weeks to pull together and it’s hard to keep current.",
      "link": "https://www.onyx.app/7672205-11"
    },
    {
      "text": "Eliana Jacobs: We don’t really do it in spreadsheets either. We use our CRM, and our team’s just experienced. It’s not perfect but it works.",
      "link": "https://www.onyx.app/7672205-12"
    },
    {
      "text": "Megan Foster: Experience is valuable. The question I’d pose is: if you had a clear driver breakdown for why certain accounts are a great fit—say, industry type plus order cadence plus low service overhead—could you make your messaging tighter and reduce the time reps spend chasing marginal accounts?",
      "link": "https://www.onyx.app/7672205-13"
    },
    {
      "text": "Eliana Jacobs: Maybe, but messaging isn’t our main issue. It’s more operational—inventory, logistics, pricing pressure.",
      "link": "https://www.onyx.app/7672205-14"
    },
    {
      "text": "Megan Foster: Got it. Customer_Analyzer is more go-to-market than ops. The positioning recommendations are meant to translate what you learn into practical messaging—value props, differentiators, proof points, objection handling—so your team is consistent. If pricing pressure is a factor, it can help identify segments that buy on value rather than discounting, and arm your team with the language that resonates with those segments.",
      "link": "https://www.onyx.app/7672205-15"
    },
    {
      "text": "Eliana Jacobs: We’re not set up to feed you product usage events or all those signals. Our data’s messy.",
      "link": "https://www.onyx.app/7672205-16"
    },
    {
      "text": "Megan Foster: That’s common. Most customers start with what they have: CRM fields, basic purchase history exports, support ticket tags, maybe an onboarding survey if you have one. You define a handful of drivers that are realistic for you, and the model scores accounts and segments from there. You can expand later.",
      "link": "https://www.onyx.app/7672205-17"
    },
    {
      "text": "Eliana Jacobs: Who typically owns this internally? Because I’m not the analytics person.",
      "link": "https://www.onyx.app/7672205-18"
    },
    {
      "text": "Megan Foster: Usually it’s someone in revenue ops, marketing ops, or product marketing—whoever is tasked with ICP, segmentation, and enablement. Sometimes it’s sales leadership if they’re trying to focus reps on the right accounts. I can’t tell from the outside who that is at Moonrise.",
      "link": "https://www.onyx.app/7672205-19"
    },
    {
      "text": "Eliana Jacobs: It’d probably be our ops manager, but they’re swamped. And to be honest, we’re not looking to kick off a new initiative right now.",
      "link": "https://www.onyx.app/7672205-20"
    },
    {
      "text": "Megan Foster: I hear you. My goal today was simply to see if it’s worth a deeper look. The next step would be a 30-minute call where we map your current segmentation, identify 5–7 fit drivers you can actually measure, and show what the fit score and driver breakdown could look like using a sample dataset.",
      "link": "https://www.onyx.app/7672205-21"
    },
    {
      "text": "Eliana Jacobs: I’m going to be straight—this doesn’t feel like a priority for us this quarter. We’re focused on vendor contracts and internal systems.",
      "link": "https://www.onyx.app/7672205-22"
    },
    {
      "text": "Megan Foster: That’s helpful context. If timing’s the issue, would it be better to revisit in a couple of months when things settle, or should I connect with your ops manager to see if there’s any appetite?",
      "link": "https://www.onyx.app/7672205-23"
    },
    {
      "text": "Eliana Jacobs: Don’t loop in ops right now. We’re trying to limit distractions. You can send something over, but I can’t promise we’ll engage.",
      "link": "https://www.onyx.app/7672205-24"
    },
    {
      "text": "Megan Foster: Absolutely. What would be most useful—a one-pager on the fit estimation output and how teams use it to validate an ICP, or a short deck with an example of segment comparisons and driver breakdown?",
      "link": "https://www.onyx.app/7672205-25"
    },
    {
      "text": "Eliana Jacobs: A one-pager is fine. Keep it high level.",
      "link": "https://www.onyx.app/7672205-26"
    },
    {
      "text": "Megan Foster: Will do. Last quick question so I tailor it: is your main segmentation today by customer type, region, or something else?",
      "link": "https://www.onyx.app/7672205-27"
    },
    {
      "text": "Eliana Jacobs: Mostly by customer type and order size. That’s enough for now.",
      "link": "https://www.onyx.app/7672205-28"
    },
    {
      "text": "Megan Foster: Perfect. I’ll send a concise overview focused on fit estimation—fit score, driver breakdown, and segment comparison—framed around validating and tightening your ICP so you can prioritize the best accounts. If it becomes relevant later, we can schedule time.",
      "link": "https://www.onyx.app/7672205-29"
    },
    {
      "text": "Eliana Jacobs: Sounds good. Thanks.",
      "link": "https://www.onyx.app/7672205-30"
    },
    {
      "text": "Megan Foster: Thanks, Eliana. I’ll get that over today, and I’ll follow up next quarter unless you tell me otherwise.",
      "link": "https://www.onyx.app/7672205-31"
    },
    {
      "text": "Eliana Jacobs: Okay. Bye.",
      "link": "https://www.onyx.app/7672205-32"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "megan_foster@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "eliana_jacobs@moonrise_quarry_supply.onyx.app"
    }
  ]
}