{
  "id": "FIREFLIES_6127437",
  "semantic_identifier": "6127437 - Jetstream Vale Aviation - sales_pitch - Discussion with Teresa Flores",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-09-27 00:00:00",
  "metadata": {
    "meeting_date": "2025-09-27 00:00:00",
    "duration_min": "41"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-09"
      ],
      "year_month": "2025-09",
      "meeting_title": "6127437 - Jetstream Vale Aviation - sales_pitch - Discussion with Teresa Flores",
      "organizer_email": "megan_foster@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Megan Foster: Hi Teresa—Megan Foster here. Thanks for taking a few minutes. I’ll keep this quick. I’m calling because we’ve been working with revenue teams who are tired of end-of-quarter forecast surprises and reps missing follow-ups after discovery, and we built a layer called Sales_Accelerator that sits on top of Salesforce or HubSpot to tighten both forecasting and next-step execution. Do you have five minutes for a high-level overview?",
      "link": "https://www.onyx.app/6818586-1"
    },
    {
      "text": "Teresa Flores: Yes, I’ve got about five minutes. We’re definitely trying to improve forecasting and deal follow-through, so go ahead.",
      "link": "https://www.onyx.app/6818586-2"
    },
    {
      "text": "Megan Foster: Perfect. At a high level, Sales_Accelerator is a sales execution layer that uses your existing CRM data—stages, amounts, close dates—but also pulls in activity signals like emails, calls, meetings, and stage age to produce an explainable forecast. So instead of “the rep feels good about it,” you get commit/best-case/pipeline views with drivers like “last touch was 12 days ago,” “no next meeting scheduled,” or “stage age is 2x your benchmark,” which helps managers and reps focus on what’s actually likely to close.",
      "link": "https://www.onyx.app/6818586-3"
    },
    {
      "text": "Teresa Flores: That sounds useful. We live in Salesforce, and the issue is leadership doesn’t trust the forecast, but reps also complain about being micromanaged when we start adding process.",
      "link": "https://www.onyx.app/6818586-4"
    },
    {
      "text": "Megan Foster: That’s exactly the balance we try to hit—more accuracy without adding busywork. Because we’re sitting on top of Salesforce, we’re not asking reps to duplicate data entry. We’re reading what’s already there plus activity signals, then translating it into two things: a clearer forecast and “best next action” guidance. The guidance is meant to be lightweight—like “this deal is drifting because there’s no scheduled next meeting,” or “you’re late in cycle relative to similar wins—here’s what to do next.”",
      "link": "https://www.onyx.app/6818586-5"
    },
    {
      "text": "Teresa Flores: Okay. When you say “activity signals,” are you looking at email and calendar metadata, or are you reading content? We have some compliance constraints.",
      "link": "https://www.onyx.app/6818586-6"
    },
    {
      "text": "Megan Foster: Great question. We can work with metadata only—things like timestamps, meeting existence, sequence of touches—without needing to ingest email body content. If a team wants content-based suggestions, that’s optional and configurable, but many customers start with metadata and CRM fields to avoid compliance headaches. The important part is that the forecast becomes explainable and auditable.",
      "link": "https://www.onyx.app/6818586-7"
    },
    {
      "text": "Teresa Flores: Explainable is good. Our leadership always asks, “Why is this deal in commit?” and it turns into an argument.",
      "link": "https://www.onyx.app/6818586-8"
    },
    {
      "text": "Megan Foster: Exactly. So in Sales_Accelerator, a commit call can be tied to drivers: stage conversion history for similar deals, stage age, last touch recency, whether there’s a next meeting on the calendar, and even scenario planning. For example: “If we add 20 SQLs in a specific segment, what’s the expected pipeline impact?” That’s useful for planning without guessing.",
      "link": "https://www.onyx.app/6818586-9"
    },
    {
      "text": "Teresa Flores: The scenario planning part is interesting. We do a lot of “what if we push more into X segment” conversations and it’s mostly spreadsheet math.",
      "link": "https://www.onyx.app/6818586-10"
    },
    {
      "text": "Megan Foster: Right—and we can base it on your actual historical conversion rates and cycle-time benchmarks rather than generic assumptions. The other piece I wanted to mention—because you brought up process and rep experience—is a very practical use case after discovery. Many AEs struggle with follow-up consistency. Our system can recommend the next steps and help the AE send a clean recap: draft a recap email, suggest a couple of tailored proof points from your approved positioning library, and create a simple mutual action plan with due dates and stakeholders so you’re multithreading instead of hoping one contact champions you.",
      "link": "https://www.onyx.app/6818586-11"
    },
    {
      "text": "Teresa Flores: That’s definitely a pain point. We’ve had deals stall because we didn’t lock down mutual steps, and the follow-up email quality is all over the place. But we also don’t want to force generic templates that feel robotic.",
      "link": "https://www.onyx.app/6818586-12"
    },
    {
      "text": "Megan Foster: Totally—if it reads like a template, it backfires. The way we approach it is: the structure is consistent, but the content is tailored. The rep gets suggestions—two proof points that match the account context and stage—and they can edit before sending. The goal is to reduce time-to-follow-up and increase clarity, not automate personality out of the process.",
      "link": "https://www.onyx.app/6818586-13"
    },
    {
      "text": "Teresa Flores: Makes sense. How hard is it to implement? We don’t have a lot of admin bandwidth right now.",
      "link": "https://www.onyx.app/6818586-14"
    },
    {
      "text": "Megan Foster: Implementation is typically lightweight because we’re not replacing Salesforce; we’re augmenting it. The core setup is connecting your CRM and activity sources and calibrating cycle-time benchmarks and stage expectations. Then we can start with one team—say a pod of AEs—and focus on two outcomes: improved forecast accuracy and better deal progression hygiene. Most teams see value quickly because the system immediately flags “at risk” patterns like slippage, stale opportunities, and missing next meetings.",
      "link": "https://www.onyx.app/6818586-15"
    },
    {
      "text": "Teresa Flores: If we did a pilot with a small AE group, what would you measure to prove it’s working?",
      "link": "https://www.onyx.app/6818586-16"
    },
    {
      "text": "Megan Foster: Great—so for forecasting, we’d look at forecast accuracy over a couple of cycles: how often commit actually closes, reduction in end-of-quarter surprises, and whether the drivers align with what leadership sees in reality. For execution, we’d measure follow-up speed after discovery, percentage of deals with a next meeting scheduled, reduction in stage slippage, and adoption of mutual action plans. Those are pretty objective and don’t require tons of manual tracking.",
      "link": "https://www.onyx.app/6818586-17"
    },
    {
      "text": "Teresa Flores: That’s helpful. One thing: we already have some dashboards and a forecasting add-on. Why would we need another layer?",
      "link": "https://www.onyx.app/6818586-18"
    },
    {
      "text": "Megan Foster: Fair question. Most forecasting add-ons either stop at “reporting what happened” or rely heavily on rep-entered fields and gut feel. The difference here is we combine CRM stage data with activity signals and benchmarks to generate an explainable view of risk and probability—plus we pair it with recommendations on what to do next per opportunity. So it’s not just a number—it’s a system that tells your team how to improve the number.",
      "link": "https://www.onyx.app/6818586-19"
    },
    {
      "text": "Teresa Flores: Got it. And you mentioned it can also use fit scoring from something else?",
      "link": "https://www.onyx.app/6818586-20"
    },
    {
      "text": "Megan Foster: Yes—if you’re using our Customer_Analyzer, we can consume the fit score as a weighting factor in forecasting and prioritization. But even if you’re not, Sales_Accelerator works standalone. If you are using fit scoring, it helps answer, “Are we spending time on deals that look like our best historical wins?” without rebuilding ICP work.",
      "link": "https://www.onyx.app/6818586-21"
    },
    {
      "text": "Teresa Flores: We don’t use Customer_Analyzer today, but we do have a rough ICP definition. Still, the execution side is where we’re struggling—especially ensuring AEs are consistent after discovery.",
      "link": "https://www.onyx.app/6818586-22"
    },
    {
      "text": "Megan Foster: That’s a great place to start. If it’s helpful, we can structure a deeper session around that exact post-discovery workflow: how recap emails get drafted, how proof points are selected, and how mutual action plans get created and tracked—then tie that back to forecasting so leadership sees leading indicators earlier.",
      "link": "https://www.onyx.app/6818586-23"
    },
    {
      "text": "Teresa Flores: I like that. Who should be on the deeper call from your side, and what would you need from us?",
      "link": "https://www.onyx.app/6818586-24"
    },
    {
      "text": "Megan Foster: From our side, it’d be me and one solutions consultant who can walk through the workflow and the forecasting drivers. From your side, ideally you plus whoever owns sales ops or forecasting, and maybe one frontline manager or a high-performing AE who can sanity-check the process. Prep is minimal: a quick look at your current stages, typical cycle time, and what tools you use for email/calendar capture.",
      "link": "https://www.onyx.app/6818586-25"
    },
    {
      "text": "Teresa Flores: That’s doable. We can bring our sales ops lead and one AE manager. What does the deeper call look like—30 minutes? 45?",
      "link": "https://www.onyx.app/6818586-26"
    },
    {
      "text": "Megan Foster: Let’s do 45 minutes so we can cover both: (1) forecasting—commit/best-case/pipeline views and slippage diagnostics—and (2) the post-discovery follow-up recommendations with mutual action plans. At the end, we’ll outline what a small pilot would look like and what success metrics you’d want.",
      "link": "https://www.onyx.app/6818586-27"
    },
    {
      "text": "Teresa Flores: Sounds good. I have time Thursday afternoon or Friday morning. Thursday around 2:00 pm works best.",
      "link": "https://www.onyx.app/6818586-28"
    },
    {
      "text": "Megan Foster: Thursday at 2:00 pm works great. What time zone are you in, Teresa—Pacific?",
      "link": "https://www.onyx.app/6818586-29"
    },
    {
      "text": "Teresa Flores: Yes, Pacific.",
      "link": "https://www.onyx.app/6818586-30"
    },
    {
      "text": "Megan Foster: Perfect—Thursday 2:00 pm Pacific for 45 minutes. I’ll send a calendar invite with a short agenda and a couple of questions for your sales ops lead so we can make it concrete. Anything specific you want us to focus on for Jetstream Vale Aviation—forecast accuracy, stage slippage, or AE follow-up consistency?",
      "link": "https://www.onyx.app/6818586-31"
    },
    {
      "text": "Teresa Flores: Prioritize AE follow-up consistency and slippage. Forecasting is important, but if we can fix the behaviors that drive it, that’s the bigger win.",
      "link": "https://www.onyx.app/6818586-32"
    },
    {
      "text": "Megan Foster: Completely aligned. I’ll frame the session around reducing slippage and tightening post-discovery execution, and then show how that improves the forecast as a downstream effect. I’ll send the invite shortly. Thanks again, Teresa—looking forward to it.",
      "link": "https://www.onyx.app/6818586-33"
    },
    {
      "text": "Teresa Flores: Great—thanks, Megan. I’ll watch for the invite and loop in the right folks.",
      "link": "https://www.onyx.app/6818586-34"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "megan_foster@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "teresa_flores@jetstream_vale_aviation.onyx.app"
    }
  ]
}