{
  "id": "FIREFLIES_7600166",
  "semantic_identifier": "7600166 - Pacific Ember Foods - sales_call - Discussion with Kent Delgado",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-09-19 00:00:00",
  "metadata": {
    "meeting_date": "2025-09-19 00:00:00",
    "duration_min": "31"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-09"
      ],
      "year_month": "2025-09",
      "meeting_title": "7600166 - Pacific Ember Foods - sales_call - Discussion with Kent Delgado",
      "organizer_email": "irene_shen@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Irene Shen: Hi Kent, good to see you again. Last time you mentioned your growth team is trying to tighten up inbound speed-to-lead and make sure reps aren’t missing follow-ups once a discovery call happens. I wanted to focus today on Sales_Accelerator—specifically the sales follow-up recommendations—so we can decide if it’s worth piloting at Pacific Ember Foods.",
      "link": "https://www.onyx.app/8316931-1"
    },
    {
      "text": "Kent Delgado: Hi Irene. Yep, that’s still the pain. We’ve got leads coming in from a couple channels, and response time is inconsistent. But I also want to be upfront: anything that reads emails or call notes tends to get blocked pretty quickly here.",
      "link": "https://www.onyx.app/8316931-2"
    },
    {
      "text": "Irene Shen: That makes sense. Let me anchor on the workflow, then we can dig into compliance. Sales_Accelerator sits on top of Salesforce—so no rip-and-replace—and it consumes the fit scores and positioning blocks you already built in Customer_Analyzer. The idea is: when an inbound lead comes in, it prioritizes the high-fit ones for first-touch, recommends a first response message tailored to the lead, and then—once meetings happen—keeps opportunities from stalling by recommending the next best action per deal.",
      "link": "https://www.onyx.app/8316931-3"
    },
    {
      "text": "Kent Delgado: When you say “recommends a first response message,” is it generating content automatically? Because we’ve had issues with tools that draft emails using customer data.",
      "link": "https://www.onyx.app/8316931-4"
    },
    {
      "text": "Irene Shen: It can, but it doesn’t have to. You can configure it to: (1) suggest a template and key talking points, or (2) draft a full email that the rep edits before sending. For your inbound speed-to-lead use case, most teams start with template-plus-bullets so reps move fast without feeling like AI is “sending for them.”",
      "link": "https://www.onyx.app/8316931-5"
    },
    {
      "text": "Kent Delgado: Okay. And what’s the actual feature you’re proposing we start with?",
      "link": "https://www.onyx.app/8316931-6"
    },
    {
      "text": "Irene Shen: The sales_followup_recommendations. Think of it as deal-progression guidance and a lightweight task queue right inside Salesforce. It looks at stage, who’s engaged, whether there’s a mutual action plan, and recent activity. Then it nudges reps with very specific next steps—like “send recap + confirm next meeting date,” “multi-thread because only one stakeholder is active,” or “fill the mutual plan checklist and set reminders.” It also suggests cadence and channel mix, so your team’s follow-through is consistent.",
      "link": "https://www.onyx.app/8316931-7"
    },
    {
      "text": "Kent Delgado: We do have stalls. But we already have Salesloft sequences and some Salesforce tasks. How is this not just another layer of noise?",
      "link": "https://www.onyx.app/8316931-8"
    },
    {
      "text": "Irene Shen: Great question. It’s less about adding tasks and more about prioritizing and standardizing what good looks like. For example, instead of ten generic tasks, it creates a small queue of “highest-impact next steps” based on what actually happened. If a meeting occurred and there’s no follow-up logged in 24 hours, it recommends the recap email. If only one contact has been emailed in a week, it suggests multi-threading and even proposes who to add—based on the persona blocks from Customer_Analyzer. It’s “what to do next” rather than “do more activity.”",
      "link": "https://www.onyx.app/8316931-9"
    },
    {
      "text": "Kent Delgado: The “based on what happened” part is where we get stuck. How does it know what happened—are you parsing call transcripts and emails?",
      "link": "https://www.onyx.app/8316931-10"
    },
    {
      "text": "Irene Shen: There are a few data sources. At minimum, it can work off CRM activity: meetings logged, stage changes, contact roles, emails logged via Salesforce. For deeper risk signals—like detecting that next steps weren’t agreed—it can optionally analyze call notes or transcripts if you connect your call recording system. But that’s optional, and we can start with CRM-only signals.",
      "link": "https://www.onyx.app/8316931-11"
    },
    {
      "text": "Kent Delgado: Optional is good, but our legal team is strict. Even call notes sometimes have PII. What’s your stance on retention and consent? Because “analyze” usually means storing something somewhere.",
      "link": "https://www.onyx.app/8316931-12"
    },
    {
      "text": "Irene Shen: Totally fair. We support configurations where raw content doesn’t get stored long-term. For many customers, we process and only retain derived signals—like “follow-up missing” or “stakeholder coverage low”—and we can set retention windows. We also support excluding fields, redaction patterns, and limiting to specific objects. But I don’t want to hand-wave it—your compliance requirements would drive the final setup.",
      "link": "https://www.onyx.app/8316931-13"
    },
    {
      "text": "Kent Delgado: I’m hearing “support configurations,” but I need specifics. Our policy is: no vendor can store or train on customer communications, and anything that touches emails needs documented consent and a defined retention period. Also, we operate in multiple regions.",
      "link": "https://www.onyx.app/8316931-14"
    },
    {
      "text": "Irene Shen: Understood. On training: we don’t train models on your customer communications by default. Retention: we can set it, and we can keep processing scoped. Regions: we can align with your data residency needs depending on your plan. If we keep phase one to CRM metadata plus Customer_Analyzer outputs, we sidestep most of the email/call content concerns while still improving speed-to-lead and follow-up consistency.",
      "link": "https://www.onyx.app/8316931-15"
    },
    {
      "text": "Kent Delgado: But then you lose the “tailored” part, right? If it’s not reading the email thread or call notes, how can it generate an objection response or a recap email?",
      "link": "https://www.onyx.app/8316931-16"
    },
    {
      "text": "Irene Shen: It can still tailor based on Customer_Analyzer positioning blocks—so your messaging aligns to ICP and value props without reading private communications. The objection response feature is strongest when it can see the objection, yes—but we can keep that out of scope initially. For the pilot, I’d focus on two outcomes: faster first-touch on high-fit inbound, and fewer deals stalled because no next step is locked.",
      "link": "https://www.onyx.app/8316931-17"
    },
    {
      "text": "Kent Delgado: Let’s talk pilot then. What exactly would you need from us, and what would success look like?",
      "link": "https://www.onyx.app/8316931-18"
    },
    {
      "text": "Irene Shen: For a 30-day pilot: connect Salesforce, connect Customer_Analyzer so we can consume fit scores and positioning blocks, configure your inbound lead routing rules, and define two or three “stall patterns” to alert on—like “meeting occurred with no follow-up,” “no activity in 7 days at stage 2,” and “single-threaded past discovery.” Success would be improving median first-response time for high-fit inbound, and reducing the percentage of opps that sit with no next step or no activity beyond a defined threshold.",
      "link": "https://www.onyx.app/8316931-19"
    },
    {
      "text": "Kent Delgado: That sounds reasonable operationally. But I can’t even get to “connect Customer_Analyzer” without procurement and security review. And those reviews are triggered the moment a tool claims it recommends messages or inspects communications.",
      "link": "https://www.onyx.app/8316931-20"
    },
    {
      "text": "Irene Shen: If it helps, we can scope the pilot to avoid communications entirely: no inbox connection, no call transcript parsing, no drafting emails. We’d do prioritization plus task recommendations only—based on CRM fields and Customer_Analyzer fit/positioning.",
      "link": "https://www.onyx.app/8316931-21"
    },
    {
      "text": "Kent Delgado: Even Customer_Analyzer positioning blocks—those might include customer segments and internal assumptions. Not PII, but still sensitive. And our security team will ask where it’s stored, who can access it, audit logs, that sort of thing.",
      "link": "https://www.onyx.app/8316931-22"
    },
    {
      "text": "Irene Shen: Yes, and we can provide documentation on access controls and audit logging. We can also restrict which fields we ingest. For example, we can ingest only the fit score and a small set of approved positioning snippets, rather than everything.",
      "link": "https://www.onyx.app/8316931-23"
    },
    {
      "text": "Kent Delgado: Irene, I appreciate the flexibility, but I’m trying to be realistic. Our sales org is 40-ish users, and my ops bandwidth is thin. If we do a pilot that’s “CRM-only task recommendations,” I worry reps ignore it because it’s not actually saving them time. And if we do the richer version, legal is going to slow-walk it for months.",
      "link": "https://www.onyx.app/8316931-24"
    },
    {
      "text": "Irene Shen: That’s a fair concern. Where do you feel the biggest pain is right now—speed-to-lead, or deal follow-up after meetings?",
      "link": "https://www.onyx.app/8316931-25"
    },
    {
      "text": "Kent Delgado: Speed-to-lead. But our SDR manager already built a dashboard and SLA alerts. The bigger issue is adoption—reps don’t always follow the process, and leadership doesn’t want another tool they have to enforce.",
      "link": "https://www.onyx.app/8316931-26"
    },
    {
      "text": "Irene Shen: That’s exactly where the recommendations and the in-CRM queue help—less policing, more guided actions. But I hear you: if it’s yet another widget, it dies. Typically, what drives adoption is when the rep sees, “Oh, it already knows this is high-fit and gives me the exact first reply to send.”",
      "link": "https://www.onyx.app/8316931-27"
    },
    {
      "text": "Kent Delgado: Which circles back to the thing we can’t do—auto-drafting based on lead details and communications. And frankly, our CIO is skeptical of any system that “recommends what to do next” without us understanding the logic. We’ve been burned by black-box scoring before.",
      "link": "https://www.onyx.app/8316931-28"
    },
    {
      "text": "Irene Shen: On explainability: the recommendation shows why it’s suggesting an action—like “no follow-up logged 24 hours after meeting,” “only one stakeholder engaged,” “mutual plan incomplete.” It’s not just a score. But if the organization is not ready for the richer workflow, we may be forcing it.",
      "link": "https://www.onyx.app/8316931-29"
    },
    {
      "text": "Kent Delgado: That’s my fear. Also: we’re in the middle of a Salesforce re-org. New stages, new fields. I can’t commit to a pilot that depends on stable opportunity stages and activity logging.",
      "link": "https://www.onyx.app/8316931-30"
    },
    {
      "text": "Irene Shen: That’s important context. The recommendations do rely on consistent stage definitions and activity capture. If those are changing right now, results might be noisy.",
      "link": "https://www.onyx.app/8316931-31"
    },
    {
      "text": "Kent Delgado: Exactly. So I’m not saying “never,” but I don’t think we’re in a place to move to buying or even a pilot in the next quarter. I’d rather revisit once our Salesforce changes settle and we’ve gotten legal aligned on comms data.",
      "link": "https://www.onyx.app/8316931-32"
    },
    {
      "text": "Irene Shen: I appreciate the clarity. Would it be helpful if I sent over a one-pager that outlines a “CRM-only” deployment vs a “comms-enriched” deployment, with explicit data sources and retention options—so you can pre-wire security and legal for later?",
      "link": "https://www.onyx.app/8316931-33"
    },
    {
      "text": "Kent Delgado: Yes, that would be useful. If you can also include what fields you’d need from Customer_Analyzer and whether we can keep it to just fit scores, that would make the conversation easier internally.",
      "link": "https://www.onyx.app/8316931-34"
    },
    {
      "text": "Irene Shen: Absolutely. I’ll send that along, and I’ll also include a sample of the explainability panel so your CIO can see it’s rule-and-signal driven, not a mystery score. Should we tentatively plan to reconnect in, say, six to eight weeks after your Salesforce changes land?",
      "link": "https://www.onyx.app/8316931-35"
    },
    {
      "text": "Kent Delgado: Let’s do eight weeks. If things slip on our side, I’ll let you know. But for now, we’re not moving forward to procurement.",
      "link": "https://www.onyx.app/8316931-36"
    },
    {
      "text": "Irene Shen: Understood. I’ll follow up with the documentation and a proposed agenda for the next touchpoint focused on security/compliance and a narrower pilot scope. Thanks, Kent.",
      "link": "https://www.onyx.app/8316931-37"
    },
    {
      "text": "Kent Delgado: Thanks, Irene. Talk soon.",
      "link": "https://www.onyx.app/8316931-38"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "irene_shen@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "kent_delgado@pacific_ember_foods.onyx.app"
    }
  ]
}