{
  "id": "FIREFLIES_8860569",
  "semantic_identifier": "8860569 - Riverstone Aeroworks - sales_pitch - Discussion with Addison Simmons",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2025-09-29 00:00:00",
  "metadata": {
    "meeting_date": "2025-09-29 00:00:00",
    "duration_min": "36"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2025-09"
      ],
      "year_month": "2025-09",
      "meeting_title": "8860569 - Riverstone Aeroworks - sales_pitch - Discussion with Addison Simmons",
      "organizer_email": "megan_foster@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Megan Foster: Hi Addison—Megan Foster here. Thanks for taking a few minutes. I’ll keep this quick: I wanted to share how Sales_Accelerator helps teams turn what’s in the CRM into an explainable forecast and clear next steps, without ripping out Salesforce or rebuilding your ICP work.",
      "link": "https://www.onyx.app/3614342-1"
    },
    {
      "text": "Addison Simmons: Hi Megan—sure, I’ve got a few minutes. We’re definitely interested in anything that improves forecasting, but we’ve already invested a lot in our CRM process. What exactly do you mean by “execution layer”?",
      "link": "https://www.onyx.app/3614342-2"
    },
    {
      "text": "Megan Foster: Totally fair. Think of Sales_Accelerator as a layer on top of your CRM that reads your existing opportunity stages plus real activity signals—emails, calls, meetings, stage age—and then produces an opportunity-level and pipeline-level forecast you can actually defend. It doesn’t replace your workflow; it diagnoses what’s happening and why. And if you’re using something like Customer_Analyzer for fit scoring, we can consume that as a weighting factor so Tier 1 opportunities show up appropriately in commit/best-case views.",
      "link": "https://www.onyx.app/3614342-3"
    },
    {
      "text": "Addison Simmons: Okay. We’re on Salesforce, and right now our forecast meetings are… a lot of manual judgment. But we’ve tried forecasting tools before and they’re usually black boxes, which leadership hates. How is this different?",
      "link": "https://www.onyx.app/3614342-4"
    },
    {
      "text": "Megan Foster: The “black box” problem is exactly what we built against. Our forecast is explainable via drivers—so for any deal, you can see what’s pushing it toward commit or pushing it out: stage age relative to benchmarks, last touch, whether a next meeting is scheduled, activity trend, and optionally fit tier and historical win rate for similar deals. So instead of “the model says no,” it’s “this deal is at risk because it’s 18 days past typical stage time and there’s no meeting on the calendar.”",
      "link": "https://www.onyx.app/3614342-5"
    },
    {
      "text": "Addison Simmons: That would help. Our biggest issue is end-of-quarter surprises. We think we have coverage, then a chunk slips. But also, pipeline isn’t uniform—some segments behave really differently.",
      "link": "https://www.onyx.app/3614342-6"
    },
    {
      "text": "Megan Foster: Exactly—Sales_Accelerator breaks forecast and slippage diagnostics down by segment, rep, and source. So you can see, for example, “Mid-market aerospace suppliers convert from discovery to proposal at X% but enterprise is stalling,” or “Rep A has a consistent stage 3 slip pattern.” Then it ties that to conversion and cycle-time benchmarks so you can pinpoint where the bottleneck is forming—not just that it exists.",
      "link": "https://www.onyx.app/3614342-7"
    },
    {
      "text": "Addison Simmons: When you say “bottleneck,” are you talking about process issues? Because we’ve debated whether our security review is happening too late, but it’s been hard to prove.",
      "link": "https://www.onyx.app/3614342-8"
    },
    {
      "text": "Megan Foster: That’s a perfect example and it maps directly to a common use case we see with sales ops. Sales_Accelerator shows stage-to-stage conversion by segment and rep, then highlights where deals slow or drop. If the data shows deals that eventually go through security review are slipping late-stage, it will recommend process adjustments—like pulling the security review step earlier, or adding a defined checkpoint in stage 2—then you can monitor whether that bottleneck improves quarter over quarter.",
      "link": "https://www.onyx.app/3614342-9"
    },
    {
      "text": "Addison Simmons: Interesting. We currently do this analysis in spreadsheets and it’s painful. But I’m curious—does this require our reps to do a bunch of extra logging? Because if the tool needs perfect activity capture, adoption will be a fight.",
      "link": "https://www.onyx.app/3614342-10"
    },
    {
      "text": "Megan Foster: We try hard to avoid “new admin work.” We pull from what you already have: CRM stage data and common activity sources. If you’re already tracking emails and meetings through your existing tools, we can use that. The goal is to reflect reality, not force new behavior. And when activity is missing, the system doesn’t just fail—it flags where the forecast confidence is lower and why.",
      "link": "https://www.onyx.app/3614342-11"
    },
    {
      "text": "Addison Simmons: Got it. And how would it show up for someone like me? I’m in RevOps, so I need the rollups, but managers want something they can use in forecast calls.",
      "link": "https://www.onyx.app/3614342-12"
    },
    {
      "text": "Megan Foster: You’d get the pipeline-level views—commit/best-case/pipeline by segment, rep, source—plus diagnostics like stage conversion and slippage trends. Managers get a deal-by-deal “what changed since last week” view and the drivers behind the forecast. The point is to make forecast calls less about arguing opinions and more about addressing the few deals that are truly off-pattern.",
      "link": "https://www.onyx.app/3614342-13"
    },
    {
      "text": "Addison Simmons: That resonates. But we’re also trying to answer “if we do X, what happens?” Like, if we increase top-of-funnel in our best segment, what’s the expected impact. Can you do that, or is it just reporting?",
      "link": "https://www.onyx.app/3614342-14"
    },
    {
      "text": "Megan Foster: We can do scenario planning. A simple example: “If we add 20 SQLs in ICP Tier 1, what’s the expected impact on pipeline and likely closed-won by end of quarter?” It uses your historical conversion and cycle-time benchmarks, and, if available, fit tier weighting. That helps you justify pipeline-generation targets with something more concrete than a gut feel.",
      "link": "https://www.onyx.app/3614342-15"
    },
    {
      "text": "Addison Simmons: Okay, scenario planning would be huge for our planning cycles. One concern: our data is messy. Stages aren’t always consistent across teams. Would that undermine the forecasts?",
      "link": "https://www.onyx.app/3614342-16"
    },
    {
      "text": "Megan Foster: Messy data is common, and we handle it in two ways. First, we surface where inconsistency is affecting outputs—like a rep who skips a stage or reopens deals frequently. Second, because the forecast blends stage data with activity signals and benchmarks, it’s more resilient than stage-only forecasting. In a lot of cases, the tool actually helps you identify where the process needs tightening because you’ll see the variance in stage duration and conversion by team.",
      "link": "https://www.onyx.app/3614342-17"
    },
    {
      "text": "Addison Simmons: Makes sense. How long does it take to get value? We’ve been burned by “six-month implementations.”",
      "link": "https://www.onyx.app/3614342-18"
    },
    {
      "text": "Megan Foster: Understood. The typical path is: connect to Salesforce and activity sources, then in the first couple of weeks you’ll have baseline forecast views and slippage diagnostics. After that, you start tuning—segment definitions, benchmarks, optional fit-score weighting if you have Customer_Analyzer. The earliest value tends to be “we finally see which stages are leaking and which deals are objectively stale.”",
      "link": "https://www.onyx.app/3614342-19"
    },
    {
      "text": "Addison Simmons: We don’t use Customer_Analyzer today, but we do have our own fit scoring model in a BI tool. Is the weighting optional?",
      "link": "https://www.onyx.app/3614342-20"
    },
    {
      "text": "Megan Foster: Totally optional. If you have a fit tier or score, we can ingest it. If you don’t, Sales_Accelerator still works off activity signals, stage, and historical outcomes. The fit weighting just makes prioritization and forecasting more nuanced—especially when you’re comparing similar-stage deals with different likelihoods to convert.",
      "link": "https://www.onyx.app/3614342-21"
    },
    {
      "text": "Addison Simmons: Understood. If we were to evaluate this, what would you suggest we look at first? Forecast accuracy is one, but I’d also want something actionable for managers.",
      "link": "https://www.onyx.app/3614342-22"
    },
    {
      "text": "Megan Foster: I’d propose two evaluation angles. One: forecast accuracy and reduction in end-of-quarter surprises—measured by slippage rates and commit reliability. Two: bottleneck identification and remediation—can we pinpoint a stage where deals stall, recommend a process fix, and then track whether conversion and cycle time improve. For managers, we’d also look at whether the “drivers” reduce time spent debating and increase time spent taking actions on at-risk deals.",
      "link": "https://www.onyx.app/3614342-23"
    },
    {
      "text": "Addison Simmons: That’s reasonable. I’d need my sales ops manager and probably one frontline sales manager to weigh in. We also have a quarterly business review coming up; if we could have something to show before that, it would help.",
      "link": "https://www.onyx.app/3614342-24"
    },
    {
      "text": "Megan Foster: Perfect. What I’d suggest is a longer working session—say 45 minutes—where we map your current stages, how you run forecasting today, and what segments matter most at Riverstone Aeroworks. Then we can show a tailored view of commit/best-case/pipeline and the slippage diagnostics you’d expect to see, plus a scenario planning example relevant to your QBR.",
      "link": "https://www.onyx.app/3614342-25"
    },
    {
      "text": "Addison Simmons: I’m open to that. Next week is tight, but the week after could work. Do you need anything from us beforehand?",
      "link": "https://www.onyx.app/3614342-26"
    },
    {
      "text": "Megan Foster: Just two things to make it productive: a screenshot or quick export of your current stage definitions and any current forecast rollup you use—nothing sensitive, even a template works. And if you have an example of a “surprise slip” from last quarter, we can walk through how the drivers would have flagged it earlier.",
      "link": "https://www.onyx.app/3614342-27"
    },
    {
      "text": "Addison Simmons: I can do that. Let’s schedule the 45-minute session. Can you send times for the week after next—preferably Tuesday or Wednesday afternoon?",
      "link": "https://www.onyx.app/3614342-28"
    },
    {
      "text": "Megan Foster: Absolutely. I’ll send a couple options for Tuesday and Wednesday afternoon, and I’ll include a short agenda: current forecast process, segment/rep/source views, bottleneck diagnostics, and one scenario planning walkthrough. If you can invite your sales ops manager and a frontline manager, we’ll make it concrete.",
      "link": "https://www.onyx.app/3614342-29"
    },
    {
      "text": "Addison Simmons: Sounds good, Megan. Send it over and I’ll loop them in.",
      "link": "https://www.onyx.app/3614342-30"
    },
    {
      "text": "Megan Foster: Great—thanks, Addison. I’ll follow up today with times and the two pre-reads. Talk soon.",
      "link": "https://www.onyx.app/3614342-31"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "megan_foster@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "addison_simmons@riverstone_aeroworks.onyx.app"
    }
  ]
}