{
  "id": "FIREFLIES_4698001",
  "semantic_identifier": "4698001 - Pinewell Logistics - sales_call - Discussion with Grace Pierce",
  "title": null,
  "source": "fireflies",
  "doc_updated_at": "2026-02-02 00:00:00",
  "metadata": {
    "meeting_date": "2026-02-02 00:00:00",
    "duration_min": "26"
  },
  "doc_metadata": {
    "hierarchy": {
      "source_path": [
        "2026-02"
      ],
      "year_month": "2026-02",
      "meeting_title": "4698001 - Pinewell Logistics - sales_call - Discussion with Grace Pierce",
      "organizer_email": "mina_park@netherite-extraction.onyx.app"
    }
  },
  "sections": [
    {
      "text": "Mina Park: Hi Grace, good to see you again. Last time you mentioned Pinewell’s support team is spending a lot of time sorting repeat tickets and translating them into something engineering can act on. I’d love to use today to confirm what “good” looks like for you and, if it fits, line up next steps to get you to a decision. Does that work?",
      "link": "https://www.onyx.app/1549185-1"
    },
    {
      "text": "Grace Pierce: Yes, that works. We’ve been talking internally since the last call, and the interest is still there. The big thing is we’re drowning in volume and losing track of what we told customers.",
      "link": "https://www.onyx.app/1549185-2"
    },
    {
      "text": "Mina Park: That’s helpful. When you say “volume,” roughly how many tickets or conversations are you dealing with per month across channels?",
      "link": "https://www.onyx.app/1549185-3"
    },
    {
      "text": "Grace Pierce: Around 5,000 a month, sometimes more if there’s a service disruption. Zendesk is the main one, but there are also emails and Intercom messages that end up copy-pasted into Zendesk.",
      "link": "https://www.onyx.app/1549185-4"
    },
    {
      "text": "Mina Park: Got it. That’s exactly the band where Issue_Tracker tends to have an immediate impact. The core idea is: we ingest those customer-reported issues, dedupe and cluster them into themes, and turn them into a standardized “issue object” that stays linked to the original conversations and the downstream Jira work. Instead of 5,000 separate items, you’re looking at something like ~80 active themes, and you route the top 10 to product/engineering weekly with representative examples and the list of impacted customers.",
      "link": "https://www.onyx.app/1549185-5"
    },
    {
      "text": "Grace Pierce: The weekly routing is what we’re trying to do now, but it’s super manual. We have someone making spreadsheets, and it’s inconsistent depending on who’s on shift.",
      "link": "https://www.onyx.app/1549185-6"
    },
    {
      "text": "Mina Park: Exactly. The feature I want to focus on today is issue_history. It’s the timeline for each cluster, and it’s designed to solve the “we lost track of what we told customers” problem you just called out. It records: when a cluster was created, if it was merged or split, how priority changed and why, what Jira/Linear items it’s linked to, and milestones like investigating → in progress → released. And it logs customer comms—who was notified, when, and what was promised—so you can be consistent across support, CS, and even sales.",
      "link": "https://www.onyx.app/1549185-7"
    },
    {
      "text": "Grace Pierce: That sounds good in theory. Our pain is that a customer will ask, “What happened to that issue you said you’d fix?” and the agent has no clue, because it’s buried in old tickets or someone wrote a note in Slack.",
      "link": "https://www.onyx.app/1549185-8"
    },
    {
      "text": "Mina Park: Right—and then you either overpromise again, or you send them on a scavenger hunt. With issue_history, if the theme is “late ETA updates in tracking,” every agent can see the current status, the last internal update, and the last customer-facing message tied to that issue cluster. Plus it’s audit-friendly: change logs, versioning on titles/tags, decision notes if something gets deprioritized. So you can answer “what did we decide and why” without relying on memory.",
      "link": "https://www.onyx.app/1549185-9"
    },
    {
      "text": "Grace Pierce: Okay. My concern is cluster quality. If the system merges two separate issues into one theme, we’ll route the wrong thing to engineering, and that erodes trust quickly. We’ve seen that with other tooling that tried to “auto-categorize.”",
      "link": "https://www.onyx.app/1549185-10"
    },
    {
      "text": "Mina Park: That’s a fair concern, and it’s one of the main risks to manage: false merges or fragmented clusters. What we do to prevent that is twofold. First, clustering is transparent—you can see the evidence: which tickets are in the cluster and the key phrases driving it. Second, we make it easy to correct: you can split a cluster or merge two clusters, and that correction is captured in issue_history so the team sees what changed and why. Over time, it adapts to your language patterns—especially when customer language varies by segment or channel, like your enterprise shippers describing something differently than SMB customers.",
      "link": "https://www.onyx.app/1549185-11"
    },
    {
      "text": "Grace Pierce: If we had to do a bunch of manual corrections every week, I’d worry it becomes another maintenance job.",
      "link": "https://www.onyx.app/1549185-12"
    },
    {
      "text": "Mina Park: Totally. What we usually see is a short “calibration” period—think the first two weeks—where your support ops lead makes a handful of merge/split decisions. After that, the volume of corrections drops sharply because the model is tuned to your taxonomy and real ticket patterns. And even during calibration, the upside is you’re not starting from scratch—you’re reviewing 80 themes, not 5,000 tickets.",
      "link": "https://www.onyx.app/1549185-13"
    },
    {
      "text": "Grace Pierce: That makes sense. Another issue for us is internal accountability. Engineering will say, “That wasn’t a commitment,” and support will say, “But we told the customer it was coming.” It becomes a blame game.",
      "link": "https://www.onyx.app/1549185-14"
    },
    {
      "text": "Mina Park: That’s exactly why issue_history includes decision notes and customer communication logs. If a cluster is deprioritized, the “why” is recorded—revenue impact, segment importance, workaround availability, whatever you choose. And if a promise was made, it’s visible and attached to the same issue object engineering is linked to. It reduces the “he said, she said,” because the timeline is the source of truth.",
      "link": "https://www.onyx.app/1549185-15"
    },
    {
      "text": "Grace Pierce: I like the idea of a defensible history. We’ve had customers escalate to leadership, and then we scramble to reconstruct what we told them three months ago.",
      "link": "https://www.onyx.app/1549185-16"
    },
    {
      "text": "Mina Park: And in logistics, those escalations can be expensive—churn risk, SLA penalties, and reputational damage. Let me pressure-test the workflow: today, how do you choose what goes into that weekly product/engineering meeting?",
      "link": "https://www.onyx.app/1549185-17"
    },
    {
      "text": "Grace Pierce: We take top ticket tags, but tags aren’t reliable. Then we add whatever is “loud” that week. We try to include customer names and deal impact, but we don’t always know the revenue exposure.",
      "link": "https://www.onyx.app/1549185-18"
    },
    {
      "text": "Mina Park: Perfect. With Issue_Tracker, the themes become the unit of work, and you can attach impacted customers and CRM context. Even if we keep scope tight for now, just getting you from “loudest” to “most impactful” is a big leap. For this call, I don’t want to boil the ocean—if we can deliver two outcomes, would that meet your buying criteria?",
      "link": "https://www.onyx.app/1549185-19"
    },
    {
      "text": "Grace Pierce: Which two?",
      "link": "https://www.onyx.app/1549185-20"
    },
    {
      "text": "Mina Park: One: reduce ticket noise—turn ~5,000 monthly tickets into a manageable set of themes so your team isn’t doing spreadsheet triage. Two: consistent customer communication—issue_history gives you a single timeline so support can answer status questions confidently and consistently.",
      "link": "https://www.onyx.app/1549185-21"
    },
    {
      "text": "Grace Pierce: Yes, those are our top two. If we can get those, it’s worth it.",
      "link": "https://www.onyx.app/1549185-22"
    },
    {
      "text": "Mina Park: Great. Then the decision points are usually: integration effort, trust in clustering, and whether the timeline fits your existing process. On integration, since you’re on Zendesk and Jira, those are standard connectors for us. On trust, we can run a short pilot where we ingest, cluster, and compare the output to your current tagging and weekly report. Would you be open to that as the final validation before purchase?",
      "link": "https://www.onyx.app/1549185-23"
    },
    {
      "text": "Grace Pierce: Yes, but I want the pilot to be very specific. I don’t want an open-ended “try it and see.”",
      "link": "https://www.onyx.app/1549185-24"
    },
    {
      "text": "Mina Park: Absolutely. Here’s what I’d propose: a two-week pilot using the last 60 days of Zendesk tickets. Success metrics: (1) we produce a weekly view of active themes—target around 60–100 themes, with top 10 clearly prioritized; (2) your support ops lead spends no more than, say, 30 minutes twice a week reviewing merges/splits; and (3) for the top 10 themes, issue_history shows a clear timeline with linked Jira items and at least one standardized customer-facing update template. How does that land?",
      "link": "https://www.onyx.app/1549185-25"
    },
    {
      "text": "Grace Pierce: That’s pretty concrete. I’d also want to see that we can split themes when the language differs. Like, enterprise customers talk about “EDI status” while SMB talks about “tracking not updating,” but it might be the same underlying bug—or not.",
      "link": "https://www.onyx.app/1549185-26"
    },
    {
      "text": "Mina Park: Great example. In the pilot, we’ll specifically test that scenario: segment-based language variation. We’ll review a couple of those borderline themes together, and we’ll document the decisions in issue_history so your team sees how it was resolved. The key is: even if we choose to keep them separate, that’s okay—the system should make that separation explicit and defensible.",
      "link": "https://www.onyx.app/1549185-27"
    },
    {
      "text": "Grace Pierce: Okay. Assuming the pilot goes well, what’s the path to rollout?",
      "link": "https://www.onyx.app/1549185-28"
    },
    {
      "text": "Mina Park: If pilot hits the metrics, rollout is basically: keep the ingestion running, set up your weekly product/engineering report view, and train two roles—support ops owner and a couple of frontline leads—on how to use issue_history for customer comms. Usually that’s one enablement session, and you’re live.",
      "link": "https://www.onyx.app/1549185-29"
    },
    {
      "text": "Grace Pierce: Timing-wise, we’d want something in place next month. Peak season is coming, and support volume will spike.",
      "link": "https://www.onyx.app/1549185-30"
    },
    {
      "text": "Mina Park: That’s doable. If we start the pilot early next week, we can finish in two weeks, do a decision review right after, and still have time for rollout before the spike. To move this to the buying stage, can we align on who signs off and what procurement needs?",
      "link": "https://www.onyx.app/1549185-31"
    },
    {
      "text": "Grace Pierce: I’m the business owner, and our Head of Support will want to see the pilot output. Procurement is straightforward if the security review is clean.",
      "link": "https://www.onyx.app/1549185-32"
    },
    {
      "text": "Mina Park: Perfect. I’ll send a short pilot plan with the success metrics we discussed, plus the security packet for your team. Can we also put a 30-minute decision meeting on the calendar for the end of the two weeks—just you, me, and your Head of Support—to review the results and either proceed or stop?",
      "link": "https://www.onyx.app/1549185-33"
    },
    {
      "text": "Grace Pierce: Yes, let’s do that. If the clustering looks good and the history solves the “what did we promise” issue, I think we’ll move forward.",
      "link": "https://www.onyx.app/1549185-34"
    },
    {
      "text": "Mina Park: Great. Last quick question: for the pilot, do you want us to focus on a particular category—tracking, billing, integrations—or just broad coverage?",
      "link": "https://www.onyx.app/1549185-35"
    },
    {
      "text": "Grace Pierce: Start with tracking and ETA updates. That’s where the duplicates are worst and where customers escalate the fastest.",
      "link": "https://www.onyx.app/1549185-36"
    },
    {
      "text": "Mina Park: Perfect. We’ll anchor the pilot on tracking/ETA themes, validate clustering quality, and showcase issue_history with those escalations so you can see the communication timeline end to end. I’ll email the plan and a couple of proposed start dates in the next hour.",
      "link": "https://www.onyx.app/1549185-37"
    },
    {
      "text": "Grace Pierce: Sounds good. I’ll watch for it and loop in our Head of Support. Thanks, Mina.",
      "link": "https://www.onyx.app/1549185-38"
    },
    {
      "text": "Mina Park: Thank you, Grace. Talk soon.",
      "link": "https://www.onyx.app/1549185-39"
    }
  ],
  "primary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "mina_park@netherite-extraction.onyx.app"
    }
  ],
  "secondary_owners": [
    {
      "display_name": null,
      "first_name": null,
      "middle_initial": null,
      "last_name": null,
      "email": "grace_pierce@pinewell_logistics.onyx.app"
    }
  ]
}